Une bonne connaissance de SQL (ou Structured Query Language) est indispensable pour les professionnels des données, tels que les scientifiques, les analystes et les ingénieurs des données. La plupart des données mondiales résident dans des bases de données. SQL est un langage puissant utilisé pour communiquer avec les bases de données et en extraire des données. Dans ce cours, vous apprendrez SQL de fond en comble, depuis les bases des instructions Select jusqu'aux concepts avancés tels que les JOINs. Vous allez : -écrire des instructions SQL fondamentales telles que : SELECT, INSERT, UPDATE et DELETE -filtrer les ensembles de résultats, utiliser les clauses WHERE, COUNT, DISTINCT et LIMIT -différencier entre DML et DDL -CREATE, ALTER, DROP et charger des tables -utiliser des modèles de chaînes de caractères et des plages ; Accéder aux bases de données en tant que data scientist en utilisant les notebooks Jupyter avec SQL et Python - Travailler avec des concepts avancés comme les procédures stockées, les vues, les transactions ACID, les JOINs internes et externes à travers des laboratoires et des projets pratiques Vous vous entraînerez à construire des requêtes SQL, à travailler avec de vraies bases de données sur le Cloud, et à utiliser de vrais outils de data science. Dans le projet final, vous analyserez plusieurs ensembles de données du monde réel pour démontrer vos compétences.


Voir moins

introduction au cours SQL

En cette ère centrée sur les données, le rôle des données et des structures utilisées pour soutenir leur utilisation deviennent de plus en plus essentiels pour l'humanité et le monde en général. La science des données est une industrie de plusieurs milliards de dollars qui ne peut que croître à mesure que nous continuons à identifier ses applications dans les sciences, la politique, les affaires et presque tous les autres secteurs de notre vie. Saviez-vous que selon une récente enquête, le marché de la science des données représentera une industrie d'un milliard de dollars dans quelques décennies. En tant que data scientist, vous pouvez gagner 124 000$ par an en moyenne. Excitant, n'est-ce pas ? Nous générons et stockons des milliards de gigaoctets de données chaque jour. Cela étant dit, la nécessité d'analyser, de manipuler et, surtout, de gérer ces informations est devenue une tâche ardue. L'importance de la science des données dans le monde d'aujourd'hui ne peut donc être surestimée. Alors que nous nous dirigeons vers un monde centré sur les données, la valeur de la science des données atteint de nouveaux sommets dans un paysage numérique en évolution rapide. Les bases de données sont de vastes référentiels. Le SQL, ou langage de requête structuré, est la clé qui débloque ces trésors, nous permettant d'interroger, de mettre à jour et de manipuler les données de manière efficace. Le SQL joue un rôle essentiel dans le flux de travail de la science des données, car il permet aux professionnels d'extraire des informations précieuses à partir de grands ensembles de données complexes. Le SQL est puissant, pertinent au niveau mondial dans l'industrie et le monde universitaire, et largement utilisé par la plupart des data scientists aujourd'hui. Un langage très polyvalent appelé Python est utilisé pour connecter diverses bases de données, exécuter des requêtes SQL et récupérer les résultats dans un format propice à une analyse plus approfondie des données. Il propose un large éventail de bibliothèques qui simplifient le processus de connexion. Ce cours vise à vous fournir les connaissances et les compétences nécessaires pour exploiter
Lisez la vidéo à partir de :2:4 et suivez la transcription2:04
efficacement la puissance des bases de données et du SQL dans vos projets de science des données. Dans le module 1 de ce cours, vous apprendrez le SQL simple pour manipuler des données dans une table de base de données. Dans le module 2, vous découvrirez les instructions de définition des données et comment créer nos tables de base de données. Dans le module 3, vous découvrirez les fonctions intégrées, les sous-requêtes et l'utilisation de plusieurs tables. Dans le module 4, vous explorerez Python pour accéder aux bases de données à l'aide de Jupiter Notebooks. Le module 5 se concentre principalement sur un projet basé sur des données du monde réel conçu pour tester ce que vous avez appris pendant le cours. Un module supplémentaire 6 couvre des concepts avancés tels que les procédures stockées, les vues, les transactions acides, les jointures internes et externes. De plus, des laboratoires pratiques et des évaluations intégrés vous permettent d'appliquer les connaissances théoriques à des scénarios du monde réel, améliorant ainsi votre compréhension et votre mémorisation des concepts. Ils sont conçus dans le seul but de maximiser l'efficacité de votre apprentissage. Tout cela rendra votre parcours de l'apprentissage à la maîtrise du SQL pour la science des données interactif , engageant et surtout efficace. Qu'est-ce que tu attends ? Embrassons ensemble ce voyage passionnant.
Obligatoire
fr
​

Introduction aux bases de données

Qu'est-ce que SQL ? Le SQL est un langage utilisé par les bases de données relationnelles pour interroger ou extraire des données d'une base de données. SQL est également appelé SQL et est l'abréviation de son nom d'origine, Structured Query Language. SQL est un langage utilisé par une base de données pour interroger des données. Mais que sont les données et qu'est-ce qu'une base de données ? Les données sont un ensemble de faits sous forme de mots, de chiffres ou même d'images. Les données constituent l'un des actifs les plus importants de toute entreprise. Il est utilisé et collecté pratiquement partout. Votre banque enregistre des données vous concernant, votre nom, votre adresse, votre numéro de téléphone, vos numéros de compte, etc. La société émettrice de votre carte de crédit et vos comptes PayPal stockent également des données vous concernant. Les données sont importantes, elles doivent donc être sécurisées, stockées et accessibles rapidement. La réponse est une base de données. Qu'est-ce qu'une base de données ? Les bases de données sont omniprésentes et utilisées tous les jours, mais elles sont généralement considérées comme allant de soi. Une base de données est un référentiel de données, c'est un programme qui stocke des données. Une base de données fournit également la fonctionnalité permettant d'ajouter, de modifier et d'interroger ces données. Il existe différents types de bases de données répondant à des exigences différentes. Les données peuvent être stockées sous différentes formes. Lorsque les données sont stockées sous forme de tableau, elles sont organisées dans des tableaux, comme dans une feuille de calcul, composée de colonnes et de lignes, c'est une base de données relationnelle. Les colonnes contiennent des propriétés relatives à l'élément, telles que le nom, le prénom, l'adresse e-mail et la ville. Un tableau est un ensemble d'éléments connexes, comme une liste d'employés ou une liste d'auteurs de livres. Dans une base de données relationnelle, vous pouvez établir des relations entre les tables. Une base de données est un référentiel de données. Un ensemble d'outils logiciels pour les données de la base de données est appelé système de gestion de base de données, ou SGBD, en abrégé. Les termes base de données, serveur de base de données, système de base de données, serveur de données et systèmes de gestion de base de données sont souvent utilisés de manière interchangeable. Pour les bases de données relationnelles, on parle de système de gestion de base de données relationnelle ou SGBDR. Le SGBDR est un ensemble d'outils logiciels qui contrôlent les données , telles que l'accès, l'organisation et le stockage. Le SGBDR constitue l' épine dorsale des applications dans de nombreux secteurs , notamment les banques, les transports, la santé, etc.
Lisez la vidéo à partir de :2:44 et suivez la transcription2:44
MySQL, la base de données Oracle, l'entrepôt DB2 et DB2 on Cloud sont des exemples de systèmes de gestion de bases de données relationnelles. Pour la plupart des utilisateurs d'une base de données, il existe cinq commandes simples pour créer un tableau : insérer des données pour remplir le tableau, sélectionner des données dans le tableau, mettre à jour les données du tableau, supprimer des données du tableau. Vous pouvez maintenant décrire ce qu'est SQL, ce que sont les données, ce qu'est une base de données et ce qu'est une base de données relationnelle.
Lisez la vidéo à partir de :3:19 et suivez la transcription3:19
Vous savez, le SGBDR signifie Système de gestion de bases de données relationnelles (SGBDR) et vous pouvez répertorier cinq commandes SQL de base pour créer une table, insérer des données pour remplir la table, sélectionner des données dans la table, mettre à jour les données dans la table et supprimer des données de la table. Merci d'avoir regardé cette vidéo.

Bonjour et bienvenue à la récupération de données avec l'instruction SELECT. Dans cette vidéo, nous allons apprendre à récupérer des données dans une table de base de données relationnelle en sélectionnant les colonnes d'une table. A la fin de cette leçon, vous serez capable de récupérer des données dans une table de base de données relationnelle, de trouver l'utilisation d'un prédicat, d'identifier la syntaxe de l'instruction SELECT en utilisant la clause WHERE, et d'énumérer les opérateurs de comparaison pris en charge par un système de gestion de base de données relationnelle. L'objectif principal d'un système de gestion de base de données, , n'est pas seulement de stocker les données, mais aussi de faciliter leur récupération. Ainsi, après avoir créé une table de base de données relationnelle et inséré des données dans la table, nous voulons voir les données. Pour voir les données, nous utilisons l'instruction SELECT. L'instruction SELECT est une instruction du langage de manipulation de données. Les instructions DML (Data Manipulation Language) sont utilisées pour lire et modifier des données. L'instruction SELECT s'appelle une requête, et le résultat que nous obtenons en exécutant cette requête s'appelle un ensemble de résultats ou une table de résultats. Dans sa forme la plus simple, une instruction SELECT est select star from table name. En nous basant sur l'exemple de l'entité book, nous créerions la table en utilisant le nom de l'entité book et les attributs de l'entité en tant que colonnes de la table. Les données seraient ajoutées à la table book en ajoutant lignes à la table à l'aide de l'instruction insert. Dans l'exemple de l'entité book, select star from book donne un ensemble de résultats de quatre lignes. Toutes les lignes de données de toutes les colonnes de la table book sont affichées. En outre, vous pouvez également récupérer toutes les lignes de toutes les colonnes en spécifiant les noms de colonne individuellement dans l'instruction SELECT. Il n'est pas toujours nécessaire d'extraire toutes les colonnes d'un tableau. Vous pouvez n'extraire qu'un sous-ensemble de colonnes. Si vous le souhaitez, vous pouvez n'extraire que deux colonnes du livre du tableau. Par exemple book_id et title. Dans ce cas, l'instruction select est select book_id, title from book. Dans ce cas, seules les deux colonnes s'affichent pour chacune des quatre lignes. Remarquez également que l'ordre des colonnes affichées correspond toujours à l'ordre de l'instruction SELECT. Cependant, que se passe-t-il si nous voulons connaître le titre du livre dont le book_id est B1. L'opération relationnelle nous aide à restreindre l'ensemble des résultats en nous permettant d'utiliser la clause WHERE. La clause WHERE nécessite toujours un prédicat. Un prédicat est conditionné à true, false ou unknown. Les prédicats sont utilisés dans la condition de recherche de la clause WHERE. Ainsi, si nous avons besoin de connaître le titre du livre dont le book_id est B1, nous utilisons la clause WHERE avec le prédicat book_id equals B1. Select book_id title from book where book_id equals B1. Remarquez que l'ensemble de résultats est maintenant restreint à une seule ligne dont la condition évalue à true. L'exemple précédent a utilisé l'opérateur de comparaison equal to dans la clause WHERE. Il existe d'autres opérateurs de comparaison pris en charge par un système de gestion de base de données relationnelle : égal à, supérieur à, inférieur à, supérieur ou égal à, inférieur ou égal à, et non égal à. Vous pouvez maintenant extraire des données et sélectionner des colonnes dans une table de base de données relationnelle, définir l'utilisation d'un prédicat, identifier la syntaxe de l'instruction SELECT à l'aide de la clause WHERE, et énumérer les opérateurs de comparaison pris en charge par un système de gestion de base de données relationnelle. Merci d'avoir regardé cette vidéo.

Exemples d’instructions SELECT
Temps estimé : 5 min

Objectifs
À la fin de cette lecture, vous apprendrez à :

Utilisez diverses requêtes SELECT pour récupérer des données à partir de la base de données.
Utilisation de l’instruction SELECT
SELECT est classé comme une commande de requête de base de données utilisée pour récupérer des informations à partir d’une table de base de données.

Il existe différentes formes dans lesquelles une instruction SELECT est utilisée.

1. ##### La syntaxe générale d’une instruction SELECT récupère les données sous les colonnes répertoriées à partir de Table_1. Le code est le suivant :

In [ ]:
SELECT COLUMN1, COLUMN2, ... FROM TABLE_1 ;

2. ##### Pour récupérer toutes les colonnes d’une table, utilisez " * " au lieu de spécifier des noms de colonnes individuelles. Le code ci-dessous récupère l’intégralité de la table.

In [ ]:
SELECT * FROM TABLE_1 ;

3. ##### Utilisez la clause WHERE pour filtrer les données requises en fonction d’un prédicat. Le code ci-dessous filtre la réponse uniquement aux entrées qui correspondent au prédicat.

SELECT <COLUMNS> FROM TABLE_1 WHERE <predicate> ;

SELECT examples
Let's look at these codes in action. Below is a database table called 'COUNTRY,' which contains the columns ID, Name, and CCode. Here, CCode is a 2 letter country code.

Exemples SELECT
Regardons ces codes en action. Vous trouverez ci-dessous une table de base de données appelée « COUNTRY », qui contient les colonnes ID, Name et CCode. Ici, CCode est un code de pays à 2 lettres.

|ID	| Name	                     | CCode|
|1	| United States of America	 | US
|2	| China	                     | CH
|3	|Japan	                     | JA
|4	|Germany	                 | GE
|5	|India	                     | IN
|6	|United Kingdom	             | UK
|7	|France	                     | FR
|8	|Italy	                     | IT
|9	|Canada	                     | CA
|10	|Brazil	                     | BR

Exemple #2
La requête SQL SELECT ID, Name FROM COUNTRY ; récupère des colonnes spécifiques à partir d’une table de base de données nommée 'COUNTRY'.

'SELECT ID, Name' indique à la base de données de sélectionner deux colonnes spécifiques dans la table : « ID » et « Name ». Il renverra ces deux colonnes pour chaque ligne qui correspond aux critères de requête.
'FROM COUNTRY' spécifie la table à partir de laquelle récupérer les données, qui est la table « COUNTRY ». Le tableau ci-dessous montre que seules les colonnes « ID » et « Name » ont été récupérées.


Réponse:

Exemple #3
La requête SQL SELECT * FROM COUNTRY WHERE ID <= 5 ; récupère toutes les colonnes de la table « COUNTRY » où la valeur de la colonne « ID » est inférieure ou égale à 5.

- SELECT * indique à la base de données de sélectionner toutes les colonnes de la table spécifiée.
- FROM COUNTRY spécifie la balle à partir de laquelle récupérer les données, qui est la table 'COUNTRY'.
- WHERE ID <= 5 ; est une condition qui filtre les lignes de la table. Il ne renverra que les lignes dont la valeur dans la colonne « ID » est inférieure ou égale

Response:

ID	|Name	|                    CCode
1	United States of America	 US
2	China	                     CH
3	Japan	                     JA
4	Germany	                     GE
5	India	                      IN

Exemple #4
La requête SQLSELECT * FROM COUNTRY WHERE CCode = 'CA' ; récupère toutes les colonnes de la table « COUNTRY » où la valeur de la colonne « CCode » est égale à « CA ».

- SELECT * indique à la base de données de sélectionner toutes les colonnes de la table spécifiée.
- FROM COUNTRY spécifie la balle à partir de laquelle récupérer les données, qui est la table 'COUNTRY'.
- WHERE CCode = 'CA' ; est une condition qui filtre les lignes de la table. Il ne renverra que les lignes dont la valeur dans la colonne « CCode » est égale à « CA ».

In [ ]:
In the lab that follows later in the module, you will apply these concepts and practice more SELECT queries hands-on.

In this reading, you learned that:

SELECT is a Database Query command that retrieves information from a database table.
The SELECT statement has various forms depending on what action you require.
The general syntax will retrieve the data under the listed columns from a named table.
Use "*" to retrieve all columns from a table without specifying individual column names.
Use the WHERE clause to filter the data based on a predicate.

Temps estimé nécessaire : 20 minutes

Dans cet atelier, vous allez apprendre l’une des instructions SQL (Structured Query Language) les plus couramment utilisées, l’instruction SELECT. L’instruction SELECT permet de sélectionner des données dans une base de données.

Objectifs

À l’issue de cet atelier, vous serez en mesure de :

Interroger une base de données pour obtenir une réponse sous la forme d’un jeu de résultats
Récupérer toutes les colonnes d’un jeu de données ou certaines d’entre elles
Appliquer des commandes de critères pour filtrer le jeu de résultats

In [ ]:
Logiciels utilisés dans cet atelier

In this lab, you will use Datasette, an open source-tool for exploring and publishing data. You can visit the Datasette GitHub repository here. https://github.com/simonw/datasette

Utilisation de Datasette
L’outil Datasette offre une plate-forme pour saisir et exécuter des requêtes SQL. En cliquant sur le bouton Envoyer la requête, vous pouvez exécuter la requête SQL.

ce cours est valable pour trois ans.

skills network labs
[labopratique](https://labs.cognitiveclass.ai/v2/tools/datasette?ulid=ulid-8b62daf2e5028281c250e15b5ea01dbbcbe84b85)

Exploration de la base de données
Explorons d’abord la base de données SanFranciscoFilmLocations à l’aide de l’outil Datasette :

1. ##### Supposons que nous voulions récupérer les détails de tous les films à partir de la table FilmLocations. Les détails de chaque enregistrement de film doivent contenir toutes les colonnes. L’instruction de requête pour cela est la suivante :

In [ ]:
SELECT * FROM FilmLocations;

Maintenant, vous pouvez faire défiler le tableau vers le bas et explorer toutes les colonnes et lignes du tableau FilmLocations pour avoir une idée globale du contenu du tableau.

 2. ##### Nous voulons récupérer les noms des films et les noms des réalisateurs et des scénaristes. La requête serait maintenant la suivante :

In [ ]:
SELECT Title, Director, Writer FROM FilmLocations;

 3. ##### Nous voulons récupérer les noms des films ainsi que les lieux de tournage et les années de sortie. Mais nous voulons également restreindre le jeu de résultats de sortie pour ne récupérer que les enregistrements de films sortis en 2001 et au-delà (années de sortie après 2001, y compris 2001).

 SELECT Title, ReleaseYear, Locations FROM FilmLocations WHERE ReleaseYear>=2001;

## Exercices pratiques sur l’instruction SELECT

 1. ##### Récupérez les faits amusants et les lieux de tournage de tous les films. Suivez l’exemple 2 de SELECT, WHERE des enregistrements contenant des détails de certaines colonnes particulières ont été récupérés.

Solutions

In [ ]:
SELECT Locations, FunFacts FROM FilmLocations;

2. ##### Récupérez les noms(Title, ReleaseYear, Locations) de tous les films sortis au 20e siècle et avant (années de sortie avant 2000, y compris 2000), ainsi que les lieux de tournage et les années de sortie.

Cliquez ici pour un indice
Suivez l’exemple 3 de SELECT, où nous avons restreint le jeu de résultats de sortie pour ne récupérer que les enregistrements de film avec certaines années de sortie. Utilisez l’opérateur de comparaison de clause WHERE <=, ce qui signifie Inférieur ou égal à.

Solutions

In [ ]:
SELECT Title, ReleaseYear, Locations  FROM FilmLocations WHERE  ReleaseYear<=2000;

3. ##### Récupérez les noms, les noms des sociétés de production, les lieux de tournage et les années de sortie des films qui n’ont pas été écrits par James Cameron.

In [ ]:
SELECT Title, ProductionCompany, Locations, ReleaseYear FROM FilmLocations WHERE Writer<>"James Cameron";

Conclusion
Congratulations on completing this lab!

You are now able to:

Query a database using SELECT statements
Retrieve all or selected columns of data
Filter the query response to meet a defined criteria

[MUSIQUE] Bonjour et bienvenue. Dans cette vidéo, nous allons présenter brièvement quelques expressions utiles qui sont utilisées avec les instructions select. La première est COUNT, COUNT est une fonction de base de données intégrée qui récupère le nombre de lignes qui correspondent aux critères de la requête. Par exemple, pour obtenir le nombre total de lignes dans un tableau donné, select COUNT(*) from tablename. Supposons que vous créiez un tableau appelé MEDALES qui possède une colonne appelée COUNTRY, et que vous souhaitiez récupérer le nombre de lignes où le récipiendaire de la médaille est originaire du Canada. Vous pouvez lancer une requête comme celle-ci : Select COUNT(COUNTRY) from MEDALS where COUNTRY='CANADA.' La deuxième expression est DISTINCT. DISTINCT est utilisée pour supprimer les valeurs dupliquées d'un ensemble de résultats. Exemple, pour récupérer des valeurs uniques dans une colonne, select DISTINCT columnname from tablename. Dans la table MEDALS mentionnée plus haut, un pays peut avoir reçu une médaille d'or plusieurs fois. Exemple, récupérer la liste des pays uniques qui ont reçu des médailles d'or. C'est-à-dire, supprimer toutes les valeurs dupliquées du même pays. Select DISTINCT COUNTRY from MEDALS where MEDALTYPE = 'GOLD'. La troisième expression est LIMIT, LIMIT est utilisé pour restreindre le nombre de lignes extraites de la base de données. Exemple, récupérer seulement les 10 premières lignes d'une table. Select * from tablename LIMIT 10. Cela peut être très utile pour examiner l'ensemble des résultats en ne regardant que quelques lignes au lieu de récupérer l'ensemble des résultats qui peut être très volumineux. Exemple, récupérer seulement quelques lignes dans le tableau MEDALES pour une année particulière. Select * from MEDALS where YEAR = 2018 LIMIT 5. Dans cette vidéo, nous avons examiné quelques expressions utiles utilisées avec les instructions select , à savoir les fonctions intégrées COUNT, DISTINCT et LIMIT. Merci d'avoir regardé cette vidéo. [MUSIQUE]

Dans cet atelier, vous allez découvrir quelques expressions utiles utilisées avec les instructions SELECT. Tout d’abord, vous allez apprendre COUNT, qui est une fonction d’agrégation qui récupère le nombre de lignes qui correspond aux critères de requête. Ensuite, vous allez apprendre DISTINCT, qui est utilisé pour supprimer les valeurs en double d’un jeu de résultats spécifié et renvoyer uniquement les valeurs uniques. Enfin, vous apprendrez LIMIT, qui est utilisé pour restreindre le nombre de lignes extraites de la table.

In this lab, you will use Datasette, an open-source multi-tool for exploring and publishing data.

labpratique

In [ ]:
SELECT * FROM FilmLocations;

Passons en revue quelques exemples de requêtes liées à COUNT.

1. ##### Supposons que l’on veuille compter le nombre d’enregistrements ou de lignes de la table « FilmLocations ». La requête pour cela serait :

In [ ]:
SELECT COUNT(*) FROM FilmLocations;

2. ##### Nous voulons compter le nombre de lieux de tournage des films. Mais nous voulons également restreindre le jeu de résultats de sortie afin de ne récupérer que le nombre de lieux des films écrits par un certain scénariste. La requête pour cela peut s’écrire comme suit :

In [ ]:
SELECT COUNT(Locations) FROM FilmLocations WHERE Writer="James Cameron";

Dans cet exercice, vous allez passer en revue quelques exemples d’utilisation de DISTINCT dans les requêtes.

3. ##### Supposons que nous souhaitions récupérer les titres de tous les films dans la table afin que les doublons soient ignorés dans le jeu de résultats de sortie.

In [ ]:
SELECT DISTINCT Title FROM FilmLocations;

4. ##### Nous voulons récupérer le nombre d’années de sortie des films produits par une société spécifique afin que les années de sortie en double de ces films soient ignorées dans le décompte.

In [ ]:
SELECT COUNT(DISTINCT ReleaseYear)  FROM FilmLocations WHERE ProductionCompany="Warner Bros. Pictures";

Dans cet exercice, vous allez d’abord passer en revue quelques exemples d’utilisation de LIMIT dans les requêtes.

5. ##### Récupérez uniquement les 25 premières lignes de la table afin que les lignes autres que celles-ci ne figurent pas dans le jeu de résultats en sortie.

In [ ]:
SELECT * FROM FilmLocations LIMIT 25;

6. ##### Maintenant, nous voulons récupérer 15 lignes de la table à partir de la ligne 11.

In [ ]:
SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;

7. ##### Récupérez le nombre de lieux(Locations) de tournage des films réalisés(Director) par Woody Allen.

In [ ]:
SELECT COUNT(Locations) FROM FilmLocations WHERE Director="Woody Allen";

8. ##### Récupérez le nombre de films(Title) tournés à Russian Hill.

In [ ]:
SELECT Count(Title) FROM FilmLocations WHERE Locations="Russian Hill";

9. ##### Récupérez le nombre de lignes dont l’année de sortie est antérieure à 1950 à partir de la table « FilmLocations ».

In [ ]:
SELECT Count(*) FROM FilmLocations WHERE ReleaseYear<1950;

10. ##### Récupérez les noms(Title) de tous les films uniques sortis(ReleaseYear) au 21e siècle et au-delà, ainsi que leurs années de sortie.

In [ ]:
SELECT DISTINCT Title, ReleaseYear FROM FilmLocations WHERE ReleaseYear>=2001;

12. ##### Récupérez les noms des réalisateurs et leurs films distincts tournés à l’hôtel de ville.

In [ ]:
SELECT DISTINCT Title,  Director FROM FilmLocations  WHERE Locations="City Hall";

13. ##### Récupérez le nombre de distributeurs qui ont distribué des films avec le 1er acteur, Clint Eastwood.

In [ ]:
SELECT COUNT(DISTINCT Distributor)  FROM FilmLocations  WHERE Actor1="Clint Eastwood";

 14. ##### Récupérez les noms des 50 premiers films.

In [ ]:
SELECT DISTINCT Title  FROM FilmLocations  LIMIT 50;

15. ##### Retrieve the first 10 film names released in 2015.

In [ ]:
SELECT DISTINCT Title  FROM FilmLocations WHERE  ReleaseYear=2015 LIMIT 11;

13. ##### Récupérez les 3 noms de films suivants qui suivent après les 5 premiers films sortis en 2015.

In [ ]:
SELECT DISTINCT Title  FROM FilmLocations WHERE  ReleaseYear=2015 LIMIT 3 OFFSET 5;

Bonjour et bienvenue sur la déclaration INSERT. Dans cette vidéo, nous allons apprendre à remplir une table de base de données relationnelle. À la fin de cette vidéo, vous serez en mesure d'identifier la syntaxe de l'instruction INSERT et d'expliquer deux méthodes pour ajouter des lignes à un tableau. Une fois la table créée, elle doit être remplie de données. Pour insérer des données dans un tableau, nous utilisons l'instruction INSERT. L'instruction INSERT est utilisée pour ajouter de nouvelles lignes à un tableau. L'instruction INSERT est l'une des instructions du langage de manipulation des données. Les instructions du langage de manipulation des données ou les instructions DML sont utilisées pour lire et modifier les données. Sur la base de l'exemple de l'entité auteur, nous avons créé la table en utilisant le nom de l'entité author et les attributs de l'entité sous forme de colonnes de la table. Nous allons maintenant ajouter les données à la table de l'auteur en ajoutant des lignes à la table. Pour ajouter les données à la table de l'auteur, nous utilisons l'instruction INSERT. La syntaxe de l'instruction INSERT est la suivante : insérez dans le nom de la table, le nom de la colonne, les valeurs. Dans cette instruction, le nom de la table identifie la table, la liste des noms de colonne identifie chaque colonne de la table et la clause values spécifie les valeurs de données à ajouter aux colonnes de la table. Pour ajouter une ligne contenant les données de Raul Chong, nous insérons une ligne avec un trait de soulignement de l'auteur : A one, le nom de famille est Chong, le prénom est Raul, le courriel RFC@IBM.com, la ville est Toronto et le pays est CA pour le Canada. La table de l'auteur comporte six colonnes. L'instruction INSERT répertorie donc les six noms de colonnes séparés par des virgules, suivis d'une valeur pour chacune des colonnes également séparées par des virgules. Il est important que le nombre de valeurs fournies dans la clause values soit égal au nombre de noms de colonnes spécifiés dans la liste des noms de colonnes. Cela garantit que chaque colonne possède une valeur. Il n'est pas nécessaire de remplir les tables une ligne à la fois, plusieurs lignes peuvent être insérées en spécifiant chaque ligne dans la clause values. Dans la clause values, chaque ligne est séparée par une virgule. Par exemple, dans cette instruction INSERT, nous insérons deux lignes, une pour Raul Chong et une pour Rav Ahuja. Vous pouvez maintenant identifier la syntaxe de l'instruction INSERT et expliquer les deux méthodes permettant d'ajouter des lignes à un tableau. Une ligne à la fois ou plusieurs lignes. Merci d'avoir regardé cette vidéo.

Bonjour et bienvenue sur la déclaration INSERT. Dans cette vidéo, nous allons apprendre à remplir une table de base de données relationnelle. À la fin de cette vidéo, vous serez en mesure d'identifier la syntaxe de l'instruction INSERT et d'expliquer deux méthodes pour ajouter des lignes à un tableau. Une fois la table créée, elle doit être remplie de données. Pour insérer des données dans un tableau, nous utilisons l'instruction INSERT. L'instruction INSERT est utilisée pour ajouter de nouvelles lignes à un tableau. L'instruction INSERT est l'une des instructions du langage de manipulation des données. Les instructions du langage de manipulation des données ou les instructions DML sont utilisées pour lire et modifier les données. Sur la base de l'exemple de l'entité auteur, nous avons créé la table en utilisant le nom de l'entité author et les attributs de l'entité sous forme de colonnes de la table. Nous allons maintenant ajouter les données à la table de l'auteur en ajoutant des lignes à la table. Pour ajouter les données à la table de l'auteur, nous utilisons l'instruction INSERT. La syntaxe de l'instruction INSERT est la suivante : insérez dans le nom de la table, le nom de la colonne, les valeurs. Dans cette instruction, le nom de la table identifie la table, la liste des noms de colonne identifie chaque colonne de la table et la clause values spécifie les valeurs de données à ajouter aux colonnes de la table. Pour ajouter une ligne contenant les données de Raul Chong, nous insérons une ligne avec un trait de soulignement de l'auteur : A one, le nom de famille est Chong, le prénom est Raul, le courriel RFC@IBM.com, la ville est Toronto et le pays est CA pour le Canada. La table de l'auteur comporte six colonnes. L'instruction INSERT répertorie donc les six noms de colonnes séparés par des virgules, suivis d'une valeur pour chacune des colonnes également séparées par des virgules. Il est important que le nombre de valeurs fournies dans la clause values soit égal au nombre de noms de colonnes spécifiés dans la liste des noms de colonnes. Cela garantit que chaque colonne possède une valeur. Il n'est pas nécessaire de remplir les tables une ligne à la fois, plusieurs lignes peuvent être insérées en spécifiant chaque ligne dans la clause values. Dans la clause values, chaque ligne est séparée par une virgule. Par exemple, dans cette instruction INSERT, nous insérons deux lignes, une pour Raul Chong et une pour Rav Ahuja. Vous pouvez maintenant identifier la syntaxe de l'instruction INSERT et expliquer les deux méthodes permettant d'ajouter des lignes à un tableau. Une ligne à la fois ou plusieurs lignes. Merci d'avoir regardé cette vidéo.

Bonjour et bienvenue à l'instruction UPDATE et à l'instruction DELETE. Dans cette vidéo, nous allons apprendre à modifier et supprimer des données dans une table de base de données relationnelle. A la fin de cette leçon, vous serez capable d'identifier la syntaxe de l'instruction UPDATE et DELETE et d'expliquer l'importance de la clause WHERE dans ces instructions. Une fois qu'une table est créée et remplie de données, les données d'une table peuvent être modifiées à l'aide de l'instruction UPDATE. L'instruction UPDATE fait partie des instructions DML (Data Manipulation Language). Les instructions DML sont utilisées pour lire et modifier des données. En nous basant sur l'exemple de l'entité auteur, nous avons créé la table en utilisant le nom de l'entité Auteur et les attributs de l'entité en tant que colonnes de la table. Des lignes ont été ajoutées à la table Auteur pour la remplir. Par la suite, vous souhaitez modifier les données de la table. Pour modifier les données de la table Auteur, nous utilisons l'instruction UPDATE. La syntaxe de l'instruction UPDATE est la suivante : UPDATE [NomTable] SET [NomColonne] = [Valeur] ]&gt; <WHERE [Condition] >. Dans l'instruction, NomTable identifie la table. ColumnName identifie la valeur de la colonne à modifier, comme spécifié dans <WHERE [Condition] >. Voyons un exemple. Dans cet exemple, vous souhaitez mettre à jour le FIRSTNAME et le LASTNAME de l'auteur avec AUTHOR_ID A2 de Rav Ahuja à Lakshmi Katta. Dans cet exemple, pour voir l'instruction UPDATE en action, nous commençons par sélectionner toutes les lignes de la table des auteurs pour voir les valeurs. Pour changer le prénom et le nom en Lakshmi Katta lorsque l'identifiant AUTHOR_ID = A2, saisissez l'instruction UPDATE comme suit. UPDATE AUTHOR SET LAST NAME = KATTA, FIRST NAME = LAKSHMI WHERE AUTHOR_ID = A2. Maintenant, pour voir le résultat de la mise à jour, sélectionnez à nouveau toutes les lignes de la table Author et vous verrez que dans la ligne le nom a changé de Rav Ahuja à Lakshmi Katta. Notez que si vous ne spécifiez pas la clause WHERE, toutes les lignes de la table seront mises à jour. Dans cet exemple, sans spécifier la clause WHERE, toutes les lignes de la table auraient changé le nom et le prénom en Lakshmi Katta. Par la suite, il peut être nécessaire de supprimer une ou plusieurs lignes d'une table. Les lignes sont supprimées à l'aide de l'instruction DELETE. L'instruction DELETE est l'une des instructions du langage de manipulation des données utilisées pour lire et modifier les données. La syntaxe de l'instruction DELETE est la suivante : DELETE FROM [TABLEName] <WHERE [Condition] >. Les lignes à supprimer sont spécifiées dans la condition WHERE. En nous basant sur l'exemple de l'entité auteur, nous voulons supprimer les lignes pour AUTHOR_ID A2 et A3. Voyons un exemple. DELETE FROM AUTHOR WHERE AUTHOR_ID IN ('A2','A3'). Notez que si vous ne spécifiez pas la clause WHERE, toutes les lignes de la table seront supprimées. Vous pouvez maintenant identifier la syntaxe de l'instruction UPDATE et DELETE et expliquer l'importance de la clause WHERE dans ces instructions. Merci d'avoir regardé cette vidéo. (Musi)

labpratique

Dans cet atelier, vous allez apprendre certaines instructions DML (Data Manipulation Language) SQL autres que SELECT couramment utilisées. Tout d’abord, vous allez apprendre l’instruction INSERT, qui est utilisée pour insérer de nouvelles lignes dans une table. Ensuite, vous allez apprendre l’instruction UPDATE qui est utilisée pour mettre à jour les données dans les lignes existantes de la table. Enfin, vous apprendrez l’instruction DELETE qui est utilisée pour supprimer des lignes d’une table.

cliquez en bas

[labpratique](https://labs.cognitiveclass.ai/v2/tools/datasette?ulid=ulid-f6c76ecb1f839e14a3172c48a471eae624bc0a41)

Concepts abordés
À quoi ressemble la syntaxe d’une instruction INSERT ?

In [ ]:
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;

In [ ]:
À quoi ressemble la syntaxe d’une instruction UPDATE ?

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;

In [ ]:
À quoi ressemble la syntaxe d’une instruction DELETE ?

In [ ]:
DELETE FROM table_name
WHERE condition
;

Dans cet exercice, vous allez d’abord passer en revue quelques exemples d’utilisation de INSERT dans des requêtes, puis résoudre certains problèmes d’exercice en l’utilisant.

- In this example, suppose we want to insert a new single row into the Instructor table.

Insérez un nouvel enregistrement d’instructeur avec l’ID 4 pour Sandip Saha qui vit à Edmonton, CA dans le tableau « Instructor ».

In [ ]:
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(4, 'Saha', 'Sandip', 'Edmonton', 'CA');

In [ ]:
SELECT * FROM Instructor;

- In this example, suppose we want to insert some new multiple rows into the Instructor table.

Problem:

In [ ]:
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');

In [ ]:
INSERT INTO Instructor([ins_id], [lastname], [firstname], [city], [country])
VALUES(7, "Cangiano", "Antonio", "Vancouver", "CA");

- Insert a new instructor record with id 7 for Antonio Cangiano who lives in Vancouver, CA into the “Instructor” table

In [ ]:
INSERT INTO table_name([columnn1],[column2], [column3], [column4], [column5])
VALUES(7, 'Cangiano', 'Antonio', 'Vancouver', 'CA');

In [ ]:
SELECT * FROM tablename;

In [ ]:
Exercise 2: UPDATE

Passons en revue quelques exemples de requêtes liées à UPDATE :

Dans cet exemple, nous voulons mettre à jour une colonne d’une ligne existante de la table.

Le nom de la table est Instructor

In [ ]:
UPDATE Instructor 
SET city='Toronto' 
WHERE firstname="Sandip";

In [ ]:
SELECT * FROM Instructor;

In [ ]:
Update the city of the instructor record to Markham whose id is 1.

In [ ]:
 UPDATE Instructor 
SET city='Markham' 
WHERE ins_id=1;

In [ ]:
SELECT * FROM Instructor;

In [ ]:
Update the city and country for Sandip with id 4 to Dhaka and BD respectively.

In [ ]:
UPDATE Instructor 
SET city='Dhaka', country='BD' 
WHERE ins_id=4;

SELECT * FROM Instructor;

- Dans cet exemple, nous voulons mettre à jour plusieurs colonnes d’une ligne existante de la table.

In [ ]:
UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5;

In [ ]:
SELECT * FROM Instructor;

In [ ]:
Exercise 3: DELETE

In [ ]:
Example exercise on DELETE

In [ ]:
in this example, we want to remove a row from the table.

Problem:

Remove the instructor record of Doe whose id is 6.

In [ ]:
DELETE FROM instructor
WHERE ins_id = 6;

In [ ]:
SELECT * FROM Instructor;

In [ ]:
example DELETE

In [ ]:
Now, let us practice creating and running a DELETE related query.


Problem:
Remove the instructor record of Hima.

In [ ]:
DELETE FROM instructor
WHERE firstname = 'Hima';

SELECT * FROM Instructor;

Command	Syntax	Description	Example
SELECT	SELECT column1, column2, ... FROM table_name; 	SELECT statement is used to fetch data from a database.	SELECT city FROM placeofinterest;
WHERE	SELECT column1, column2, ...FROM table_name WHERE condition;	WHERE clause is used to extract only those records that fulfill a specified condition.	SELECT * FROM placeofinterest WHERE city == 'Rome' ;
COUNT	SELECT COUNT * FROM table_name ; 	COUNT is a function that takes the name of a column as argument and counts the number of rows when the column is not NULL.	SELECT COUNT(country) FROM placeofinterest WHERE country='Canada';
DISTINCT	SELECT DISTINCT columnname FROM table_name;	DISTINCT function is used to specify that the statement is a query which returns unique values in specified columns.	SELECT DISTINCT country FROM placeofinterest WHERE type='historical';
LIMIT	SELECT * FROM table_name LIMIT number;	LIMIT is a clause to specify the maximum number of rows the result set must have.	SELECT * FROM placeofinterest WHERE airport="pearson" LIMIT 5;
INSERT	INSERT INTO table_name (column1,column2,column3...) VALUES(value1,value2,value3...); 	INSERT is used to insert new rows in the table.	INSERT INTO placeofinterest (name,type,city,country,airport) VALUES('Niagara Waterfalls','Nature','Toronto','Canada','Pearson');
UPDATE	UPDATE table_name SET[[column1]=[VALUES]] WHERE [condition];	UPDATE used to update the rows in the table.	UPDATE placeofinterest SET name = 'Niagara Falls' WHERE name = "Niagara Waterfalls";
DELETE	DELETE FROM table_name WHERE [condition]; 	DELETE statement is used to remove rows from the table which are specified in the WHERE condition.	DELETE FROM placeofinterest WHERE city IN ('Rome','Vienna');

Concepts des bases de données relationnelles

(Musique) Bonjour et bienvenue sur Database Concepts. Dans cette vidéo, nous allons découvrir différents types de modèles, comment nous les utilisons des modèles pour mapper des données sur des tables et définir des relations entre les tables. À la fin de cette leçon, vous serez en mesure d' expliquer l'avantage de la relation modèle, expliquez comment le nom et les attributs de l'entité correspondent à une base de données relationnelle tableau, décrivez la différence entre une entité et un attribut, identifiez certains types de données couramment utilisés, et décrivent la fonction des clés primaires. Le modèle relationnel est le modèle de données le plus utilisé pour les bases de données car le modèle permet l'indépendance des données. Les données sont stockées dans une structure de données simple. Tableaux : cela garantit l'indépendance des données logiques, l'indépendance des données physiques et l'indépendance du stockage physique. Un modèle de données de relation entre entités, ou ER modèle de données, est une alternative au modèle de données relationnel. À l'aide d'un base de données de bibliothèque à titre d'exemple, cette figure montre une relation entre entités diagramme ou ERD qui représente les entités appelées tables et leurs relations. Dans pour l'exemple de la bibliothèque, nous avons des livres. Un livre peut être écrit par un ou plusieurs auteurs. La bibliothèque peut avoir un ou plusieurs exemplaires d'un livre. Chaque copie peut être empruntée par un seul emprunteur à la fois. Un modèle de relation entre entités propose de penser à une base de données en tant qu'ensemble d'entités plutôt que d'être utilisée comme modèle sur son propre. Le modèle ER est utilisé comme outil pour concevoir des bases de données relationnelles. Aux urgences modèle, les entités sont des objets qui existent indépendamment de toute autre entité dans la base de données. Les éléments constitutifs d'un diagramme ER sont entités et attributs. Une entité peut être un nom : personne, lieu ou chose. Dans un diagramme ER, une entité est dessinée sous la forme d'un rectangle. Les entités possèdent des attributs qui sont les éléments de données qui caractérisent les entité. Les attributs nous en disent plus sur l' entité. Dans un diagramme ER, les attributs sont dessinés sous forme d'ovales. En utilisant une bibliothèque simplifiée comme exemple, le livre est un exemple d'entité. Les attributs sont certaines propriétés ou caractéristiques de une entité et dites-nous en plus sur cette entité. Le livre d'entités comporte des attributs tels que le titre du livre, l'édition du livre, l'année où le livre a été écrit, etc. Les attributs sont connectés à une seule entité. Le livre d'entités devient une table dans la base de données et les attributs deviennent les colonnes d'une table. Une table est une combinaison de lignes et de colonnes. Lors du mappage, l'entité devient la table. Cela dit, le tableau n'a pas encore pris la forme de lignes et de colonnes. Le les attributs sont traduits en colonnes dans un tableau fournissant le tableau réel forme de lignes et de colonnes. Plus tard, nous ajoutons des valeurs de données à chacune des colonnes, qui complète le formulaire de tableau. Chaque attribut stocke les valeurs de données de différents formats, caractères, chiffres , dates, devises et bien d'autres encore. Dans l'exemple d'une table de livres, le titre est composé de caractères. Comme les titres de livres varient en longueur, nous pouvons définir le type de données de caractère variable pour la colonne de titre : VAR char. Pour les colonnes de caractères dont la longueur ne varie pas, nous utilisons un caractère ou un caractère. Le Les colonnes relatives à l'édition et à l'année seraient numériques. La colonne ISBN serait gravée car elle contient des tirets ainsi que des chiffres, etc. Utilisation de l'entité livre mappage à titre d'exemple, nous pouvons créer les tables pour le reste de notre exemple de bibliothèque simplifiée utilisant des noms d'entités, tels que l'auteur, la liste des auteurs, emprunteur, prêt et copie. Les attributs de l'entité seront les colonnes du tables. Une clé primaire est attribuée à chaque table. La clé primaire d'une relation la table identifie de manière unique chaque tuple ou ligne d'une table, empêchant ainsi la duplication de données et fournissant un moyen de définir les relations entre les tables. Les tables peuvent contiennent également des clés étrangères qui sont des clés primaires définies dans d'autres tables, création d'un lien entre les tables. Vous savez maintenant que le principal avantage du le modèle relationnel est l' indépendance et le stockage des données logiques et physiques indépendance. Les entités sont des objets indépendants qui peuvent avoir plusieurs caractéristiques appelées attributs. Lors du mappage vers une base de données relationnelle, les entités sont représentées sous forme de tables et les attributs sont mappés à des colonnes. Les types de données courants incluent des caractères tels que la voiture et le caractère VAR, des nombres tels que des nombres entiers et décimaux, ainsi que des horodatages tels que la date et l'heure. Une clé primaire identifie de manière unique une ligne spécifique d'une table et empêche la duplication des données. (Musique)

Types d'instructions SQL (DDL vs. DML)

Bienvenue dans la section Types d'instructions SQL. À la fin de la vidéo, vous serez en mesure de faire la distinction entre les instructions en langage de définition des données et les instructions en langage de manipulation des données. Les instructions SQL sont utilisées pour interagir avec les entités (c'est-à-dire les tables), les attributs (c'est-à-dire les colonnes) et leurs tuples (ou les lignes contenant des valeurs de données) dans les bases de données relationnelles. Les instructions SQL se répartissent en deux catégories différentes : les instructions du langage de définition des données et les instructions du langage de manipulation des données. Les instructions DDL (Data Definition Language) sont utilisées pour définir, modifier ou supprimer des objets de base de données tels que des tables. Les types d'instructions DDL courants incluent CREATE, ALTER, TRUNCATE et DROP. CREATE : qui est utilisé pour créer des tables et définir leurs colonnes ; ALTER : est utilisé pour modifier les tables, notamment en ajoutant et en supprimant des colonnes et en modifiant leurs types de données ; TRUNCATE : est utilisé pour supprimer les données d'une table mais pas la table elle-même ; DROP : est utilisé pour supprimer des tables. Les instructions DML (Data Manipulation Language) sont utilisées pour lire et modifier les données des tables. Ces opérations sont également parfois appelées opérations CRUD, c'est-à-dire créer, lire, mettre à jour et supprimer des lignes dans une table. Les types d'instructions DML courants incluent INSERT, SELECT, UPDATE et DELETE. INSERT : est utilisé pour insérer une ligne ou plusieurs lignes de données dans un tableau ; SELECT : lit ou sélectionne une ou plusieurs lignes d'un tableau ; UPDATE : édite une ou plusieurs lignes d'un tableau ; et DELETE : supprime une ou plusieurs lignes de données d'un tableau. Vous savez maintenant que : les instructions DDL ou Data Definition Language sont utilisées pour définir ou modifier des objets dans une base de données tels que des tables. De plus, les instructions DML ou Data Manipulation Language sont utilisées pour manipuler ou utiliser des données dans des tables. Merci d'avoir regardé cette vidéo.

Déclaration CREATE TABLEStatut

Bonjour, et bienvenue à la déclaration CREATE TABLE. Dans cette vidéo, nous allons apprendre à créer une table de base de données relationnelle. À la fin de la vidéo, vous pourrez faire la distinction entre les instructions de langage de définition de données et les instructions de langage de manipulation de données, et expliquer comment le nom d'entité et les attributs sont utilisés pour créer une table de base de données relationnelle.
Lisez la vidéo à partir de ::31 et suivez la transcription0:31
Les instructions SQL sont utilisées pour interagir avec les entités (c'est-à-dire les tables), les attributs (c'est-à-dire les colonnes) et leurs tuples (ou les lignes avec des valeurs de données) dans les bases de données relationnelles. Les instructions SQL se répartissent en deux catégories différentes : les instructions Data Definition Language et les instructions Data Manipulation Language. Les instructions Data Definition Language (ou DDL) sont utilisées pour définir, modifier ou supprimer des objets de base de données tels que des tables. Les types d'instructions DDL courants sont : CREATE, ALTER, TRUNCATE et DROP. CREATE : qui est utilisé pour créer des tables et définir ses colonnes ALTER : est utilisé pour modifier des tables, y compris ajouter et déposer des colonnes et modifier leurs types de données TRUNCATE : est utilisé pour supprimer des données dans une table mais pas la table elle-même DROP : est utilisé pour supprimer des tables Données Manipulation Language (ou DML) instructions sont utilisées pour lire et modifier les données des tables. Elles sont également parfois appelées opérations CRUD, c'est-à-dire Créer, Lire, Mettre à jour et Supprimer des lignes dans une table. Les types d'instructions DML courants incluent : INSERT, SELECT, UPDATE et DELETE. INSERT : est utilisé pour insérer une ligne ou plusieurs lignes de données dans une table SELECT : lit ou sélectionne une ligne ou des lignes d'une table UPDATE : édite une ligne ou des lignes d'une table Et DELETE : supprime une ou plusieurs lignes de données d'une table Maintenant, regardons l'instruction DDL la plus courante — CREATE. La syntaxe de la table CREATE est montrée ici : Vous commencez par « CREATE TABLE » suivi du nom de la table que vous voulez créer Puis placez le reste de l'instruction à l'intérieur d'une paire de parenthèses ou de crochets ronds. Chaque ligne à l'intérieur de la parenthèse spécifie le nom d'une colonne suivie de son type de données et éventuellement quelques valeurs facultatives supplémentaires que nous verrons plus tard. Chaque définition d'attribut ou de colonne est séparée par une virgule. Par exemple, si nous voulons créer une table pour les provinces au Canada, vous devez spécifier : CREATE TABLE provinces (id char (2) Clé primaire non null nom de virgule varchar (24) close parenthèses Dans cet exemple, les types de données utilisés sont : CHAR qui est une chaîne de caractères d'une longueur fixe, dans ce cas 2. Et VARCHAR, qui est une chaîne de caractères d'une longueur variable. Dans ce cas, ce champ de caractère variable peut contenir jusqu'à 24 caractères. L' émission de cette instruction créerait une table dans la base de données avec 2 colonnes. L' identifiant de la première colonne pour stocker les codes abrégés de province à 2 lettres tels que AB, BC, etc. Et la deuxième colonne appelée nom pour stocker le nom complet de la province, comme ALBERTA, COLOMBIE-BRITANNIQUE, etc. Maintenant, regardons un exemple plus élaboré basé sur la base de données de la bibliothèque. Cette base de données comprend plusieurs entités telles que AUTHOR, BOOK, BORROWER, etc. Commençons par créer la table pour l'entité AUTHOR. Le nom de la table sera AUTHOR, et ses attributs tels que AUTHOR_ID, FIRSTNAME, LASTNAME, etc. seront les colonnes de la table. Dans ce tableau, nous allons également affecter l'attribut Author_ID comme clé primaire, de sorte qu'aucune valeur en double ne puisse exister. Rappel, la clé primaire d'une table relationnelle identifie de manière unique chaque tuple (ou ligne) d'une table. Pour créer la table Auteur, exécutez la commande suivante : CREATE TABLE author (author_id CHAR (2) PRIMARY KEY NOT NULL, lastname VARCHAR (15) NOT NULL, firstname VARCHAR (15) NOT NULL, email VARCHAR (40), city VARCHAR (15), pays CHAR (2))
Lisez la vidéo à partir de :5:11 et suivez la transcription5:11
Notez que l'ID est la clé primaire. Cette contrainte empêche les valeurs en double dans la table. Notez également que Nom et Prénom ont la contrainte NOT NULL. Cela garantit que ces champs ne peuvent pas contenir de valeur NULL, car un auteur doit avoir un nom. Vous savez maintenant que : les instructions DDL ou Data Definition Language sont utilisées pour définir ou modifier des objets dans une base de données comme des tables. Les instructions DML ou Data Manipulation Language sont utilisées pour manipuler ou travailler avec des données dans des tables. CREATE est une instruction DDL permettant de créer des entités ou des tables dans une base de données. L' instruction CREATE TABLE inclut la définition des attributs des colonnes de la table, y compris les noms des colonnes Type de données des colonnes et d'autres valeurs facultatives si nécessaire, telles que la contrainte de clé primaire Merci d'avoir regardé cette vidéo.

In [ ]:
ALTER, DROP et Troncature des tables

Bonjour et bienvenue aux tables ALTER, DROP et TRUNCATE. Après avoir regardé cette vidéo, vous serez en mesure de : Décrire les instructions ALTER TABLE, DROP TABLE et TRUNCATE. Expliquer la syntaxe. Utiliser les instructions dans les requêtes. Vous utilisez l'instruction ALTER TABLE pour ajouter ou supprimer des colonnes d'une table, pour modifier le type de données des colonnes, pour ajouter ou supprimer des clés, et pour ajouter ou supprimer des contraintes. La syntaxe de l'instruction ALTER TABLE est présentée ci-dessous. Vous commencez par ALTER TABLE suivi du nom de la table que vous souhaitez modifier. Contrairement à l'instruction CREATE TABLE, vous n'utilisez pas de parenthèses pour entourer les paramètres de l'instruction ALTER TABLE. Chaque ligne de l'instruction ALTER TABLE spécifie une modification que vous souhaitez apporter à la table. Par exemple, pour ajouter une colonne de numéro de téléphone à la table AUTHOR de la base de données Library afin de stocker le numéro de téléphone de l'auteur, utilisez l'instruction suivante : ALTER TABLE author ADD COLUMN telephone_number BIGINT ; Dans cet exemple, le type de données de la colonne est BIGINT, qui peut contenir un nombre d'une longueur maximale de 19 chiffres. Vous pouvez également utiliser l'instruction ALTER TABLE pour modifier le type de données d'une colonne. Pour ce faire, utilisez la clause ALTER COLUMN en spécifiant le nouveau type de données de la colonne. Par exemple, l'utilisation d'un type de données numérique pour le numéro de téléphone signifie que vous ne pouvez pas inclure des parenthèses, des signes plus ou des tirets dans le numéro. Vous pouvez modifier la colonne pour utiliser le type de données CHAR afin de résoudre ce problème. Le code suivant montre comment modifier la table auteur : ALTER TABLE author ALTER COLUMN telephone_number SET DATA TYPE CHAR(20 ) ; La modification du type de données d'une colonne contenant des données existantes peut toutefois poser des problèmes si les données existantes ne sont pas compatibles avec le nouveau type de données. Par exemple, le passage d'une colonne de type CHAR à un type de données numériques ne fonctionnera pas si la colonne contient déjà des données non numériques. Si vous essayez de faire cela, vous verrez un message d'erreur dans le journal de notification et l'instruction ne s'exécutera pas. Si votre spécification change et que vous n'avez plus besoin de cette colonne supplémentaire, vous pouvez à nouveau utiliser l'instruction ALTER TABLE, cette fois avec la clause DROP COLUMN, pour supprimer la colonne comme indiqué : ALTER TABLE author DROP COLUMN telephone_number ; Tout comme vous utilisez DROP COLUMN pour supprimer une colonne d'une table, vous utilisez l'instruction DROP TABLE pour supprimer une table d'une base de données.
Lisez la vidéo à partir de :2:58 et suivez la transcription2:58
Si vous supprimez une table qui contient des données, les données seront par défaut supprimées en même temps que la table. La syntaxe de l'instruction DROP TABLE est la suivante : DROP TABLE nom_de_la_table ; Vous pouvez donc utiliser cette instruction : DROP TABLE auteur ; pour supprimer la table de la base de données.
Lisez la vidéo à partir de :3:18 et suivez la transcription3:18
Il peut arriver que vous souhaitiez simplement supprimer les données d'une table plutôt que la table elle-même. Bien que vous puissiez utiliser l'instruction DELETE sans clause WHERE pour ce faire, il est généralement plus rapide et plus efficace de tronquer la table. Vous utilisez l'instruction TRUNCATE TABLE pour supprimer toutes les lignes d'une table. La syntaxe de l'instruction est la suivante : TRUNCATE TABLE nom_de_table IMMEDIATE ; L'expression IMMEDIATE indique que l'instruction doit être traitée immédiatement et qu'elle ne peut pas être annulée. Ainsi, pour tronquer la table auteur, vous utilisez cette instruction : TRUNCATE TABLE auteur IMMEDIATE ; Dans cette vidéo, vous avez appris que : L'instruction ALTER TABLE modifie la structure d'une table existante, par exemple, pour ajouter, modifier ou supprimer des colonnes. L'instruction DROP TABLE supprime une table existante. L'instruction TRUNCATE TABLE supprime toutes les lignes de données d'une table.

(lien pour l'exemple d'utilisation des instructions  ALTER, TRUNCATE, DROP)[https://www.coursera.org/learn/sql-data-science/ungradedWidget/bIDoK/examples-to-alter-and-truncate-tables-using-mysql]

Reading: Examples to ALTER and TRUNCATE tables using MySQL
Estimated time to complete: 5 minutes

In the previous video, the ALTER and TRUNCATE syntax applies to DB2. There are variations in syntax between different databases. This reading will explore some examples of ALTER and TRUNCATE statements using MySQL.

Objective(s)
At the end of this reading, you will be able to:

- Use the ALTER TABLE statement in the correct syntax.
- Use TRUNCATE statements in syntax.
- Execute examples of ALTER and TRUNCATE statements.

# ADD COLUMN syntax

In [ ]:
ALTER TABLE table_name
ADD column_name data_type;

In [ ]:
Une variante de la syntaxe d’ajout de colonne est la suivante :

In [ ]:
ALTER TABLE table_name
ADD COLUMN column_name data_type;

In [ ]:
By default, all the entries are initially assigned the value NULL. You can then use UPDATE statements to add the necessary column values.

For example, to add a telephone_number column to the author table in the library database, the statement will be written as:

In [ ]:
ALTER TABLE author 
ADD telephone_number BIGINT;

In [ ]:
Ici, BIGINT est un type de données pour Big Integer.
Après avoir ajouté les entrées à la nouvelle colonne, un exemple de sortie est affiché ci-dessous.

# Modify column data type

In [ ]:
ALTER TABLE table_name
MODIFY column_name data_type;

In [ ]:
Sometimes, the data presented may be in a different format than required. 
In such a case, we need to modify the data_type of the column. 
For example, using a numeric data type for telephone_number means you cannot 
include parentheses, plus signs, or dashes as part of the number.
For such entries, the appropriate choice of data_type is CHAR.

In [ ]:
To modify the data type, the statement will be written as:

In [ ]:
ALTER TABLE author
MODIFY telephone_number CHAR(20);

In [ ]:
The entries can then be updated using UPDATE statements. An updated version of the "author" table is shown below.

# TRUNCATE Table

In [ ]:
permet de supprimer toutes les lignes.

In [ ]:
TRUNCATE TABLE statements are used to delete all of the rows in a table. The syntax of the statement is:

In [ ]:
TRUNCATE TABLE table_name;

In [ ]:
So, to truncate the "author" table, the statement will be written as:

In [ ]:
TRUNCATE TABLE author;

# Exemples de création et de suppression de tables

In [ ]:
CREATE TABLE statement
In the previous video, we saw the general syntax to create a table:

In [ ]:
CREATE TABLE TableName (
   COLUMN1 datatype,
   COLUMN2 datatype,
   COLUMN3 datatype, 
   ...
);

- Create a TEST table with two columns - ID of type integer and NAME of type varchar.
For this, we use the following SQL statement.

In [ ]:
CREATE TABLE TEST (
   ID int,
   NAME varchar(30)
);

- Create a COUNTRY table with an integer ID column, a two-letter country code column, and a variable length country name column. For this, we may use the following SQL statement.

In [ ]:
CREATE TABLE COUNTRY (
   ID int,
   CCODE char(2),
   Name varchar(60)
);

In [ ]:
In the example above, make ID a primary key. Then, the statement will be modified as shown below.

In [ ]:
CREATE TABLE COUNTRY (
   ID int NOT NULL,
   CCODE char(2),
   Name varchar(60)
   PRIMARY KEY (ID)
);

Dans l’exemple ci-dessus, la contrainte NOT NULL est ajoutée à la colonne ID après le type de données, ce qui signifie qu’elle ne peut pas contenir de valeur NULL ou vide. Ceci est ajouté car la base de données n’autorise pas les clés primaires à avoir des valeurs NULL.

# DROP TABLE

Si la table que vous essayez de créer existe déjà dans la base de données, vous obtiendrez une erreur indiquant que la table XXX.YYY existe déjà. Pour contourner cette erreur, créez une table avec un nom différent ou supprimez d’abord la table existante. Il est courant d’émettre un DROP avant d’effectuer un CREATE dans les scénarios de test et de développement.

La syntaxe pour supprimer une table est la suivante :

Par exemple, supposons que vous souhaitiez supprimer le contenu de la table COUNTRY si une table existe dans le jeu de données portant le même nom. Dans ce cas, le code du dernier exemple devient

In [ ]:
DROP TABLE COUNTRY;
CREATE TABLE COUNTRY (
   ID int NOT NULL,
   CCODE char(2),
   Name varchar(60)
   PRIMARY KEY (ID)
);

AVERTISSEMENT : Avant de déposer une table, assurez-vous qu’elle ne contient pas de données importantes qui ne peuvent pas être récupérées facilement.

Notez que si la table n’existe pas et que vous essayez de la supprimer, vous verrez une erreur telle que XXX.YYY est un nom indéfini. Vous pouvez ignorer cette erreur si l’instruction CREATE suivante est exécutée avec succès.

Dans un atelier pratique plus loin dans ce module, vous vous exercerez à créer des tables et d’autres instructions SQL.

Dans ce laboratoire, vous apprendrez à créer des tables et à charger des données à l'aide de l'interface graphique phpMyAdmin dans le service de base de données MySQL.

Dans cet atelier, vous apprendrez à créer des tables et à charger des données à l’aide de l’interface utilisateur graphique (GUI) phpMyAdmin dans le service de base de données MySQL.

#  Logiciels utilisés dans cet atelier
Dans cet atelier, vous allez utiliser MySQL. MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer efficacement des données.

Pour terminer cet atelier. vous utiliserez le service de base de données relationnelle MySQL disponible dans le cadre de l’IDE cloud IBM Skills Network Labs (SN Labs). SN Labs est un environnement de laboratoire virtuel utilisé dans ce cours.

# Hands-on Lab: CREATE, ALTER, TRUNCATE, DROP

# Objectifs
Après avoir terminé cet atelier, vous serez en mesure d’utiliser phpMyAdmin avec MySQL pour :

- Créez une base de données.
- Créez une nouvelle table dans une base de données.
- Ajoutez, supprimez ou modifiez des colonnes dans une table existante.
- Supprimez toutes les lignes d’un tableau existant sans supprimer le tableau lui-même.
- Supprimer une table existante dans une base de données.

Dans cet atelier, vous apprendrez à créer des tables et à charger des données à l’aide de l’interface utilisateur graphique (GUI) phpMyAdmin dans le service de base de données MySQL.

Logiciels utilisés dans cet atelier
Dans cet atelier, vous allez utiliser MySQL. MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer efficacement des données.

# Objectifs
Après avoir terminé cet atelier, vous serez en mesure d’utiliser phpMyAdmin avec MySQL pour :

- Créez une base de données.
- Créez une nouvelle table dans une base de données.
- Ajoutez, supprimez ou modifiez des colonnes dans une table existante.
- Supprimez toutes les lignes d’un tableau existant sans supprimer le tableau lui-même.
- Supprimer une table existante dans une base de données.

# Tâche 1 : Créer une base de données
Suivez les étapes ci-dessous pour créer une nouvelle base de données dans l’interface graphique phpMyAdmin de MySQL.

1. #### Cliquez sur Boîte à outils du réseau de compétences. Dans la section Base de données, cliquez sur MySQL.

Pour démarrer MySQL, cliquez sur Démarrer.

2. ##### Une fois que MySQL a démarré, cliquez sur le bouton phpMyAdmin pour ouvrir phpMyAdmin dans la même fenêtre.

3. ##### You will see the phpMyAdmin GUI tool.

4. ##### In the tree view, click New to create a new empty database. Then, enter Mysql_Learners as the name of the database, select utf8_general_ci from the dropdown, and click Create.


UTF-8 is the most commonly used character encoding for content or data.

# Task 2a : CREATE statement

Now, you will use the CREATE statement to create two new tables.
Follow the instructions to complete this task.

1. ##### You need to create two tables, PETSALE and PET. To create the two tables, copy the code below and paste it into the text area of the SQL tab. Click Go.

In [ ]:
CREATE TABLE PETSALE (
        ID INTEGER NOT NULL,
        PET CHAR(20),
        SALEPRICE DECIMAL(6,2),
        PROFIT DECIMAL(6,2),
        SALEDATE DATE
        );

CREATE TABLE PET (
        ID INTEGER NOT NULL,
        ANIMAL VARCHAR(20),
        QUANTITY INTEGER
        );

Vérifiez que les deux tables sont maintenant disponibles dans l’arborescence de gauche, comme indiqué dans l’image ci-dessous.

# Task 2b: INSERT statement
Now, insert some records into the two newly created tables. You can also add SELECT statements to print the contents of the tables once they are loaded with data.
Copy the code below and paste it into the text area of the SQL tab. Then, click Go.







Tâche 2b : instruction INSERT
Maintenant, insérez des enregistrements dans les deux tables nouvellement créées. Vous pouvez également ajouter des instructions SELECT pour imprimer le contenu des tables une fois qu’elles sont chargées avec des données.

Copiez le code ci-dessous et collez-le dans la zone de texte de l’onglet SQL. Ensuite, cliquez sur OK.

In [ ]:
INSERT INTO PETSALE VALUES
        (1,'Cat',450.09,100.47,'2018-05-29'),
        (2,'Dog',666.66,150.76,'2018-06-01'),
        (3,'Parrot',50.00,8.9,'2018-06-04'),
        (4,'Hamster',60.60,12,'2018-06-11'),
        (5,'Goldfish',48.48,3.5,'2018-06-14');
        
INSERT INTO PET VALUES
        (1,'Cat',3),
        (2,'Dog',4),
        (3,'Hamster',2);

SELECT * FROM PETSALE;
SELECT * FROM PET;

# Task 3: ALTER statement
In this exercise, you will use the #ALTER# statement to add, delete, or modify columns in the existing tables.

1. #### Adding a column(ajouter une colonne)
Add a new column named QUANTITY to the PETSALE table and display the altered table.
For this, copy the code below and paste it into the text area of the SQL page. Click Go..Task 3: ALTER statement
In this exercise, you will use the ALTER statement to add, delete, or modify columns in the existing tables.



Ajoutez une nouvelle colonne nommée QUANTITY à la table PETSALE et affichez la table modifiée.
Pour cela, copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
ALTER TABLE PETSALE
ADD COLUMN QUANTITY INTEGER;

SELECT * FROM PETSALE;

Now update the newly added QUANTITY column of the PETSALE table with some values and show all the table records. Copy the code below and paste it into text area of the SQL page. Click Go.

Maintenant, mettez à jour la colonne QUANTITY nouvellement ajoutée de la table PETSALE avec quelques valeurs et affichez tous les enregistrements de la table. Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1;
UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2;
UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3;
UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4;
UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5;

SELECT * FROM PETSALE;

2. #### Deleting a column

Delete the PROFIT column from the PETSALE table and show the altered table. Copy the code below and paste it into the text area of the SQL page. Click Go.

Supprimez la colonne PROFIT de la table PETSALE et affichez la table modifiée. Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
ALTER TABLE PETSALE
DROP COLUMN PROFIT;
SELECT * FROM PETSALE;

3. #### Modify a column
Change the data type to VARCHAR(20) type of the column PET of the table PETSALE and show the altered table.
Copy the code below and paste it into the text area of the SQL page. Click Go.

3. #### Modifier une colonne
Remplacez le type de données par le type VARCHAR(20) de la colonne PET de la table PETSALE et affichez la table modifiée. Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
ALTER TABLE PETSALE
MODIFY PET VARCHAR(20);
SELECT * FROM PETSALE;

Vous pouvez cliquer sur le nom de la table PETSALE dans l’arborescence à gauche puis cliquer sur l’onglet Structure dans l’interface. Vous pouvez ensuite voir que la structure du tableau affiche le type de données de colonne modifié, comme illustré dans l’image ci-dessous.

4.  #### Rename a Column
Rename the column PET to ANIMAL of the PETSALE table and show the altered table. Copy the code below and paste it into the text area of the SQL page. Click Go.

In [ ]:
ALTER TABLE `PETSALE` CHANGE `PET` `ANIMAL` VARCHAR(20);

SELECT * FROM PETSALE;

# Task 4: TRUNCATE statement
In this exercise, you will use the TRUNCATE statement to remove all rows from an existing table without deleting it.

Let's remove all rows from the PET table and show the empty table. Copy the code below and paste it into the text area of the SQL page. Click Go.

TRUNCATE TABLE PET ;

SELECT * FROM PET;

In [ ]:
Task 5: DROP statement
Finally, you will use the DROP statement to delete an existing table.
Let's delete the PET table and verify if the table still exists or not 
(the SELECT statement should give an error if a table doesn't exist).
 Copy the code below and paste it into the text area of the SQL page. Click Go.

# Tâche 5 : instruction DROP
Enfin, vous allez utiliser l’instruction DROP pour supprimer une table existante.
Supprimons la table PET et vérifions si la table existe toujours ou non (l’instruction SELECT devrait donner une erreur si une table n’existe pas). Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
DROP TABLE PET;

SELECT * FROM PET;

# Problèmes d’entraînement
Essayez les problèmes suivants pour une meilleure pratique des concepts appris dans cet atelier.

Créez une table dans la base de données nommée Jouets avec des attributs tels que ID (entier), Variété (chaîne de longueur variable) et Quantité (entier). Assurez-vous que l’ID n’est pas Null.


Try the following problems for an enhanced practice of the concepts learned in this lab.

Create a new table in the database named Toys with attributes as ID (integer), Variety (variable length string), and Quantity (integer). Make sure the ID is not Null.

In [ ]:
CREATE TABLE Toys (
        ID INTEGER NOT NULL,
        Variety VARCHAR(20),
        Quantity INTEGER
        );

2. #### Add the below-mentioned entries to the table using the INSERT statement.

Ajoutez les entrées mentionnées ci-dessous à la table à l’aide de l’instruction INSERT.

ID	Variety	        Quantity
1	Chew toy	      20
2	Balls	          50
3	Bowls	          30
4	Foldable bed	  40

In [ ]:
INSERT INTO Toys VALUES
        (1, 'Chew toy', 20),
        (2, 'Balls', 50),
        (3, 'Bowls', 30),
        (4, 'Foldable bed', 40);

3. #### ALTER the length of 'Variety' in the table to 30 characters.

MODIFIEZ la longueur de 'Variety' dans le tableau à 30 caractères

ALTER TABLE Toys
MODIFY Variety VARCHAR(30);

4. #### TRUNCATE the table 'Toys'

In [ ]:
TRUNCATE TABLE Toys;

5. #### DROP the table 'Toys'

In [ ]:
DROP TABLE Toys;

# Conclusion
Félicitations pour avoir terminé ce laboratoire avec succès.

À présent, vous avez appris à :

- Créez une base de données dans l’interface graphique de phpMyAdmin sur MySQL.

- Utilisez l’instruction CREATE pour créer de nouvelles tables dans la base de données.

- Utilisez l’instruction INSERT pour ajouter des enregistrements aux tables.

- Utilisez l’instruction ALTER pour ajouter, supprimer, renommer ou modifier les colonnes d’une table existante.

- Utilisez l’instruction TRUNCATE pour supprimer le contenu d’une table existante (mais pas la table).

- Utiliser l’instruction DROP pour supprimer une table entière

# SQL Scripts - Uses and Applications
SQL Scripts
SQL scripts are a series of commands or a program that will be executed on an SQL server.

SQL scripts are useful for making complex database changes and can be used to create, modify, or delete database objects such as tables, views, stored procedures, and functions.

Applications of SQL Scripts
Here are some of the things that you can do with SQL scripts:

- Create tables
You can use SQL scripts to create new tables in your database. This is useful when you need to add new functionality to your application or when you want to store new types of data.

- Drop tables
SQL scripts often have commands to Drop tables from databases. This is especially important before Create table commands to make sure that a table with the same name doesnt exist in the database already.

- Insert data
SQL scripts can also be used to insert data into your tables. This is useful when you need to populate your database with test data or when you want to import data from an external source.

- Update data

You can use SQL scripts to update existing data in your tables. This is useful when you need to correct errors or update records based on changing business requirements.

- Delete data

SQL scripts can also be used to delete data from your tables. This is useful when you need to remove old or obsolete records from your database.

- Create views

Views are virtual tables that allow you to query data from multiple tables as if they were a single table. You can use SQL scripts to create views that simplify complex queries and make it easier to work with your data.

- Create stored procedures

Stored procedures are precompiled SQL statements that can be executed on demand. You can use SQL scripts to create stored procedures that encapsulate complex business logic and make it easier to manage your database.

- Create triggers

Triggers are special types of stored procedures that are automatically executed in response to certain events, such as an insert, update, or delete operation. You can use SQL scripts to create triggers that enforce business rules and maintain data integrity.#

# Exemple : Création de tables
Exécutons un script contenant les commandes CREATE TABLE pour toutes les tables d’un jeu de données donné, plutôt que de créer chaque table manuellement en tapant les commandes DDL dans l’éditeur SQL.

Notez les points suivants à propos de ces scripts.

1. ### Les scripts SQL sont essentiellement un ensemble de commandes SQL compilées dans un seul fichier.
2. ### Chaque commande doit être terminée par un délimiteur ou une terminaison. Le plus souvent, le délimiteur par défaut est un point-virgule ;.
3. ### Il est conseillé de conserver l’extension du fichier .sql
4. ### Lors de l’importation de ce fichier dans l’interface phpMyAdmin, les commandes du fichier sont exécutées séquentiellement.

Considérez le script suivant

In [ ]:
DROP TABLE IF EXISTS PATIENTS;
DROP TABLE IF EXISTS MEDICAL_HISTORY;
DROP TABLE IF EXISTS MEDICAL_PROCEDURES;
DROP TABLE IF EXISTS MEDICAL_DEPARTMENTS;
DROP TABLE IF EXISTS MEDICAL_LOCATIONS;
CREATE TABLE PATIENTS (
  PATIENT_ID CHAR(9) NOT NULL,
  FIRST_NAME VARCHAR(15) NOT NULL,
  LAST_NAME VARCHAR(15) NOT NULL,
  SSN CHAR(9),
  BIRTH_DATE DATE,
  SEX CHAR,
  ADDRESS VARCHAR(30),
  DEPT_ID CHAR(9) NOT NULL,
  PRIMARY KEY (PATIENT_ID)
);
CREATE TABLE MEDICAL_HISTORY (
  MEDICAL_HISTORY_ID CHAR(9) NOT NULL,
  PATIENT_ID CHAR(9) NOT NULL,
  DIAGNOSIS_DATE DATE,
  DIAGNOSIS_CODE VARCHAR(10),
  MEDICAL_CONDITION VARCHAR(100),
  DEPT_ID CHAR(9),
  PRIMARY KEY (MEDICAL_HISTORY_ID)
);
CREATE TABLE MEDICAL_PROCEDURES (
  PROCEDURE_ID CHAR(9) NOT NULL,
  PROCEDURE_NAME VARCHAR(30),
  PROCEDURE_DATE DATE,
  PATIENT_ID CHAR(9) NOT NULL,
  DEPT_ID CHAR(9),
  PRIMARY KEY (PROCEDURE_ID)
);
CREATE TABLE MEDICAL_DEPARTMENTS (
  DEPT_ID CHAR(9) NOT NULL,
  DEPT_NAME VARCHAR(15),
  MANAGER_ID CHAR(9),
  LOCATION_ID CHAR(9),
  PRIMARY KEY (DEPT_ID)
);
CREATE TABLE MEDICAL_LOCATIONS (
  LOCATION_ID CHAR(9) NOT NULL,
  DEPT_ID CHAR(9) NOT NULL,
  LOCATION_NAME VARCHAR(50),
  PRIMARY KEY (LOCATION_ID, DEPT_ID)
);

# Laboratoire pratique : Créer et charger des tables à l'aide de scripts SQL

SQL Scripts
Les scripts SQL sont une série de commandes ou un programme qui sera exécuté sur un serveur SQL.

Les scripts SQL sont utiles pour apporter des modifications complexes à une base de données et peuvent être utilisés pour créer, modifier ou supprimer des objets de base de données tels que des tables, des vues, des procédures stockées et des fonctions.

Dans cet atelier, vous apprendrez à créer des tables et à charger des données à l’aide de l’interface utilisateur graphique (GUI) phpMyAdmin dans le service de base de données MySQL.

# Objectifs
Après avoir terminé cet atelier, vous serez en mesure d’utiliser phpMyAdmin avec MySQL pour :

- Créer une base de données sur MySQL
- Créer des tables à l’aide de scripts SQL
- Charger des données dans des tableaux directement à partir de fichiers CSV
MySQL (en anglais)
Dans cet atelier, vous allez utiliser MySQL. MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer efficacement des données.

Pour suivre cet atelier, vous utiliserez le service de base de données relationnelle MySQL disponible dans le cadre de l’IDE cloud IBM Skills Network Labs (SN Labs), l’environnement de laboratoire virtuel utilisé dans ce cours.

# Base de données utilisée dans cet atelier

La base de données utilisée dans cet atelier est interne. Vous travaillerez sur un exemple de base de données sur les maladies cardio-vasculaires (MCV). Ce schéma de base de données CVD se compose de cinq tables : PATIENTS, MEDICAL_HISTORY, MEDICAL_PROCEDURES, MEDICAL_DEPARTMENTS et MEDICAL_LOCATIONS.

Chaque table comporte quelques lignes d’exemples de données. Le diagramme suivant montre le contenu de la base de données CVD :

Votre tâche consiste à créer cette base de données dans MySQL. Cette tâche est divisée en trois parties.

- Tâche 1 : Créer la base de données sur MySQL à l’aide de l’interface graphique phpMyAdmin.

- Tâche 2 : Créer toutes les tables dans MySQL à l’aide d’un script SQL.

- Tâche 3 : Remplissez chaque tableau avec les données des fichiers CSV respectifs.

# Task 1 : Create the database
Follow the instructions shared below to create the database CVD in MySQL.

# Launch phpMyAdmin
1. ### Click Skills Network Toolbox. In the Database section, click MySQL.
To start the MySQL, click Start.

2. #### Une fois que MySQL a démarré, cliquez sur le bouton phpMyAdmin pour ouvrir phpMyAdmin dans la même fenêtre.

3. #### Vous verrez l’outil phpMyAdmin GUI.

4. #### In the tree view, click New to create a new empty database. Then, enter CVD as the name of the database and click Create.

The encoding will be left as utf8mb4_0900_ai_ci. UTF-8 is the most commonly used character encoding for content or data.


Dans l’arborescence, cliquez sur Nouveau pour créer une base de données vide. Ensuite, entrez CVD comme nom de la base de données et cliquez sur Créer.

L’encodage sera laissé tel quel utf8mb4_0900_ai_ci. UTF-8 est l’encodage de caractères le plus couramment utilisé pour le contenu ou les données.

# Tâche 2 : Créer des tables à l’aide d’un script SQL 
on a fait la pratique en ligne, mais j'ai le pdf.




Dans cet exercice, vous allez apprendre à exécuter un script contenant les commandes CREATE TABLE pour toutes les tables plutôt que de créer chaque table manuellement en tapant les commandes DDL dans l’éditeur SQL.

Remarque : Les scripts SQL sont essentiellement un ensemble de commandes SQL compilées dans un seul fichier. Chaque commande doit se terminer par un point-virgule ;. L’extension du fichier doit être conservée telle qu'.sql. Lors de l’importation de ce fichier dans l’interface phpMyAdmin, les commandes du fichier sont exécutées séquentiellement.

Suivez les étapes ci-dessous.

Téléchargez le fichier de script sur votre ordinateur local :

CVD_Database_Create_Tables_Script.sql

Sélectionnez la base de données CVD. Cliquez ensuite sur l’onglet Importer.

Cliquez sur Choisir un fichier, recherchez le fichier et téléchargez-le.

Une fois téléchargé, faites défiler vers le bas et cliquez sur OK.

- Le script est ensuite exécuté avec succès et l’interface affiche les entrées dans l’image ci-dessous.

- Cliquez sur l’une des tables pour afficher sa définition de table (sa liste de colonnes, de types de données, etc.). L’image ci-dessous montre la structure du tableau PATIENTS.

# Tâche 3 : Charger les données dans des tables
Vous devez maintenant charger les données dans les tables. Vous pouvez insérer manuellement chaque ligne dans le tableau une par une, mais c’est très inefficace. Au lieu de cela, MySQL (et presque toutes les autres bases de données) vous permet de charger des données à partir de fichiers CSV directement dans les tables.

Les étapes ci-dessous expliquent le chargement des données dans les tables que vous avez créées dans la tâche 2.

Les étapes de chargement d’un fichier CSV dans une table sont les suivantes.

- Sélectionnez la table.

- liquez sur l’onglet Importer.

- Naviguez jusqu’à l’emplacement du fichier CSV et cliquez sur « OK » pour charger le fichier CSV.

- Les images ci-dessous expliquent comment charger les données CSV dans la table PATIENTS.

Une fois la table chargée, vous recevrez un message indiquant que les enregistrements ont été insérés avec succès.

De plus, vous pouvez cliquer sur parcourir et afficher les données de la table.

# Practice exercise
Repeat the same process for all of the other tables.

# Conclusion
Congratulations on completing this lab.

In this lab, you learned how to :

- Use phpMyAdmin GUI to operate on MySQL servers

- Create a new database in phpMyAdmin.

- Create the tables for the dataset using SQL scripts

- Load data from a CSV file directly to a table in MySQL.

# Résumé : Concepts et tables des bases de données relationnellesStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. À ce stade du cours, vous savez ce qui suit :

- Une base de données est un référentiel de données qui permet d'ajouter, de modifier et d'interroger les données.

- SQL est un langage utilisé pour interroger ou récupérer des données dans une base de données relationnelle.

- Le modèle relationnel est le modèle de données le plus utilisé pour les bases de données car il permet l'indépendance des données.

- La clé primaire d'une table relationnelle identifie de manière unique chaque tuple ou ligne, ce qui évite la duplication des données et permet de définir les relations entre les tables.

- Les instructions SQL se répartissent en deux catégories différentes : Les instructions du langage de définition des données (DDL) et les instructions du langage de manipulation des données (DML).

# Comment créer une instance de base de données sur le cloud ?

(Musique) Bonjour et bienvenue. Cette vidéo abordera les concepts clés relatifs aux bases de données dans le cloud. Pour apprendre le SQL, vous devez d'abord disposer d'une base de données pour pratiquer vos requêtes SQL. Pour ce faire, vous pouvez facilement créer une instance de base de données dans le Cloud et l'utiliser pour exécuter vos requêtes SQL. Après avoir terminé cette leçon, vous serez en mesure de comprendre les concepts de base liés aux bases de données cloud, de répertorier quelques bases de données cloud, de décrire des instances de service de base de données et de montrer comment créer une instance de service sur un IBM Db2 on Cloud. Une base de données cloud est un service de base de données créé et accessible via une plateforme cloud. Elle remplit bon nombre des mêmes fonctions que les bases de données traditionnelles, avec la flexibilité supplémentaire du cloud computing. Parmi les avantages de l'utilisation des bases de données cloud, citons la facilité d'utilisation, les utilisateurs peuvent accéder aux bases de données cloud de pratiquement n'importe où à l'aide de l'API ou de l'interface Web d'un fournisseur, ou de vos propres applications, que ce soit sur le cloud ou à distance. Scalabilité. Les bases de données cloud peuvent étendre et réduire leurs capacités de stockage et de calcul pendant l'exécution afin de répondre à l'évolution des besoins et des demandes d'utilisation, de sorte que les entreprises ne paient que pour ce qu'elles utilisent réellement. Reprise après sinistre. En cas de catastrophe naturelle, de panne d' équipement ou de panne de courant, les données sont sécurisées grâce à des sauvegardes sur des serveurs distants sur le cloud dans des régions géographiquement réparties. Quelques exemples de bases de données relationnelles sur le cloud incluent IBM Db2 on Cloud, les bases de données pour PostgreSQL sur IBM Cloud, Oracle Database Cloud Service, Microsoft Azure SQL Database et Amazon Relational Database Services. Ces bases de données cloud peuvent s'exécuter dans le cloud soit en tant que machine virtuelle, que vous pouvez gérer, soit en tant que service géré, selon le fournisseur. Les services de base de données peuvent être uniques ou mutualisés selon le plan de service. Pour exécuter une base de données dans le Cloud, vous devez d'abord configurer une instance du service de base de données sur la plateforme Cloud de votre choix.
Lisez la vidéo à partir de :2:31 et suivez la transcription2:31
Une instance de base de données en tant que service ou DBaaS permet aux utilisateurs d' accéder aux ressources de base de données dans le cloud sans avoir à configurer le matériel sous-jacent, à installer le logiciel de base de données et à administrer la base de données. L'instance du service de base de données conservera vos données dans des tables associées. Une fois vos données chargées dans l'instance de base de données, vous pouvez vous y connecter à l'aide d'une interface Web ou d'API dans vos applications. Une fois connectée, votre application peut envoyer des requêtes SQL à l'instance de base de données. L'instance de base de données transforme ensuite les instructions SQL en opérations sur les données et les objets de la base de données. Toutes les données récupérées sont renvoyées à l'application sous forme de jeu de résultats. Voyons maintenant comment une instance de base de données est créée pour Db2 on Cloud. IBM Db2 on Cloud est une base de données SQL mise à votre disposition dans le cloud. Vous pouvez utiliser Db2 on Cloud comme vous le feriez avec n'importe quel logiciel de base de données, mais sans les frais supplémentaires liés à la configuration matérielle ou à l'installation et à la maintenance de logiciels. Voyons maintenant comment configurer une instance de service de Bb2. Accédez au catalogue IBM Cloud et sélectionnez le service Db2. Notez qu'il existe plusieurs variantes du service Db2, notamment Db2 Hosted et Db2 Warehouse. Pour nos besoins, nous choisirons le service Db2 qui est fourni avec un plan allégé gratuit. Sélectionnez le forfait allégé. Le cas échéant, modifiez les valeurs par défaut. Vous pouvez saisir le nom d'une instance de service, choisir la région dans laquelle déployer, ainsi qu'une organisation et un espace pour le service, puis cliquer sur « Créer ». Vous pouvez consulter le service IBM Db2 que vous avez créé en sélectionnant des services dans votre tableau de bord IBM Cloud. À partir de ce tableau de bord, vous pouvez gérer votre instance de base de données. Par exemple, vous pouvez cliquer sur le bouton « Ouvrir la console » pour lancer la console Web de votre instance de base de données. La console Web vous permet de créer des tables, de charger des données, d'explorer les données de vos tables et d'émettre des requêtes SQL. Pour accéder à votre instance de base de données depuis vos applications, vous aurez besoin des informations d'identification du service. Pour la première fois, vous devrez créer un ensemble de nouvelles informations d'identification. Vous pouvez également choisir de créer plusieurs ensembles d' informations d'identification pour différents utilisateurs et applications. Une fois qu'un ensemble d'informations d'identification de service est créé, vous pouvez l'afficher sous forme d'extrait adjacent. Les informations d'identification incluent les informations nécessaires pour établir une connexion à la base de données et incluent les éléments suivants : un nom de base de données et un numéro de port, un nom d'hôte, qui est le nom du serveur sur le Cloud sur lequel réside votre instance de base de données, un nom d'utilisateur, qui est l' ID utilisateur que vous utiliserez pour vous connecter avec le mot de passe. Notez que votre nom d'utilisateur est également le nom du schéma dans lequel vos tables seront créées par défaut. Maintenant que vous savez comment créer une instance de base de données sur le Cloud, l'étape suivante consiste à en créer une. Merci d'avoir regardé cette vidéo. (Musique)

# Utilisation de motifs et de plages de chaînes de caractères

Bonjour et bienvenue à la récupération de données à l'aide d'instructions SELECT à base de chaînes de caractères. Dans cette vidéo, nous allons découvrir quelques techniques avancées de récupération de données à partir d'une table de base de données relationnelle. À la fin de cette leçon, vous serez en mesure de décrire comment simplifier une instruction SELECT en utilisant des chaînes de caractères, des plages ou des ensembles de valeurs. L'objectif principal d'un système de gestion de base de données n'est pas seulement de stocker les données, mais aussi de faciliter la récupération de ces données. Dans sa forme la plus simple, une instruction SELECT est select star from table name. Sur la base d'un modèle simplifié de base de données de bibliothèque et de la table Book, SELECT star from Book donne un ensemble de résultats de quatre lignes. Toutes les lignes de données de toutes les colonnes de la table Book sont affichées ou vous pouvez extraire un sous-ensemble de colonnes, par exemple, seulement deux colonnes de la table Book telles que Book_ID et Title. Ou vous pouvez restreindre l'ensemble de résultats en utilisant la clause WHERE. Par exemple, vous pouvez sélectionner le titre du livre dont l'identifiant Book_ID est B1. Mais que se passe-t-il si nous ne savons pas exactement quelle valeur spécifier dans la clause WHERE ? La clause WHERE nécessite toujours un prédicat, qui est une condition évaluée comme vraie, fausse ou inconnue. Mais que se passe-t-il si nous ne savons pas exactement quelle est la valeur du prédicat ? Par exemple, que se passe-t-il si nous ne nous souvenons pas du nom de l'auteur, , mais que nous nous souvenons que son prénom commence par R ? Dans une base de données relationnelle, nous pouvons utiliser des modèles de chaînes pour rechercher les lignes de données qui correspondent à cette condition. Voyons quelques exemples d'utilisation de modèles de chaînes. Si nous ne nous souvenons pas du nom de l'auteur, mais que nous nous souvenons que son nom commence par R, nous utilisons la clause WHERE avec le prédicat like. Le prédicat like est utilisé dans une clause WHERE pour rechercher un motif dans une colonne. Le signe pour cent est utilisé pour définir les lettres manquantes. Il peut être placé avant le motif, après le motif, ou à la fois avant et après le motif. Dans cet exemple, nous utilisons le signe pour cent après le motif, qui est la lettre R. Le signe pour cent est appelé caractère de remplacement. Un caractère générique est utilisé pour remplacer d'autres caractères. Ainsi, si nous ne nous souvenons pas du nom de l'auteur, , mais que nous nous souvenons que son prénom commence par la lettre R, , nous ajoutons le prédicat like à la clause WHERE. Par exemple, select first name from author, where firstname like 'R%'. Cela renverra toutes les lignes de la table auteur dont le prénom de l'auteur commence par la lettre R. Et voici le jeu de résultats. Deux lignes sont renvoyées pour les auteurs Raul et Rav. Et si nous voulions récupérer la liste des livres dont le nombre de pages est supérieur à 290, mais inférieur à 300. Nous pourrions écrire l'instruction SELECT comme suit, en spécifiant la clause WHERE comme suit : where pages is greater than or equal to 290, and pages is less than or equal to 300. Mais dans une base de données relationnelle, nous pouvons utiliser une plage de nombres pour spécifier la même condition. Au lieu d'utiliser les opérateurs de comparaison supérieur ou égal à, nous utilisons l'opérateur de comparaison "entre et". "Entre et" compare deux valeurs. Les valeurs de la plage sont inclusives. Dans ce cas, nous réécrivons la requête pour spécifier la clause WHERE comme where pages between 290 and 300. L'ensemble de résultats est le même, mais l'instruction SELECT est plus facile et plus rapide à écrire. Dans certains cas, il y a des valeurs de données qui ne peuvent pas être regroupées sous des plages. Par exemple, si nous voulons savoir de quels pays viennent les auteurs. Si nous voulons extraire les auteurs d'Australie ou du Brésil, nous pouvons écrire l'instruction SELECT avec la clause WHERE répétant les deux valeurs de pays. Mais qu'en est-il si nous voulons récupérer les auteurs du Canada, de l'Inde et de la Chine ? La clause WHERE deviendrait très longue en répétant les conditions de pays requises. Au lieu de cela, nous pouvons utiliser l'opérateur IN. L'opérateur IN nous permet de spécifier un ensemble de valeurs dans une clause WHERE. Cet opérateur prend une liste d'expressions à comparer. Dans ce cas, il s'agit des pays Australie ou Brésil. Vous pouvez maintenant décrire comment simplifier une instruction SELECT en utilisant des chaînes de caractères, des plages ou des ensembles de valeurs. Merci d'avoir regardé cette vidéo. (Musique)

 # SEMAINE 3

#  Tri des ensembles de résultats

Une bonne connaissance de SQL (ou Structured Query Language) est indispensable pour les professionnels des données, tels que les scientifiques, les analystes et les ingénieurs des données. La plupart des données mondiales résident dans des bases de données. SQL est un langage puissant utilisé pour communiquer avec les bases de données et en extraire des données. Dans ce cours, vous apprendrez SQL de fond en comble, depuis les bases des instructions Select jusqu'aux concepts avancés tels que les JOINs. Vous allez : -écrire des instructions SQL fondamentales telles que : SELECT, INSERT, UPDATE et DELETE -filtrer les ensembles de résultats, utiliser les clauses WHERE, COUNT, DISTINCT et LIMIT -différencier entre DML et DDL -CREATE, ALTER, DROP et charger des tables -utiliser des modèles de chaînes de caractères et des plages ; Accéder aux bases de données en tant que data scientist en utilisant les notebooks Jupyter avec SQL et Python - Travailler avec des concepts avancés comme les procédures stockées, les vues, les transactions ACID, les JOINs internes et externes à travers des laboratoires et des projets pratiques Vous vous entraînerez à construire des requêtes SQL, à travailler avec de vraies bases de données sur le Cloud, et à utiliser de vrais outils de data science. Dans le projet final, vous analyserez plusieurs ensembles de données du monde réel pour démontrer vos compétences.

Bonjour et bienvenue au tri des ensembles de résultats de l'instruction SELECT. Dans cette vidéo, nous allons apprendre quelques techniques avancées pour extraire des données d'une table de base de données relationnelle et trier la façon dont l'ensemble de résultats s'affiche. À la fin de cette leçon, vous serez en mesure de décrire comment trier l'ensemble des résultats par ordre croissant ou décroissant et d'expliquer comment indiquer la colonne à utiliser pour l'ordre de tri. L'objectif principal d'un système de gestion de base de données n'est pas seulement de stocker les données, mais aussi de faciliter la récupération des données. Dans sa forme la plus simple, une instruction select est select * from nom de la table. Sur la base de notre modèle simplifié de base de données de bibliothèque, dans le tableau book, select * from book donne un ensemble de résultats de quatre lignes. Toutes les lignes de données pour toutes les colonnes du tableau book sont affichées. Nous pouvons choisir de ne lister que les titres des livres, comme indiqué dans cet exemple, select title from book. Cependant, l'ordre ne semble pas être le bon. L'affichage de l'ensemble des résultats par ordre alphabétique serait plus pratique. Pour ce faire, nous utilisons la clause "order by". Pour afficher l'ensemble des résultats par ordre alphabétique, nous ajoutons la clause order by à l'instruction select. La clause order by est utilisée dans une requête pour trier l'ensemble des résultats en fonction d'une colonne spécifiée. Dans cet exemple, nous avons utilisé order by sur la colonne title pour trier l'ensemble de résultats. Par défaut, l'ensemble de résultats est trié par ordre croissant. Dans cet exemple, l'ensemble de résultats est trié par ordre alphabétique sur le titre du livre. Pour trier par ordre décroissant, utilisez le mot-clé " desc." L'ensemble des résultats est maintenant trié en fonction de la colonne spécifiée, qui est le titre, et est trié par ordre décroissant. Remarquez l'ordre des trois premières lignes. Les trois premiers mots du titre sont les mêmes, le tri commence donc à partir du point où les caractères diffèrent. Une autre façon de spécifier la colonne de tri est d'indiquer le numéro de séquence de la colonne. Dans cet exemple, select title, pages from book order by two, indique le numéro d'ordre de la colonne dans la requête pour l'ordre de tri. Au lieu de spécifier le nom de la colonne pages, le nombre deux est utilisé. Dans l'instruction select, la deuxième colonne spécifiée dans la liste des colonnes est pages, l'ordre de tri est donc basé sur les valeurs de la colonne pages. Dans ce cas, la colonne pages indique le nombre de pages du livre. Comme vous pouvez le voir, l'ensemble de résultats est classé par ordre croissant de nombre de pages. Vous pouvez maintenant décrire comment trier l'ensemble de résultats par ordre croissant ou décroissant, et expliquer comment indiquer la colonne à utiliser pour l'ordre de tri. Merci d'avoir regardé cette vidéo.

Regroupement d'ensembles de résultats

# Hands-on Lab: String Patterns, Sorting and Grouping in MySQL

Pour effectuer cet atelier, vous utiliserez le service de base de données relationnelle MySQL disponible dans le cadre de l’IDE cloud IBM Skills Network Labs (SN Labs). SN Labs est un environnement de laboratoire virtuel utilisé dans ce cours.

# Base de données utilisée dans cet atelier
La base de données utilisée dans cet atelier est une base de données interne. Vous travaillerez sur un exemple de base de données RH. Ce schéma de base de données RH se compose de 5 tables appelées EMPLOYÉS, JOB_HISTORY, EMPLOIS, DÉPARTEMENTS et EMPLACEMENTS. Chaque table comporte quelques lignes d’exemples de données. Le diagramme suivant montre les tables de la base de données RH :

# Charger la base de données
En utilisant les compétences acquises dans les modules précédents, vous devez d’abord créer la base de données en MySQL. Suivez les étapes ci-dessous :

1. ###  Ouvrez l’interface phpMyAdmin à partir de la boîte à outils Skills Network dans l’IDE Cloud.

2. ###  Créez une base de données vierge nommée « RH ». Utilisez le script partagé dans le lien ci-dessous pour créer les tables requises.
Script_Create_Tables.sql

3. ###  Téléchargez les fichiers contenus dans les liens ci-dessous sur votre ordinateur local (si ce n’est pas déjà fait dans les ateliers précédents).
Departments.csv
Jobs.csv
JobsHistory.csv
Locations.csv
Employees.csv

J'ai ca en pdf


4. ### Use each of these files to the iterface as data for respective tables in the ‘HR’ database.

Previous

# String Patterns
You can use string patterns to filter the response of a query. Let's look at the following example:

Say you need to retrieve the first names F_NAME and last names L_NAME of all employees who live in Elgin, IL. You can use the LIKE operator to retrieve strings that contain the said text. The code will look as shown below.









Modèles de cordes




Vous pouvez utiliser des modèles de chaîne pour filtrer la réponse d’une requête. Prenons l’exemple suivant :

Supposons que vous ayez besoin de récupérer les prénoms F_NAME et noms de famille L_NAME de tous les employés qui vivent à Elgin, IL. Vous pouvez utiliser l’opérateur LIKE pour récupérer les chaînes qui contiennent ledit texte. Le code ressemblera à ce qui est indiqué ci-dessous.

In [ ]:
SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE ADDRESS LIKE '%Elgin,IL%';

Supposons maintenant que vous souhaitiez identifier les employés nés dans les années 70. La requête ci-dessus peut être modifiée comme suit :

In [ ]:
SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE B_DATE LIKE '197%';

Notez que dans le premier exemple, le signe % est utilisé à la fois avant et après le texte requis. Il s’agit d’indiquer que la chaîne d’adresse peut avoir plus de caractères, à la fois avant et après, le texte requis.

Dans le deuxième exemple, puisque la date de naissance dans les registres Eployees commence par l’année de naissance, le signe % est appliqué après 197%, ce qui indique que l’année de naissance peut être comprise entre 1970 et 1979. De plus, le signe % permet également n’importe quelle date possible au cours des années sélectionnées.

Prenons un exemple plus précis. Récupérons tous les dossiers d’employés du département 5 où le salaire est compris entre 60000 et 70000. La requête qui sera utilisée est la suivante :

In [ ]:
SELECT *
FROM EMPLOYEES
WHERE (SALARY BETWEEN 60000 AND 70000) AND DEP_ID = 5;

# Sorting
You can sort the retrieved entries on the basis of one or more parameters.

First, assume that you have to retrieve a list of employees ordered by department ID.

Sorting is done using the ORDER BY clause in your SQL query. By default, the ORDER BY clause sorts the records in ascending order.








Classement


Vous pouvez trier les entrées récupérées sur la base d’un ou plusieurs paramètres.

Tout d’abord, supposons que vous deviez récupérer une liste d’employés classés par ID de service.

Le tri s’effectue à l’aide de la clause ORDER BY de votre requête SQL. Par défaut, la clause ORDER BY trie les enregistrements dans l’ordre croissant.

In [ ]:
SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID;

Now, get the output of the same query in descending order of department ID, and within each deaprtment, the records should be ordered in descending alphabetical order by last name. For descending order, you can make use of the DESC clause.




Maintenant, obtenez la sortie de la même requête dans l’ordre décroissant de l’ID de service, et dans chaque département, les enregistrements doivent être classés par ordre alphabétique décroissant par nom de famille. Pour l’ordre décroissant, vous pouvez utiliser la clause DESC.

# Grouping
In this exercise, you will go through some SQL problems on Grouping.

NOTE: The SQL problems in this exercise involve usage of SQL Aggregate functions AVG and COUNT. COUNT has been covered earlier. AVG is a function that can be used to calculate the Average or Mean of all values of a specified column in the result set. For example, to retrieve the average salary for all employees in the EMPLOYEES table, issue the query: SELECT AVG(SALARY) FROM EMPLOYEES;.

A good example of grouping would be if For each department ID, we wish to retrieve the number of employees in the department.






Groupement


Dans cet exercice, vous allez passer en revue quelques problèmes SQL sur le regroupement.

REMARQUE : Les problèmes SQL de cet exercice impliquent l’utilisation des fonctions d’agrégation SQL AVG et COUNT. COUNT a déjà été abordé. AVG est une fonction qui peut être utilisée pour calculer la moyenne ou la moyenne de toutes les valeurs d’une colonne spécifiée dans le jeu de résultats. Par exemple, pour récupérer le salaire moyen de tous les employés dans la table EMPLOYEES, émettez la requête : SELECT AVG(SALARY) FROM EMPLOYEES ;.

Un bon exemple de regroupement serait si pour chaque ID de département, nous souhaitons récupérer le nombre d’employés dans le département.

In [ ]:
SELECT DEP_ID, COUNT(*)
FROM EMPLOYEES
GROUP BY DEP_ID;

Maintenant, pour chaque département, récupérez le nombre d’employés dans le département et le salaire moyen des employés dans le département. Pour cela, vous pouvez utiliser COUNT(*) pour récupérer le nombre total d’une colonne, et la fonction AVG() pour calculer les salaires moyens, puis GROUP BY.

In [ ]:
SELECT DEP_ID, COUNT(*), AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID;

Vous pouvez affiner votre sortie en utilisant des étiquettes appropriées pour les colonnes de données récupérées. Étiquetez les colonnes calculées dans le jeu de résultats du dernier problème comme NUM_EMPLOYEES et AVG_SALARY.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID;

Vous pouvez également combiner l’utilisation des instructions GROUP BY et ORDER BY pour trier la sortie de chaque groupe en fonction d’un paramètre spécifique. Il est important de noter que dans un tel cas, la clause ORDER BY doit être utilisée après la clause GROUP BY. Par exemple, nous pouvons trier le résultat de la requête précédente par salaire moyen. La requête SQL deviendrait ainsi

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
ORDER BY AVG_SALARY;

Si vous avez besoin de filtrer une réponse groupée, vous devez utiliser la clause HAVING . Dans l’exemple précédent, si nous souhaitons limiter le résultat aux départements de moins de 4 employés, nous devrons utiliser HAVING après le GROUP BY, et utiliser la fonction count() dans la clause HAVING au lieu de l’étiquette de colonne.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING count(*) < 4
ORDER BY AVG_SALARY;

# Questions d’entraînement
1. ### Récupérez la liste de tous les employés, prénoms et noms, dont les prénoms commencent par 'S'.

In [ ]:
SELECT F_NAME, L_NAME
FROM EMPLOYEES
WHERE F_NAME LIKE 'S%';

2. ### Organisez tous les enregistrements de la table EMPLOYÉS dans l’ordre croissant de la date de naissance.

In [ ]:
SELECT *
FROM EMPLOYEES
ORDER BY B_DATE;

3. ### Regroupez les enregistrements en fonction des ID de département et filtrez-les de ceux dont le salaire moyen est supérieur ou égal à 60000. Affichez l’ID du service et le salaire moyen.

In [ ]:
SELECT DEP_ID, AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING AVG(SALARY) >= 60000;

4. ### Pour le problème ci-dessus, triez les résultats pour chaque groupe par ordre décroissant de salaire moyen.

In [ ]:
SELECT DEP_ID, AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING AVG(SALARY) >= 60000
ORDER BY AVG(SALARY) DESC;

5. ### Problème:
Récupérez tous les employés du département 5 dont le salaire est compris entre 60000 et 70000.

Indice
Utilisez le mot-clé BETWEEN pour ce problème SQL.

In [ ]:
SELECT *
FROM EMPLOYEES
WHERE (SALARY BETWEEN 60000 AND 70000) AND DEP_ID = 5;

Exercice 2 : Tri
Dans cet exercice, vous allez passer en revue quelques problèmes SQL sur le tri.

1. ### Problème:
Récupérez une liste d’employés classés par ID de service.

Indice
Utilisez la clause ORDER BY pour ce problème SQL. Par défaut, la clause ORDER BY trie les enregistrements dans l’ordre croissant.

Solution

In [ ]:
SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID;

1. ### Problème:
Récupérez une liste d’employés classés par ordre décroissant par ID de service et au sein de chaque département, classés par ordre alphabétique par nom de famille.

Indice
Utilisez la clause ORDER BY avec DESC pour ce problème SQL.

Solution

In [ ]:
SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID DESC, L_NAME DESC;

Exercice 3 : Regroupement
Dans cet exercice, vous allez passer en revue quelques problèmes SQL sur le regroupement.

NOTE: Les problèmes SQL de cet exercice impliquent l’utilisation des fonctions SQL Aggregate AVG et COUNT. COUNT a déjà été abordé. AVG est une fonction qui peut être utilisée pour calculer la moyenne ou la moyenne de toutes les valeurs d’une colonne spécifiée dans le jeu de résultats. Par exemple, pour récupérer le salaire moyen de tous les employés dans la table EMPLOYEES, exécutez la requête : . Vous en apprendrez plus sur AVG et d’autres fonctions d’agrégation plus loin dans la conférence Fonctions de base de données intégrées.SELECT AVG(SALARY) FROM EMPLOYEES;

Problème:
Pour chaque ID de service, récupérez le nombre d’employés dans le département.

Indice
Utilisez COUNT(*) pour récupérer le nombre total d’une colonne, puis GROUP BY.

Solution

In [ ]:
SELECT DEP_ID, COUNT(*)
FROM EMPLOYEES
GROUP BY DEP_ID;

Problème:
Pour chaque département, récupérez le nombre d’employés dans le département, et le salaire moyen des employés dans le département.

Indice
Utilisez COUNT(*) pour récupérer le nombre total d’une colonne, et la fonction AVG() pour calculer les salaires moyens, puis GROUP BY.

Solution

In [ ]:
SELECT DEP_ID, COUNT(*), AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID;

Problème:
Étiquetez les colonnes calculées dans le jeu de résultats du problème SQL 2 (Exercice 3, problème 2) comme NUM_EMPLOYEES et AVG_SALARY.

Indice
Utilisez des alias SQL : . Par exemple, AVG(SALARY) AS « AVG_SALARY ».column_name AS alias_name

Solution

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID;

Problème:
Dans le problème SQL 3 (Exercice 3 Problème 3), classez le résultat défini par Salaire moyen.

Indice
Utilisez ORDER BY après GROUP BY.

Solution

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
ORDER BY AVG_SALARY;

Problème:
Dans le problème SQL 4 (Exercice 3 Problème 4), limitez le résultat aux services de moins de 4 employés.

Indice
Utilisez HAVING après GROUP BY, et utilisez la fonction count() dans la clause HAVING au lieu de l’étiquette de colonne.

Solution

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING count(*) < 4
ORDER BY AVG_SALARY;

# Résumé : Affiner vos résultatsStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. À ce stade du cours, vous savez que

Vous pouvez utiliser la clause WHERE pour affiner les résultats de votre requête.

- La condition de recherche de la clause WHERE utilise un prédicat pour affiner la recherche.

- Vous pouvez utiliser le caractère générique (%) pour remplacer des caractères inconnus dans un modèle.

- Vous pouvez utiliser BETWEEN ... ET ... pour spécifier une plage de nombres.

- Vous pouvez trier les résultats d'une requête par ordre croissant ou décroissant, en utilisant la clause ORDER BY pour spécifier la colonne sur laquelle le tri doit être effectué.

- Vous pouvez regrouper les résultats d'une requête à l'aide de la clause GROUP BY.

# Fonctions de base de données intégrées

(Musique) Bonjour et bienvenue. Dans cette vidéo, nous allons étudier les fonctions SQL intégrées à la base de données.
Lisez la vidéo à partir de ::14 et suivez la transcription0:14
Commençons. Bien qu'il soit tout à fait possible d'extraire des données d'une base de données et d'effectuer ensuite des opérations sur ces données à partir de vos applications et ordinateurs portables, la plupart des bases de données sont dotées de fonctions intégrées. Ces fonctions peuvent être incluses dans des instructions SQL, ce qui vous permet d'effectuer des opérations sur directement dans la base de données. L'utilisation de fonctions de base de données peut réduire de manière significative la quantité de données qui doivent être extraites de la base de données. Cela réduit le trafic réseau et l'utilisation de la bande passante. Lorsque vous travaillez avec de grands ensembles de données, il peut être plus rapide d'utiliser des fonctions intégrées, plutôt que de récupérer d'abord les données dans votre application, puis d'exécuter des fonctions sur les données récupérées. Notez qu'il est également possible de créer vos propres fonctions, c'est-à-dire des fonctions définies par l'utilisateur dans la base de données, mais il s'agit d'un sujet plus avancé. Pour les exemples de cette leçon, considérons cette table PETRESCUE dans une base de données pour une organisation de sauvetage d'animaux
Lisez la vidéo à partir de :1:20 et suivez la transcription1:20
Elle enregistre les détails de la transaction de sauvetage et comprend les colonnes suivantes : ID, animal, quantité, coût et date du sauvetage. Pour les besoins de cette leçon, nous l'avons remplie avec plusieurs lignes de données, comme illustré ici. Que sont les fonctions d'agrégat ou de colonne ? Une fonction d'agrégat prend une collection de valeurs similaires, telles que toutes les valeurs d'une colonne, en entrée, et renvoie une valeur unique ou nulle. Les exemples de fonctions d'agrégat comprennent : somme, minimum, maximum, moyenne, etc. Examinons quelques exemples basés sur le tableau PETRESCUE. La fonction SUM est utilisée pour additionner toutes les valeurs d'une colonne. Pour utiliser la fonction, vous devez écrire le nom de la colonne entre parenthèses, après le nom de la fonction. Par exemple, pour additionner toutes les valeurs de la colonne COST, sélectionnez SUM (COST) from PETRESCUE. Lorsque vous utilisez une fonction d'agrégation, la colonne de l'ensemble de résultats reçoit par défaut un nombre. Il est possible de nommer explicitement la colonne résultante. Par exemple, disons que nous voulons appeler la colonne de sortie de la requête précédente, SUM_OF_COST. select SUM(COST) as SUM_OF_COST from PETRESCUE. Notez l'utilisation de "as" dans cet exemple. MINimum, comme son nom l'indique, est utilisé pour obtenir la valeur la plus faible. De même, MAXimum est utilisé pour obtenir la valeur la plus élevée. Par exemple, pour obtenir la quantité maximale d'un sauvetage d'animaux dans une seule transaction, sélectionnez MAX(QUANTITÉ) from PETRESCUE. Les fonctions d'agrégation peuvent également être appliquées à un sous-ensemble de données au lieu d'une colonne entière. Par exemple, pour obtenir la quantité minimale de la colonne ID pour les chiens. select MIN(ID) from PETRESCUE where animal equals dog. La fonction Average (AVG) est utilisée pour renvoyer la valeur moyenne. Par exemple, pour spécifier la valeur moyenne du coût, comme : select AVG(COST) from PETRESCUE. Notez que nous pouvons effectuer des opérations mathématiques entre les colonnes, et ensuite appliquer des fonctions d'agrégation sur elles. Par exemple, pour calculer le coût moyen par chien : select AVG(COST divided by QUANTITY) from PETRESCUE where ANIMAL equals Dog. Dans ce cas, le coût concerne plusieurs unités ; nous divisons donc d'abord le coût par la quantité du sauvetage. Examinons maintenant les fonctions Scalar et String. Les fonctions Scalar effectuent des opérations sur des valeurs individuelles. Par exemple, pour arrondir chaque valeur de la colonne de coût à l'entier le plus proche, sélectionnez ROUND (COST) from PETRESCUE. Il existe une classe de fonctions scalaires appelées fonctions de chaîne, qui peuvent être utilisées pour des opérations sur des chaînes de caractères. Il s'agit de valeurs char et varchar. Par exemple, pour récupérer la longueur de chaque valeur de la colonne animaux, sélectionnez LENGTH (ANIMAL) à partir de PETRESCUE. Les fonctions majuscules et minuscules peuvent être utilisées pour retourner les valeurs majuscules ou minuscules des chaînes de caractères. Par exemple, pour récupérer les valeurs des animaux en majuscules : select UPPERCASE (ANIMAL) from PETRESCUE. Les fonctions scalaires peuvent être utilisées dans la clause where. Par exemple, pour obtenir les valeurs en minuscules de la colonne animal pour cat, select star from PETRESCUE where LOWERCASE(ANIMAL) equals cat. Ce type d'instruction est utile pour faire correspondre des valeurs dans la clause where, si vous ne savez pas si les valeurs sont stockées en majuscules, en minuscules ou en majuscules et minuscules dans la table. Vous pouvez également faire en sorte qu'une fonction opère sur la sortie d'une autre fonction. Par exemple, pour obtenir des cas uniques pour la colonne animal en majuscules : select DISTINCT (UPPERCASE(ANIMAL)) from PETRESCUE. Dans cette vidéo, nous avons examiné certaines fonctions d'agrégation SQL intégrées, telles que sum, minimum, maximum et average. Nous avons également examiné les fonctions scalaires et string, telles que round, lowercase et uppercase. Merci d'avoir regardé. (Musique)
Obligatoire
fr
​

# Atelier pratique : fonctions intégrées

En SQL, vous pouvez accéder à de nombreuses fonctions intégrées qui peuvent être utilisées pour obtenir plus de variété dans notre analyse de données. Ces fonctions incluent des fonctions d’agrégation (telles que MAX, MIN, SUM et AVG), des fonctions de chaîne (telles que LENGTH, UCASE et LCASE), des fonctions scalaires (telles que ROUND) et diverses fonctions de date. Dans cet onglet, vous obtiendrez une pratique pratique sur la façon de les utiliser tous.

Objectifs
Après avoir terminé cet atelier, vous serez en mesure de composer des requêtes dans phpMyAdmin avec MySQL en utilisant :

- Fonctions d’agrégation
- Fonctions scalaires
- Fonctions de chaîne de caractères
- Fonctions de date

Plutôt que de créer la table manuellement en tapant les commandes DDL dans l’éditeur SQL, vous allez exécuter un script contenant la commande create table.

Téléchargez le fichier de script PETRESCUE-CREATE.sql

Remarque : Pour télécharger, cliquez avec le bouton droit de la souris sur le lien ci-dessus et cliquez sur Enregistrer sous ou Enregistrer le lien sous en fonction de votre navigateur. N’oubliez pas d’enregistrer le fichier en tant que fichier .sql et non en HTML.

Ensuite, chargez le fichier .sql dans votre base de données à l’aide de l’option Importer, comme indiqué dans l’image ci-dessous.

Lors de l’exécution, la table PETRESCUE sera créée dans la base de données Mysql_Learners et chargée avec un ensemble de valeurs. Les attributs de la table PETRESCUE sont les suivants :

In [ ]:
Une fois la table chargée, vous pouvez ouvrir l’éditeur sql pour commencer à exécuter les requêtes.

# Logiciels utilisés dans cet atelier
Dans cet atelier, vous allez utiliser MySQL. MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer des données efficacement.

Fonctions d’agrégation
1. ### Écrivez une requête qui calcule le coût total de tous les sauvetages d’animaux dans la table PETRESCUE.

For this query, we will use the function SUM(COLUMN_NAME). The output of this query will be the total value of all elements in the column. The query for this question can be written as:

In [ ]:
SELECT SUM(COST) FROM PETRESCUE;

You can further assign a label to the query SUM_OF_COST.

In [ ]:
SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE;

2. ### Rédigez une requête qui affiche la quantité maximale d’animaux sauvés (de n’importe quel type).

Pour cette requête, nous utiliserons la fonction MAX(COLUMN_NAME). La sortie de cette requête sera la valeur maximale de tous les éléments de la colonne. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT MAX(QUANTITY) FROM PETRESCUE;

In [ ]:
La requête peut facilement être modifiée pour afficher la quantité minimale à l’aide de la fonction MIN à la place.

In [ ]:
SELECT MIN(QUANTITY) FROM PETRESCUE;

3. ### Rédigez une requête qui affiche le coût moyen des animaux secourus.

Pour cette requête, nous utiliserons AVG(COLUMN_NAME). La sortie de cette requête sera la moyenne de tous les éléments de la colonne. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT AVG(COST) FROM PETRESCUE;

# Fonctions scalaires et fonctions de chaîne

1. ### Écrivez une requête qui affiche le coût intégral arrondi de chaque sauvetage.

Pour cette requête, nous utiliserons la fonction ROUND(COLUMN_NAME, NUMBER_OF_DECIMALS). La sortie de cette requête sera la valeur de chaque élément de la colonne arrondie au nombre de décimales spécifié. Notez que le deuxième argument est facultatif et, s’il est omis, entraîne l’arrondi à une valeur entière. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT ROUND(COST) FROM PETRESCUE;

The query could also be written as:

SELECT ROUND(COST, 0) FROM PETRESCUE;

Dans le cas où la question était d’arrondir la valeur à 2 décimales, la requête serait modifiée comme suit :

In [ ]:
SELECT ROUND(COST, 2) FROM PETRESCUE;

2. ### Écrivez une requête qui affiche la longueur de chaque nom d’animal.

Pour cette requête, nous utiliserons la fonction LENGTH(COLUMN_NAME). Le résultat de cette requête sera la longueur de chaque élément de la colonne. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT LENGTH(ANIMAL) FROM PETRESCUE;

3. ### Écrivez une requête qui affiche le nom de l’animal dans chaque sauvetage en majuscules.

Pour cette requête, nous utiliserons la fonction UCASE(COLUMN_NAME). La sortie de cette requête sera chaque élément de la colonne en lettres majuscules. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT UCASE(ANIMAL) FROM PETRESCUE;

Tout aussi facilement, l’utilisateur pourrait demander une représentation en minuscules, et la requête serait modifiée comme suit :

In [ ]:
SELECT LCASE(ANIMAL) FROM PETRESCUE;

# Date Functions

1. ### Rédigez une requête qui affiche le jour du mois où les chats ont été sauvés.

Pour cette requête, nous utiliserons la fonction DAY(COLUMN_NAME). La sortie de cette requête ne sera que la partie DAY de la date dans la colonne. La requête pour cette question peut s’écrire comme suit :

In [ ]:
SELECT DAY(RESCUEDATE) FROM PETRESCUE;

In [ ]:
Dans le cas où la requête demandait MONTH de sauvetage, la requête se transformerait en :

In [ ]:
SELECT MONTH(RESCUEDATE) FROM PETRESCUE;

In [ ]:
Dans le cas où la requête demandait YEAR de sauvetage, la requête se transformerait en :

In [ ]:
SELECT YEAR(RESCUEDATE) FROM PETRESCUE;

2. ### Les animaux secourus doivent consulter le vétérinaire dans les trois jours suivant leur arrivée. Rédigez une requête qui affiche le troisième jour de chaque sauvetage.

Pour cette requête, nous utiliserons la fonction DATE_ADD(COLUMN_NAME, INTERVAL Number Date_element). Ici, la quantité en Nombre et en Date_element se combineront pour former l’intervalle à ajouter à la date dans la colonne. Pour la question donnée, la requête serait la suivante :

In [ ]:
SELECT DATE_ADD(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE

In [ ]:
If the question was to add 2 months to the date, the query would change to:

In [ ]:
SELECT DATE_ADD(RESCUEDATE, INTERVAL 2 MONTH) FROM PETRESCUE

De même, on peut récupérer une date antérieure à celle donnée dans la colonne par un nombre donné à l’aide de la fonction DATE_SUB. En modifiant le même exemple, la requête suivante fournirait la date 3 jours avant le sauvetage.

In [ ]:
SELECT DATE_SUB(RESCUEDATE, INTERVAL 3 DAY) FROM PETRESCUE

3. ### Écrivez une requête qui affiche la durée pendant laquelle les animaux ont été secourus, par exemple, la différence entre la date actuelle et la date de sauvetage.

Pour cette requête, nous utiliserons la fonction DATEDIFF(Date_1, Date_2). Cette fonction calcule la différence entre les deux dates données et donne le résultat en nombre de jours. Pour la question donnée, la requête serait la suivante :

In [ ]:
SELECT DATEDIFF(CURRENT_DATE, RESCUEDATE) FROM PETRESCUE

CURRENT_DATE s’agit également d’une fonction intégrée qui renvoie la date actuelle telle qu’elle est connue du serveur.

Pour présenter la sortie au format AAAA-MM-JJ, une autre fonction FROM_DAYS(number_of_days) peut être utilisée. Cette fonction prend un certain nombre de jours et renvoie la sortie formatée requise. La requête ci-dessus serait donc modifiée en

In [ ]:
SELECT FROM_DAYS(DATEDIFF(CURRENT_DATE, RESCUEDATE)) FROM PETRESCUE

# Practice Problems

1. ### Rédigez une requête qui affiche le coût moyen du sauvetage d’un seul chien. Notez que le coût par chien ne serait pas le même dans différents cas.

Pour un tel problème, vous devez utiliser la fonction 'AVG' sur 'COST/QUANTITY', par exemple, le coût par quantité unitaire.

In [ ]:
SELECT AVG(COST/QUANTITY) FROM PETRESCUE WHERE ANIMAL = 'Dog';

2. ### Écrivez une requête qui affiche le nom de l’animal dans chaque sauvetage en majuscules sans doublons.

In [ ]:
To write this query, you must use the `DISTINCT` and `UCASE` functions.

In [ ]:
SELECT DISTINCT UCASE(ANIMAL) FROM PETRESCUE;

3. ### Écrivez une requête qui affiche toutes les colonnes de la table PETRESCUE WHERE le ou les animaux sauvés sont des chats. Utilisez cat en minuscules dans la requête.

You have to use `LCASE` function for writing this query.

In [ ]:
SELECT *
FROM PETRESCUE
WHERE LCASE(ANIMAL)="cat";

4. ### Rédigez une requête qui affiche le nombre de sauvetages au cours du 5e mois.

In [ ]:
You must use the `SUM` AND `MONTH` function to write this query.

In [ ]:
SELECT SUM(QUANTITY)
FROM PETRESCUE
WHERE MONTH(RESCUEDATE)="05";

5. ### The rescue shelter is supposed to find good homes for all animals within 1 year of their rescue. Write a query that displays the ID and the target date.

In [ ]:
You have to use the `DATE_ADD` function for writing this query.

In [ ]:
SELECT ID, DATE_ADD(RESCUEDATE, INTERVAL 1 YEAR) FROM PETRESCUE;

In [ ]:
Conclusion
Congratulations on completing this lab.

You are now able to:

Use aggregation functions to calculate total, maximum, minimum, and average values of numerical attributes.
Use scalar functions to round a floating value to the desired number of decimal places.
Use string functions to convert text into upper or lower cases.
Use date operations to manipulate data columns with the attribute as date.

# Sous-requêtes et sélections imbriquées

Bonjour et bienvenue. Dans cette vidéo, vous allez apprendre à rédiger des sous-requêtes ou des instructions de sélection imbriquées. Les sous-requêtes ou sous-sélections ressemblent à des requêtes classiques , mais placées entre parenthèses et imbriquées dans une autre requête. Cela vous permet de former des requêtes plus puissantes que celles qui auraient été possibles autrement. Un exemple de requête imbriquée est présenté. Dans cet exemple, la sous-requête se trouve dans la clause WHERE d'une autre requête. Examinez le tableau des employés de la vidéo précédente. Les premières lignes de données sont affichées ici. Le tableau contient plusieurs colonnes, dont un identifiant d'employé, un prénom, un nom de famille, un salaire, etc. Nous allons maintenant passer en revue quelques exemples impliquant ce tableau. Examinons un scénario qui peut nécessiter l'utilisation de sous-requêtes. Supposons que nous voulions récupérer la liste des employés dont le salaire est supérieur au salaire moyen. Pour ce faire, vous pouvez essayer ce code. Sélectionnez * parmi les employés, où salaire > AVG (salaire). Cependant, l'exécution de cette requête entraînera une erreur comme celle illustrée. Indique une utilisation non valide de la fonction d'agrégation. L'une des limites des fonctions d'agrégation intégrées, comme la fonction moyenne, est qu'elles ne peuvent pas toujours être évaluées dans la clause WHERE. Ainsi, pour évaluer une fonction comme average dans la clause WHERE, nous pouvons utiliser une expression de sous-sélection comme celle présentée ici. Sélectionnez EMP_ID, F_NAME, L_NAME, SALARY parmi les employés où SALARY < (sélectionnez AVG (SALARY) parmi les employés). Notez que la fonction moyenne est évaluée dans la première partie de la sous-requête.
Lisez la vidéo à partir de :2:6 et suivez la transcription2:06
Cela nous permet de contourner la limitation qui consiste à l'évaluer directement dans la clause WHERE. La sous-sélection ne doit pas simplement figurer dans la clause WHERE. Il peut également figurer dans d'autres parties de la requête, par exemple dans la liste des colonnes à sélectionner. Ces sous-requêtes sont appelées expressions de colonnes. Examinons maintenant un scénario dans lequel nous pourrions vouloir utiliser une expression de colonne. Supposons que nous voulions comparer le salaire de chaque employé avec le salaire moyen. Nous pourrions essayer une requête telle que sélectionner EMP_ID, SALARY, AVG (SALARY) AS AVG_SALARY auprès des employés. L'exécution de cette requête entraînera une erreur indiquant qu'aucune clause group by n'est spécifiée. Nous pouvons contourner cette erreur en utilisant la fonction average dans une sous-requête placée dans la liste des colonnes. Par exemple, sélectionnez EMP_ID, SALARY, (sélectionnez AVG (SALARY) parmi les employés ) COMME AVG_SALARY parmi les employés. Une autre option consiste à intégrer la sous-requête à la clause FROM. Les sous-requêtes de ce type sont parfois appelées tables dérivées ou expressions de table. Parce que la requête externe utilise les résultats de la sous-requête comme source de données. Examinons un exemple pour créer une expression de table contenant des informations non sensibles sur les employés. Sélectionnez* parmi (sélectionnez EMP_ID, F_NAME, L_NAME, DEP_ID parmi les employés) COMME EMP4ALL. La table dérivée d'une sous-requête n' inclut pas de champs sensibles tels que la date de naissance ou le salaire. Cet exemple est trivial, et nous aurions tout aussi bien pu inclure les colonnes dans la requête externe. Toutefois, ces tables dérivées peuvent s'avérer efficaces dans des situations plus complexes, par exemple lorsque vous travaillez avec plusieurs tables et que vous effectuez des jointures. Dans cette vidéo, vous avez vu comment les sous-requêtes et les requêtes imbriquées peuvent être utilisées pour créer des requêtes plus riches et comment elles peuvent surmonter certaines des limites des fonctions d'agrégation. Vous avez également appris à utiliser des sous-requêtes dans la clause WHERE, dans la liste des colonnes et dans la clause FROM. Merci d'avoir regardé cette vidéo

# Atelier pratique : Sous-requêtes et sélections imbriquées

# Objectifs
À l’issue de cet atelier, vous serez en mesure de :

- Écrire des requêtes SQL qui démontrent la nécessité d’utiliser des sous-requêtes
- Composer des sous-requêtes dans la clause where
- Créer des expressions de colonne (par exemple, une sous-requête à la place d’une colonne)
- Écrire des expressions de table (par exemple, une sous-requête à la place d’une table)

# Charger la base de données
En utilisant les compétences acquises dans les modules précédents, vous devez d’abord créer la base de données en MySQL. Suivez les étapes ci-dessous.

1. ### Ouvrez l’interface phpMyAdmin à partir de la boîte à outils Skills Network dans l’IDE Cloud.

2. ### Créez une base de données vierge nommée « RH ». Utilisez le script partagé dans le lien ci-dessous pour créer les tables requises.
Script_Create_Tables.sql

3. ### Téléchargez les fichiers contenus dans les liens ci-dessous sur votre appareil local (si ce n’est pas déjà fait dans les ateliers précédents)
Departments.csv

Jobs.csv

JobsHistory.csv

Locations.csv

Employees.csv

4. ### Utilisez ces fichiers dans l’interface phpMyAdmin comme données pour les tables respectives de la base de données 'HR'.

#  Sous-requêtes et sélections imbriquées
Supposons qu’on vous demande de récupérer tous les dossiers d’employés dont le salaire est inférieur au salaire moyen. Pour ce faire, vous pouvez utiliser la requête suivante.

In [ ]:
SELECT * 
FROM EMPLOYEES 
WHERE salary < AVG(salary);

Toutefois, cette requête génère une erreur indiquant « Utilisation illégale de la fonction de groupe ». Ici, la fonction de groupe est AVG et ne peut pas être utilisée directement dans la condition car elle n’a pas été récupérée à partir des données. Par conséquent, la condition utilisera une sous-requête pour récupérer les informations sur le salaire moyen afin de comparer le salaire existant. La requête modifiée deviendrait :

In [ ]:
SELECT *
FROM EMPLOYEES
WHERE SALARY < (SELECT AVG(SALARY) FROM EMPLOYEES);

Envisagez maintenant d’exécuter une requête qui récupère tous les enregistrements d’employés avec EMP_ID, SALAIRE et salaire maximum comme MAX_SALARY dans chaque ligne. Pour cela, le salaire maximum doit être interrogé et utilisé comme l’une des colonnes. Cela peut être fait à l’aide de la requête ci-dessous.

In [ ]:
SELECT EMP_ID, SALARY, (SELECT MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY 
FROM EMPLOYEES;

Maintenant, considérez que vous souhaitez extraire le prénom et le nom de famille de l’employé le plus âgé. Étant donné que l’employé le plus âgé sera celui dont la date de naissance est la plus faible, la requête peut s’écrire comme suit :

Vous pouvez également utiliser des sous-requêtes pour créer des tables dérivées, qui peuvent ensuite être utilisées pour interroger des informations spécifiques. Supposons que vous vouliez connaître le salaire moyen des 5 personnes les mieux rémunérées de l’entreprise. Vous devrez d’abord extraire un tableau des cinq meilleurs salaires sous forme de tableau. À partir de ce tableau, vous pouvez interroger la valeur moyenne du salaire. La requête peut s’écrire comme suit.

In [ ]:
SELECT AVG(SALARY) 
FROM (SELECT SALARY 
      FROM EMPLOYEES 
      ORDER BY SALARY DESC 
      LIMIT 5) AS SALARY_TABLE;

Note that it is necessary to give an alias to any derived tables.

# Problèmes de pratique
1. ### Rédigez une requête pour trouver le salaire moyen des cinq employés les moins bien rémunérés.

Cliquez ici pour un indice

Vous devez classer les données dans l’ordre croissant des salaires et les limiter aux cinq premières entrées, en les traitant comme une table dérivée. Prenez la moyenne de ces entrées.

In [ ]:
SELECT AVG(SALARY)
FROM
(SELECT SALARY 
FROM EMPLOYEES
ORDER BY SALARY 
LIMIT 5) AS SALARY_TABLE;

2. ### Rédigez une requête pour trouver les enregistrements des employés dont l’âge est supérieur à l’âge moyen de tous les employés.
Cliquez ici pour un indice
L’âge en années peut être calculé comme la composante de l’année dans la différence entre la date de naissance et la date du jour. Vous devez comparer l’âge en années avec l’âge moyen en années. L’âge moyen en années sera évalué en tant que sous-requête.

In [ ]:
SELECT * 
FROM EMPLOYEES 
WHERE YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE,B_DATE))) > 
    (SELECT AVG(YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE,B_DATE)))) 
    FROM EMPLOYEES);

3. ### Dans le tableau Job_History, affichez la liste des numéros d’employé, des années de service et des années de service moyennes pour toutes les entrées.
Cliquez ici pour obtenir un indice
Pour cela, vous devez calculer les années de service comme une différence entre la date d’adhésion et la date actuelle. Le nombre moyen d’années de service doit être interrogé séparément pour être affiché.

In [ ]:
SELECT EMPL_ID, YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE, START_DATE))), 
    (SELECT AVG(YEAR(FROM_DAYS(DATEDIFF(CURRENT_DATE, START_DATE)))) 
    FROM JOB_HISTORY)
FROM JOB_HISTORY;

# Conclusion
Félicitations! Vous avez terminé cet atelier et êtes prêt pour le sujet suivant.

Vous devriez maintenant être en mesure de :

- Écrire des requêtes SQL qui démontrent la nécessité d’utiliser des sous-requêtes
- Composer des sous-requêtes dans la clause WHERE
- Créer des expressions de colonne (par exemple, une sous-requête à la place d’une colonne)
- Écrire des expressions de table (par exemple, une sous-requête à la place d’une table)

# Travailler avec plusieurs tableaux

Bonjour et bienvenue. Dans cette vidéo, vous apprendrez à écrire des requêtes qui accèdent à plus d'une table. Il y a plusieurs façons d'accéder à plusieurs tables dans la même requête. Notamment, en utilisant les sous-requêtes, les JOIN implicites, et les opérateurs JOIN, tels que INNER JOIN et OUTER JOIN. Dans cette vidéo, nous examinerons les deux premières options. La troisième option est traitée plus en détail dans d'autres vidéos. Considérons les tables employees et departments d'une vidéo précédente. La table employees contient plusieurs colonnes pour les catégories, telles que l'ID de l'employé, le prénom, le nom, et le salaire, pour n'en citer que quelques-unes. La table Departments contient l'ID du département, le nom du département, l'ID du responsable et l'ID de l'emplacement. Voici quelques exemples de données provenant de ces tables. Nous utiliserons ces tables pour les exemples de cette vidéo. Dans une vidéo précédente, nous avons appris à utiliser les sous-requêtes. Maintenant, utilisons les sous-requêtes pour travailler avec plusieurs tables. Si nous voulons récupérer uniquement les enregistrements d'employés de la table employees pour lesquels un ID de département existe dans la table departments, nous pouvons utiliser une sous-requête comme suit. Select star from employees, where department_ID IN, select department_ID_department from departments. Ici, la requête externe accède à la table employees et la sous-requête sur la table departments est utilisée pour filtrer l'ensemble des résultats de la requête externe. Supposons que nous voulions extraire uniquement la liste des employés d'un lieu spécifique. Nous ne disposons d'aucune information sur le lieu dans la table des employés, mais la table des départements contient une colonne appelée ID de lieu. Par conséquent, nous pouvons utiliser une sous-requête de la table Departments comme entrée de la requête de la table employee comme suit. Select star from employees, where department_ID IN, select department_ID_department from departments, where location ID equals L0002. Maintenant, récupérons l'ID du département et le nom du département pour les employés qui gagnent plus de 70 000 $. Pour ce faire, nous aurons besoin d'une sous-requête sur la table employees pour satisfaire les critères de salaire, et ensuite l'introduire comme entrée dans une requête externe sur la table departments afin d'obtenir les informations correspondantes sur le département. Select department_ID_department department_name from departments, where department_ID_department IN, select department_ID from employees where salary is greater than 70,000. Nous pouvons également accéder à plusieurs tables en les spécifiant dans la clause FROM de la requête. Prenons l'exemple suivant : select star from employees, departments. Nous spécifions ici deux tables dans la clause FROM. Il en résulte une jointure de table, mais notez que nous n'utilisons pas explicitement l'opérateur de jointure. La jointure résultante dans cet exemple est appelée jointure complète ou jointure cartésienne, parce que chaque ligne de la première table est jointe à chaque ligne de la seconde table. Si vous examinez l'ensemble des résultats, vous verrez plus de lignes que dans les deux tables individuellement. Nous pouvons utiliser des opérandes supplémentaires pour limiter l'ensemble des résultats. Examinons un exemple dans lequel nous limitons l'ensemble de résultats aux seules lignes dont les ID de département correspondent. Select star from employees, departments, where employees department_ID equals departments, department_ID_department. Remarquez que dans la clause WHERE, nous préfixons le nom de la colonne avec le nom de la table. Il s'agit de qualifier complètement le nom de la colonne, puisqu'il est possible que des tables différentes aient des noms de colonnes exactement identiques. Comme les noms de tables peuvent parfois être longs, nous pouvons utiliser des alias plus courts pour les noms de tables, comme illustré ci-dessous. Select star from employees E, departments D, where E department_ID equals D department_ID_department. Ici, nous définissons l'alias E pour la table employees et D pour la table departments, et utilisons ensuite ces alias dans la clause WHERE. Si nous voulions voir le nom du département pour chaque employé, nous entrerions le code comme suit : Select Employee_ID, Department_Name from employees E, departments D, where E department_ID equals D department_ID_department. Comme précédemment, les noms de colonnes dans la clause select peuvent également être préfixés par des alias, comme le montre la requête. Select E. Employee_ID, D. Department_ID_department, from employees E. Departments D where E.Department_ID equals D. Department_ID_department. Dans cette leçon, nous vous avons montré comment travailler avec plusieurs tables en utilisant des sous-requêtes et des jointures implicites. Merci d'avoir regardé cette leçon.

# Hands-on Lab: Working with Multiple Tables

# Objectifs
À l’issue de cet atelier, vous serez en mesure de :

- Écrire des requêtes SQL qui accèdent à plusieurs tables
- Composer des requêtes qui accèdent à plusieurs tables à l’aide d’une instruction imbriquée dans la clause WHERE
- Créer des requêtes avec plusieurs tables dans la clause FROM
- Écrire des requêtes de jointure implicite avec des critères de jointure spécifiés dans la clause WHERE
- Spécifier des alias pour les noms de table et qualifier les noms de colonne avec des alias de table

# Accessing multiple tables with sub-queries

Voyons quelques exemples de requêtes nécessitant un accès à plusieurs tables à l’aide de sous-requêtes.

1. ### Récupérez uniquement les enregistrements EMPLOYEES correspondante aux jobs dans la table JOBS.

Pour une telle question, vous pouvez implémenter la sous-requête dans la clause WHERE, de sorte que la colonne qui se chevauche de JOB_ID puisse identifier les entrées requises.

In [ ]:
SELECT * FROM EMPLOYEES WHERE JOB_ID IN (SELECT JOB_IDENT FROM JOBS);

2. ### Récupérez des informations sur les JOB pour les employés gagnant plus de 70 000 $.

Pour cet exemple, récupérez les détails de la table JOBS, qui a des ID communs avec ceux disponibles dans la table EMPLOYEES, à condition que le salaire dans la table EMPLOYEES soit supérieur à 70 000 $. Vous pouvez écrire la requête comme suit :

In [ ]:
SELECT JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN (select JOB_ID from EMPLOYEES where SALARY > 70000 );

# Accès à plusieurs tables avec des sous-requêtes
Voyons quelques exemples de requêtes nécessitant un accès à plusieurs tables à l’aide de sous-requêtes.

1. ### Récupérez uniquement les enregistrements EMPLOYEES correspondant aux jobs dans la table JOBS.

Pour une telle question, vous pouvez implémenter la sous-requête dans la clause WHERE, de sorte que la colonne qui se chevauche de JOB_ID puisse identifier les entrées requises.


La même question que précédemment, mais nous allons maintenant utiliser la jointure implicite pour récupérer les informations requises. Pour cela, vous allez combiner les tables en fonction des ID de tâche. Pour cela, utilisez la requête suivante :

In [ ]:
SELECT *
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;

2. ### Rétablissez la requête précédente à l’aide d’alias plus courts pour les noms de table.
Notez que les tables en question peuvent se voir attribuer des alias plus courts. Ceci est particulièrement utile dans les cas où des colonnes spécifiques doivent être accessibles à partir de différentes tables. La requête doit être modifiée comme suit :

In [ ]:
SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;

In [ ]:
Notice that the two queries are giving the same response.

3. ### Dans la requête précédente, récupérez uniquement l’ID d’employé, le nom et l’intitulé du poste.
Notez que Job Title est une colonne de la table JOBS et que d’autres détails proviennent de la table EMPLOYEES. Les deux tables seront jointes sur l’ID de tâche. La requête serait la suivante :

In [ ]:
SELECT EMP_ID,F_NAME,L_NAME, JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;

4. ### Rétablissez la requête précédente, mais spécifiez les noms de colonne complets avec des alias dans la clause SELECT.
Les noms de colonne peuvent également être préfixés par des alias de table pour garder une trace de l’origine de chaque colonne. La requête ci-dessus sera modifiée comme indiqué ci-dessous

In [ ]:
SELECT E.EMP_ID, E.F_NAME, E.L_NAME, J.JOB_TITLE
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT;

# Problèmes d’entraînement
Récupérez uniquement la liste des employés dont le JOB_TITLE est Jr. Designer.

In [ ]:
SELECT *
FROM EMPLOYEES E, JOBS J
WHERE E.JOB_ID = J.JOB_IDENT AND J.JOB_TITLE= 'Jr. Designer';

Récupérez les informations JOB et une liste des employés dont l’année de naissance est postérieure à 1976.

a. Utilisation de sous-requêtes

In [ ]:
SELECT JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT
FROM JOBS
WHERE JOB_IDENT IN (SELECT JOB_ID
                    FROM EMPLOYEES
                    WHERE YEAR(B_DATE)>1976 );

In [ ]:
b. Using implicit join

In [ ]:
SELECT J.JOB_TITLE, J.MIN_SALARY, J.MAX_SALARY, J.JOB_IDENT
FROM JOBS J, EMPLOYEES E
WHERE E.JOB_ID = J.JOB_IDENT AND YEAR(E.B_DATE)>1976;

# Atelier pratique : Sous-requêtes et SELECT imbriqués SUR IBM Db2 on cloud

2. ### Problème:
Exécutez une requête de travail à l’aide d’une sous-sélection pour récupérer tous les enregistrements d’employés dont le salaire est inférieur au salaire moyen.

Indice
Mettez AVG(SALAIRE) du SELECT interne en comparaison avec le SALAIRE du SELECT externe.

In [ ]:
select EMP_ID, F_NAME, L_NAME, SALARY 
from employees 
where SALARY < (select AVG(SALARY) 
                from employees);

4. ###  Problème:
Exécutez une expression de colonne qui récupère tous les enregistrements d’employés avec EMP_ID, SALARY et maximum salary comme MAX_SALARY dans chaque ligne.

Indice
Utilisez le SELECT (qui récupère MAX(SALARY)) comme colonne de l’autre SELECT.

In [ ]:
select EMP_ID, SALARY, ( select MAX(SALARY) from employees ) AS MAX_SALARY 
from employees;

5. ### Problème:
Exécutez une expression de table pour la table EMPLOYEES qui exclut les colonnes contenant des données sensibles sur les employés (c’est-à-dire qu’elle n’inclut pas les colonnes : SSN, B_DATE, SEX, ADDRESS, SALARY).

Indice
Utilisez un SELECT (qui récupère les données non sensibles des employés) après FROM de l’autre SELECT.

In [ ]:
select * from ( select EMP_ID, F_NAME, L_NAME, DEP_ID from employees) AS EMP4ALL;

# Atelier pratique : Utilisation de plusieurs tables sur Db2

À quoi ressemble une version implicite de la syntaxe d’instruction CROSS JOIN (également connue sous le nom de jointure cartésienne) ?

In [ ]:
SELECT column_name(s)
FROM table1, table2;

In [ ]:
À quoi ressemble une version implicite de la syntaxe de l’instruction INNER JOIN ?

In [ ]:
SELECT column_name(s)
FROM table1, table2
WHERE table1.column_name = table2.column_name;

# Exercice 1 : Accès à plusieurs tables à l’aide de sous-requêtes
1. ### Problème:

Récupérez uniquement les enregistrements EMPLOYEES qui correspondent aux tâches de la table JOBS.

In [ ]:
select * from employees where JOB_ID IN (select JOB_IDENT from jobs);

2. ### Problème:

Récupérez uniquement la liste des employés dont le JOB_TITLE est Jr. Designer.

In [ ]:
select * from employees where JOB_ID IN (select JOB_IDENT from jobs where JOB_TITLE= 'Jr. Designer');

3. ### Problème:

Récupérez des informations sur les EMPLOIS et qui gagnent plus de 70 000 $.

In [ ]:
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where SALARY > 70000 );

4. ### Problème:

Récupérez les informations JOB et dont l’année de naissance est postérieure à 1976.

In [ ]:
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE)>1976 );

5. ### Problème:

Récupérez les informations JOB pour les employées dont l’année de naissance est postérieure à 1976 AND DE SEXE Féminin

In [ ]:
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT
from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE)>1976 and SEX='F' );

# Exercice 2 : Accès à plusieurs tables à l’aide de jointures implicites
Problème:

Effectuez une jointure cartésienne/croisée implicite entre les tables EMPLOYEES et JOBS.

1. ### Problème:

Effectuez une jointure cartésienne/croisée implicite entre les tables EMPLOYEES et JOBS.

In [ ]:
select * from employees, jobs;

2. ### Problème:

Récupérez uniquement les enregistrements EMPLOYEES qui correspondent aux tâches de la table JOBS.

In [ ]:
select * from employees, jobs where employees.JOB_ID = jobs.JOB_IDENT;

3. ### Problème:

Rétablissez la requête précédente, en utilisant des alias plus courts pour les noms de table.

In [ ]:
select * from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

4. ### Problème:

Répétez la requête précédente, mais récupérez uniquement l’ID de l’employé, le nom de l’employé et l’intitulé du poste.

In [ ]:
select EMP_ID,F_NAME,L_NAME, JOB_TITLE from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

5. ### Problème:

Rétablissez la requête précédente, mais spécifiez les noms de colonne complets avec des alias dans la clause SELECT.

In [ ]:
select E.EMP_ID,E.F_NAME,E.L_NAME, J.JOB_TITLE from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

# Résumé : Fonctions, tableaux multiples et sous-requêtesStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. À ce stade du cours, vous connaissez :

- Les outils de gestion de base de données qui offrent des fonctions intégrées permettant d'effectuer des opérations sur les données au sein de la base de données elle-même.

- Que lorsque vous travaillez avec de grands ensembles de données, vous pouvez gagner du temps en utilisant des fonctions intégrées plutôt que de récupérer d'abord les données dans votre application et d'exécuter ensuite des fonctions sur les données récupérées.

- Vous pouvez utiliser des sous-requêtes pour former des requêtes plus puissantes qu'auparavant.

- Vous pouvez utiliser une expression de sous-sélection pour évaluer certaines fonctions agrégées intégrées telles que la fonction moyenne.

- Les tables dérivées ou les expressions de table sont des sous-requêtes dans lesquelles la requête externe utilise les résultats de la sous-requête comme source de données.

# SEMEAINE 4

#  Comment accéder aux bases de données avec Python

Bonjour, dans cette vidéo, vous allez apprendre à accéder à des bases de données en Python. Les bases de données sont de puissants outils pour les data scientists. Après avoir terminé ce module, vous serez en mesure d'expliquer les concepts de base liés à l'utilisation de Python pour la connexion aux bases de données. Vous allez ensuite créer des tables, charger des données et interroger des données à l'aide de SQL à partir de Jupyter Notebooks , puis analyser les données. Au cours des travaux pratiques, vous apprendrez à créer une instance dans le cloud, à vous connecter à une base de données, à interroger les données de la base de données à l'aide de SQL et à analyser les données à l'aide de Python. Vous serez en mesure d'expliquer les concepts de base liés à la connexion d'une application Python à une base de données. Décrivez les API SQL et dressez la liste de certaines des API propriétaires utilisées par les systèmes DBMS SQL les plus courants. Passons rapidement en revue certains des avantages de l'utilisation de Python, un langage de script populaire pour la connexion aux bases de données. L'écosystème Python est très riche et fournit des outils faciles à utiliser pour la science des données. Certains des packages les plus populaires sont NumPy, pandas, matplotlib et SciPy. Python est facile à apprendre et possède une syntaxe simple. En raison de sa nature open source, Python a été porté sur de nombreuses plateformes. Tous vos programmes Python peuvent fonctionner sur n'importe laquelle de ces plateformes sans aucune modification. Si vous faites attention et évitez les fonctionnalités dépendantes du système, Python prend en charge les systèmes de bases de données relationnelles. L'écriture de code Python pour accéder aux bases de données est facilitée par la présence de l'API de base de données Python. Communément appelée API de base de données, la documentation détaillée relative à Python est facilement disponible. Les blocs-notes sont également très populaires dans le domaine de la science des données car ils fonctionnent dans un environnement qui permet de créer et de partager des documents contenant du code en direct, des équations, des visualisations et des textes explicatifs. Une interface de bloc-notes est un environnement de bloc-notes virtuel utilisé pour la programmation. Les exemples d'interfaces de bloc-notes incluent le bloc-notes Mathematica, la feuille de travail Maple, le bloc-notes Matlab, IPython Jupyter, R Markdown, Apache Zeppelin, le bloc-notes Apache Spark et le cloud Databricks. Dans ce module, nous utiliserons les blocs-notes Jupyter. Le bloc-notes Jupyter est une application Web open source qui vous permet de créer et de partager des documents contenant du code en direct, des équations, des visualisations et des textes narratifs. Voici quelques-uns des avantages de l'utilisation des ordinateurs portables Jupyter. Support portable pour plus de 40 langages de programmation, dont Python , R, Julia et Scala. Les blocs-notes peuvent être partagés avec d'autres personnes par e-mail, Dropbox, GitHub et via la visionneuse de blocs-notes Jupyter. Votre code peut produire du HTML interactif riche, des images, des vidéos, du LaTeX et des types personnalisés. Vous pouvez tirer parti d'outils de mégadonnées tels qu'Apache Spark à partir de Python, R et Scala, et explorer ces mêmes données avec pandas, scikit-learn, ggplot2 et TensorFlow. C'est ainsi qu'un utilisateur typique accède aux bases de données à l'aide de code Python écrit sur un bloc-notes Jupyter, un éditeur Web. Il existe un mécanisme par lequel le programme Python communique avec le SGBD. Le code Python se connecte à la base de données à l'aide d'appels d'API. Nous expliquerons les bases des API SQL et des API de base de données Python. Une interface de programmation d'applications est un ensemble de fonctions que vous pouvez appeler pour accéder à un type de service. L'API SQL consiste en des appels de fonctions de bibliothèque en tant qu'interface de programmation d'applications, API, pour le SGBD. Pour transmettre des instructions SQL au SGBD, un programme d'application appelle des fonctions dans l'API, et il appelle d'autres fonctions pour récupérer les résultats des requêtes et les informations d'état du SGBD. Le fonctionnement de base d'une API SQL classique est illustré dans la figure. Le programme d'application commence son accès à la base de données par un ou plusieurs appels d'API qui connectent le programme au SGBD. Pour envoyer l'instruction SQL au SGBD, le programme construit l'instruction sous forme de chaîne de texte dans une mémoire tampon, puis effectue un appel d'API pour transmettre le contenu de la mémoire tampon au SGBD. Le programme d'application effectue des appels d'API pour vérifier l'état de sa demande DBMS et pour gérer les erreurs. Le programme d'application met fin à son accès à la base de données par un appel d'API qui le déconnecte de la base de données. Maintenant, nous allons apprendre les concepts de base sur certaines des API propriétaires utilisées par les systèmes DBMS populaires basés sur SQL. Chaque système de base de données possède sa propre bibliothèque. Comme vous pouvez le constater, le tableau présente une liste de quelques applications et des API SQL correspondantes. L'API MySQL C fournit un accès de bas niveau au protocole client-serveur MySQL et permet aux programmes C d'accéder au contenu de la base de données. L'API psycopg2 connecte les applications Python aux bases de données PostgreSQL. L'API IBM_DB est utilisée pour connecter des applications Python aux bases de données IBM DB2. L'API dblib est utilisée pour se connecter aux bases de données SQL Server. ODBC est utilisé pour accéder aux bases de données pour le système d'exploitation Microsoft Windows. L'OCI est utilisé par les bases de données Oracle. Enfin, JDBC est utilisé par les applications Java. Merci d'avoir regardé cette vidéo.

# Écrire du code à l'aide de l'interface DB-API

Bonjour et bienvenue dans l'écriture de code à l'aide de DB-API. Après avoir terminé cette vidéo, vous serez en mesure d'expliquer les concepts de base liés à l' API DB Python et aux curseurs de base de données, et également d'écrire du code à l'aide de DB-API. Comme nous l'avons vu au début de ce module, l'utilisateur écrit des programmes Python à l'aide d'un Jupyter Notebook. Il existe un mécanisme par lequel le code Python communique avec le SGBD. Le code Python se connecte à la base de données à l'aide d'appels d'API DB. L'API DB est une API standard Python permettant d' accéder aux bases de données relationnelles. Il s'agit d'une norme qui vous permet d'écrire un seul programme qui fonctionne avec plusieurs types de bases de données relationnelles au lieu d'écrire un programme distinct pour chacune d'entre elles. Si vous apprenez les fonctions DB-API, vous pouvez appliquer ces connaissances pour utiliser n'importe quelle base de données avec Python. Voici quelques avantages liés à l'utilisation de la DB-API. Il est facile à mettre en œuvre et à comprendre. Cette API a été définie pour favoriser la similitude entre les modules Python utilisés pour accéder aux bases de données. Il assure une cohérence qui rend les modules plus faciles à comprendre. Le code est généralement plus portable d' une base de données à l'autre, et sa portée de connectivité aux bases de données est plus étendue depuis Python. Comme nous le savons, chaque système de base de données possède sa propre bibliothèque. Comme vous pouvez le voir, le tableau présente une liste de quelques bases de données et des API DB correspondantes pour se connecter aux applications Python. La bibliothèque IBM Underscore DB est utilisée pour se connecter à une base de données IBM DB2. La bibliothèque Python du connecteur MySQL est utilisée pour se connecter à une base de données Compose depuis MySQL. La bibliothèque psychopg2 est utilisée pour se connecter à une composition depuis la base de données PostgreSQL. Enfin, la bibliothèque PyMongo est utilisée pour se connecter à une base de données Compose from Mongo DB. Les deux principaux concepts de la DB-API Python sont les objets de connexion et les objets de requête. Vous utilisez des objets de connexion pour vous connecter à une base de données et gérer vos transactions. Les objets Cursor sont utilisés pour exécuter des requêtes. Vous ouvrez un objet curseur, puis vous exécutez des requêtes. Le curseur fonctionne de la même manière qu'un curseur dans un système de traitement de texte, dans lequel vous faites défiler votre ensemble de résultats vers le bas et insérez vos données dans l'application. Les curseurs sont utilisés pour parcourir les résultats d'une base de données. La DB-API inclut un constructeur de connexion permettant de créer une connexion à la base de données. Elle renvoie un objet de connexion qui est ensuite utilisé par les différentes méthodes de connexion. Ces méthodes de connexion sont la méthode curseur, qui renvoie un nouvel objet curseur à l'aide de la connexion. La méthode commit, qui est utilisée pour valider toute transaction en attente dans la base de données. La méthode d'annulation, qui fait revenir la base de données au début de toute transaction en attente. La méthode close, qui est utilisée pour fermer une connexion à une base de données. Ces objets représentent un curseur de base de données utilisé pour gérer le contenu d'une opération de récupération. Les curseurs créés à partir de la même connexion ne sont pas isolés. En d'autres termes, toute modification apportée à la base de données par un curseur est immédiatement visible par les autres curseurs. Les curseurs créés à partir de différentes connexions peuvent ou ne peuvent pas être isolés en fonction de la manière dont le support des transactions est implémenté. Un curseur de base de données est une structure de contrôle qui permet de passer en revue les enregistrements d'une base de données de manière transversale. Il se comporte comme un nom de fichier ou un descripteur de fichier dans un langage de programmation. Tout comme un programme ouvre un fichier pour accéder à son contenu, il ouvre un curseur pour accéder aux résultats de la requête. De même, le programme ferme un fichier pour mettre fin à son accès et ferme un curseur pour mettre fin à l'accès aux résultats de la requête. Une autre similitude est que, tout comme le descripteur de fichier enregistre la position actuelle du programme dans un fichier ouvert, un curseur garde une trace de la position actuelle du programme dans les résultats de la requête. Passons en revue une application Python qui utilise l'API DB pour interroger une base de données. Tout d' abord, vous importez votre module de base de données à l'aide de l'API de connexion de ce module. Pour ouvrir une connexion à la base de données, vous utilisez le constructeur de connexion et vous transmettez les paramètres, à savoir le nom de la base de données, le nom d'utilisateur et le mot de passe. La fonction connect renvoie l'objet de connexion. Ensuite, vous créez un objet curseur sur l'objet de connexion. Le curseur est utilisé pour exécuter des requêtes et récupérer les résultats après avoir exécuté les requêtes à l'aide du curseur. Nous utilisons également le curseur pour récupérer les résultats de la requête. Enfin, lorsque le système a terminé d'exécuter les requêtes, il libère toutes les ressources en fermant la connexion. N'oubliez pas qu'il est toujours important de fermer les connexions pour éviter que les connexions inutilisées n'accaparent des ressources. Merci d'avoir regardé cette vidéo.

# Accès aux bases de données avec SQL Magic

Bonjour et bienvenue dans cette vidéo sur l' accès aux bases de données à l'aide de SQL Magic. Dans cette vidéo, vous découvrirez ce que sont les instructions magiques, la différence entre la magie linéaire et la magie cellulaire, certaines instructions magiques couramment utilisées et comment utiliser SQL Magic dans les bases de données d'accès aux Jupyter Notebooks. Que sont les déclarations magiques contenues dans les blocs-notes Jupyter ? Les commandes magiques ou fonctions magiques sont des commandes spéciales des blocs-notes Jupyter qui fournissent des fonctionnalités spéciales. Il ne s'agit pas d'un code Python valide mais il affecte le comportement du bloc-notes. Ils sont conçus pour résoudre divers problèmes courants liés à l'analyse de données standard. Il existe deux types de déclarations magiques dans les Jupyter Notebooks, Line Magics et Cell Magics. Dans les blocs-notes Jupyter, les commandes Line Magic sont précédées d'un caractère de pourcentage unique et fonctionnent sur une seule ligne de saisie. Ils sont similaires à des appels de ligne de commande dans un terminal shell. D'autre part, les Cell Magics sont préfixés par deux caractères de pourcentage et fonctionnent sur plusieurs lignes de saisie. Ils peuvent même transformer la cellule entière ou exécuter la cellule dans un langage de programmation différent. Quelques Line Magics couramment utilisés dans les carnets Jupyter, %pwd. Cette commande imprime le répertoire de travail actuel. Le pourcentage est que cette commande répertorie tous les fichiers du répertoire actuel. Historique des pourcentages. Cette commande affiche l'historique des commandes. Réinitialisation du pourcentage. Cette commande réinitialise l'espace de noms en supprimant tous les noms définis par l'utilisateur. Pourcentage qui. Cette commande répertorie toutes les variables de l'espace de noms. Pourcentage, qui. Cette commande fournit des informations plus détaillées sur toutes les variables de l'espace de noms. Pourcentage de matplotlib en ligne. Cette commande fait apparaître les tracés matplotlib dans le bloc-notes. Pourcentage de timeit, qui multiplie l'exécution d'une seule instruction. Pour obtenir une liste de toutes les magies de ligne disponibles, vous pouvez utiliser la commande « pourcentage is magic ». Vous pouvez utiliser la magie de plusieurs lignes dans une seule cellule d'un bloc-notes Jupiter. Chaque ligne magique doit se trouver sur sa propre ligne. Par exemple, pourcentage par personne, le pourcentage est. Cela imprimera le répertoire de travail actuel , puis listera tous les fichiers qu'il contient. N'oubliez pas que la magie linéaire fonctionne sur une seule ligne d'entrée. Vous pouvez en utiliser autant que vous le souhaitez dans une seule cellule si chacune se trouve sur sa propre ligne. Certaines instructions de magie linéaire peuvent également être utilisées comme instructions de magie cellulaire, ce qui modifierait la façon dont elles répondent. Par exemple, le pourcentage de temps pendant lequel il générerait une réponse avec le temps requis pour exécuter une seule instruction. Alors que le pourcentage de temps est multiplié par l'exécution de la cellule entière.
Lisez la vidéo à partir de :2:57 et suivez la transcription2:57
Writefile est un autre exemple où la magie cellulaire s'applique de manière unique. Puisque le pourcentage écrit le fichier, mon fichier .text écrit le contenu de la cellule dans le texte de mon fichier. La magie cellulaire ne se limite pas à Python, elle vous permet également d'exécuter du code dans d'autres langages. Voyons quelques exemples. La magie des cellules HTML en pourcentage et en pourcentage vous permet d'écrire du code HTML dans votre cellule, et il sera rendu en conséquence. Par exemple, l'utilisation du code HTML affiche le texte Hello World comme titre, pourcentage de Javascript en pourcentage ou pourcentage de pourcentage JS Cell magic vous permet d'écrire du code Javascript dans votre cellule. Par exemple, l'utilisation de code Javascript génère une page Web contextuelle avec le message d'affichage Hello World. Pourcentage de pourcentage Bash Cell Magic vous permet d'écrire des commandes bash. Par exemple, l'utilisation de l' instruction de script bash echo génère le texte Hello world tel qu'il sera reçu dans un terminal. Avant de pouvoir utiliser SQL Magic , vous devez toutefois installer certaines dépendances.
Lisez la vidéo à partir de :4:9 et suivez la transcription4:09
Tout d'abord, installez la bibliothèque IPython_SQL, qui permet la magie du SQL. Vous pouvez le faire en exécutant exclamation pip, install- IPython SQL dans une cellule de code d'un bloc-notes. Ensuite, pour utiliser SQL Magic dans Jupyter Notebook, vous devez charger l'extension SQL à l' aide du pourcentage load_ext SQL. Vous pouvez ensuite exécuter des requêtes SQL en saisissant Pourcentage SQL ou Pourcentage SQL selon que vous souhaitez utiliser la magie des lignes ou des cellules. Avant d'exécuter les requêtes, vous devez toutefois établir une connexion entre le serveur SQL et le module SQL Magic du bloc-notes. À titre d'exemple, examinons l'utilisation de SQL Magic avec le serveur de base de données SQL Lite3. Nous devons d'abord établir une connexion à une base de données, par exemple HR.db à l'aide de SQL Lite3. Ensuite, vous chargez le module SQL externe à l'aide de %load_extsql.
Lisez la vidéo à partir de :5:12 et suivez la transcription5:12
Vous devez maintenant établir une connexion entre le module magique SQL et le serveur SQL auquel vous accédez. Cela se fait à l'aide de l'instruction %sql sqllite : \ \ \ hRdb.
Lisez la vidéo à partir de :5:30 et suivez la transcription5:30
Vous pouvez maintenant utiliser la magie SQL pour exécuter n'importe quel type de requête sur la table. Un exemple est présenté ici pour afficher le contenu de la table des employés dans la base de données RH. Répertorions les concepts que vous avez appris. Vous pouvez maintenant décrire des phrases magiques, différencier la magie linéaire et la magie cellulaire. Discutez de certaines instructions magiques couramment utilisées, expliquez l'utilisation de SQL Magic dans les blocs-notes Jupyter pour accéder aux bases de données.

# Analyser des données avec Python

[MUSIQUE] Bonjour et bienvenue dans cette vidéo sur l'analyse de données avec Python. Après avoir visionné cette vidéo, vous serez en mesure de décrire comment concevoir un laboratoire pratique, d'expliquer comment créer les principales parties d'un laboratoire pratique et de décrire les laboratoires pédagogiques et les outils d'apprentissage, l'interopérabilité ou les laboratoires LTI. Dans cette vidéo, nous utiliserons les données nutritionnelles du menu McDonald's pour les plats populaires de McDonald's tout en utilisant Python pour effectuer une analyse exploratoire de base. McDonald's est une entreprise américaine de restauration rapide et la plus grande chaîne de restaurants au monde en termes de chiffre d'affaires. Bien que McDonald's soit connue pour ses produits de restauration rapide tels que les hamburgers, les frites, les boissons gazeuses, les milkshakes et les desserts, l'entreprise a ajouté à son menu des salades, des smoothies au poisson et des fruits. McDonald's fournit une analyse nutritionnelle des éléments de son menu pour vous aider à équilibrer votre repas McDonald's avec les autres aliments que vous consommez. L'ensemble de données utilisé dans cette leçon a été obtenu à partir des informations nutritionnelles du menu McDonald's de Kaggle. Nous devons créer une table de base de données sur un serveur SQL pour stocker l' ensemble de données nutritionnelles du menu McDonald's que nous allons utiliser. Nous pouvons utiliser SQLite 3, une bibliothèque Python en cours de traitement qui implémente un moteur de base de données SQL transactionnel autonome, sans serveur et sans configuration. Nous pouvons lire le fichier CSV de la base de données à l'aide de la fonction pandas.read_csv sur une variable, par exemple des données. Ensuite, la connexion à une base de données McDonald's DB peut être établie à l'aide de la fonction sqlite3.connect et en enregistrant l'objet de connexion dans une variable, par exemple conn. Le contenu des données variables peut ensuite être chargé sous forme de table dans la base de données McDonald's DB à l'aide de la fonction d'attribut 2_sql des données variables pandas. Dans l'exemple présenté ici, le contenu du fichier CSV est désormais disponible sous forme de table MCDONALDS_NUTRITION, qui peut désormais être interrogée selon les besoins. Voyons maintenant comment utiliser les pandas pour récupérer des données à partir des tables de la base de données. Pour ce faire, nous chargeons les données de la table MCDONALDS_NUTRITION dans le bloc de données, df, à l'aide de la méthode read_sqlmethod. La requête SQL Select et l'objet de connexion sont ensuite transmis en tant que paramètres à read_sqlmethod. Nous pouvons visualiser les premières lignes du bloc de données, df, que nous avons créé à l'aide de la méthode head. Il est maintenant temps d'en savoir plus sur vos données. Les méthodes de Panda sont équipées d'un ensemble de méthodes mathématiques et statistiques courantes. Utilisons la méthode describe pour afficher les statistiques récapitulatives des données du bloc de données, puis explorons le résultat de la méthode describe. Nous constatons qu'il y a 260 observations ou produits alimentaires dans notre base de données. Nous constatons également qu'il existe neuf catégories uniques de produits alimentaires dans notre base de données. Nous pouvons également consulter des informations statistiques récapitulatives telles que la fréquence, la moyenne, la médiane, l'écart type, etc., pour les 260 produits alimentaires selon les différentes variables. Par exemple, la valeur maximale de la matière grasse totale est de 118. Examinons ces données de manière plus approfondie. Essayons de comprendre l'un des nutriments contenus dans les aliments, à savoir le sodium. Le sel de table est l'une des principales sources de sodium. L'Américain moyen mange cinq cuillères à café ou plus de sel par jour. C'est environ 20 fois ce dont le corps a besoin. Le sodium se trouve naturellement dans les aliments, mais une grande partie est ajoutée lors de la transformation et de la préparation. De nombreux aliments qui n'ont pas de goût salé peuvent tout de même contenir beaucoup de sodium. De grandes quantités de sodium peuvent être cachées dans des aliments en conserve, transformés et pratiques. Le sodium régule l'équilibre des fluides dans notre corps et maintient le volume sanguin et la tension artérielle. Une consommation excessive de sodium peut augmenter la tension artérielle et provoquer une rétention d'eau, ce qui peut entraîner un gonflement des jambes et des pieds ou d'autres problèmes de santé. Lorsque vous limitez le sodium dans votre alimentation, un objectif courant est de consommer moins de 2 000 milligrammes de sodium par jour. À présent, à l'aide de l'ensemble de données nutritionnelles de McDonald's, effectuons une analyse des données de base pour répondre à la question suivante : quel aliment a la teneur maximale en sodium ? Nous utilisons d'abord la visualisation pour explorer la teneur en sodium des aliments. À l'aide de la méthode du diagramme Swarm fournie par le package seaborne, nous créons un diagramme de dispersion catégoriel, comme illustré à droite. Indiquez ensuite comme catégorie d'entrée sur l'axe des X le sodium sur l'axe des Y et les données seront le cadre de données, df qui contient l'ensemble de données nutritionnelles de McDonald's. Le graphique montre les valeurs de sodium des différents produits alimentaires par catégorie. Notez une valeur élevée d'environ 3 600 pour le sodium sur le diagramme de dispersion. Nous aborderons les visualisations plus loin dans ce module. Explorons plus en détail cette teneur élevée en sodium et déterminons quels aliments du menu ont cette valeur en sodium. Faisons une analyse des données de base à l'aide de Python pour déterminer quels aliments du menu ont une teneur maximale en sodium. Pour vérifier les valeurs des niveaux de sodium dans les produits alimentaires de l'ensemble de données, nous utilisons le code indiqué dans le code 1. La méthode describe est utilisée pour comprendre les statistiques sommaires associées au sodium. Notez que la valeur maximale du sodium est fixée à 3600. Examinons maintenant plus en détail la ligne associée à la variable maximale en sodium, comme indiqué dans le code 2. Nous utilisons la méthode IDX max pour calculer les valeurs d'indice auxquelles la valeur maximale de sodium est obtenue dans la trame de données. Nous voyons que la sortie est de 82. Trouvons maintenant le nom de l'élément associé au 82e élément dans notre bloc de données, comme indiqué dans le code 3. Nous utiliserons la méthode dot at pour trouver le nom de l'élément en passant l'index 82 et l'élément du nom de colonne à renvoyer pour la 82e ligne. Enfin, nous constatons que l'aliment du menu qui contient le plus de sodium est le poulet McNuggets, 40 pièces. Les visualisations sont très utiles pour l'exploration initiale des données. Ils peuvent nous aider à comprendre les relations, les modèles et les valeurs aberrantes dans les données. Créons d'abord un diagramme de dispersion avec les protéines sur l'axe des X et le total des graisses sur l'axe des Y. Les diagrammes de dispersion sont des outils de visualisation très populaires qui montrent la relation entre deux variables avec un point pour chaque observation. Pour ce faire, nous pouvons utiliser la fonction de graphique conjoint fournie par le package Seaborne et donner comme entrée les protéines sur l'axe des X et les graisses totales sur l'axe des Y. Les données figureront dans le cadre de données, df, qui contient l'ensemble de données nutritionnelles de McDonald's. Le diagramme de dispersion des résultats est affiché sur le côté droit. L'intrigue a une forme intéressante. Il montre la corrélation entre les deux variables, les protéines et les graisses. La corrélation est une mesure de l'association entre deux variables et a une valeur comprise entre moins 1 et plus 1. Nous voyons que les points du diagramme de dispersion sont plus proches d'une ligne droite dans le sens positif. Nous avons donc une corrélation positive entre les deux variables. Dans le coin supérieur droit du diagramme de dispersion, nous avons les valeurs de la corrélation de Pearson 0,81 et la signification de la corrélation notée P, qui est une bonne valeur qui montre que les variables sont certainement corrélées. Le graphique montre également deux histogrammes, l'un en haut et l'autre sur le côté droit. L'histogramme du haut est celui de la variable protéine, et l'histogramme du côté droit est celui de la variable matière grasse totale. Nous remarquons également qu'il y a un point sur le diagramme de dispersion en dehors du schéma général. Il s'agit d'une exception possible. Voyons maintenant comment visualiser les données à l'aide de diagrammes à cases. Les diagrammes à cases sont des diagrammes qui indiquent la distribution d'une ou de plusieurs variables. L'encadré d'un diagramme à cases capture la moitié médiane des données. Les lignes et les points indiquent une éventuelle asymétrie et des valeurs aberrantes. Créons un diagramme à boîtes pour le sucre. La fonction que nous allons utiliser est le box plot du package Seaborne. Nous donnons le nom de colonne sucres en entrée à la fonction Box Plot. Le résultat est affiché sur le côté droit, où nous avons le diagramme à cases avec des valeurs moyennes de sucre dans les produits alimentaires d'environ 30 grammes. Nous remarquons également quelques valeurs aberrantes qui indiquent des produits alimentaires contenant des teneurs en sucre extrêmes. L' ensemble de données contient des produits alimentaires dont la teneur en sucre est d'environ 128 grammes. Les bonbons peuvent faire partie de ces aliments à haute teneur en sucre du menu. >> Intervenant 2 : Vous savez maintenant que SQLite 3 est une bibliothèque Python en cours de traitement qui implémente un moteur de base de données SQL transactionnel autonome sans configuration sans serveur. La fonction pandas.read_csv est utilisée pour lire le fichier csv de la base de données. La fonction de connexion SQLite 3 est utilisée pour se connecter à une base de données. Pour utiliser des pandas afin de récupérer des données à partir des tables de base de données, chargez les données à l'aide de la méthode read_sql et sélectionnez la requête SQL Select. Un diagramme de dispersion catégoriel est créé à l'aide de la méthode swarmplot () par le package seaborne. [MUSIQUE]

# Résumé : Accès aux bases de données avec PythonStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. À ce stade du cours, vous savez :

- Les commandes magiques sont des commandes spéciales qui offrent des fonctionnalités particulières.

- Les commandes magiques cellulaires sont des commandes préfixées par deux caractères %% et fonctionnent sur plusieurs lignes d'entrée.

- Les DB API sont des commandes préfixées par deux caractères %% et fonctionnant sur plusieurs lignes de saisie.

- Les deux principaux concepts de l'API DB de Python sont les objets de connexion et les objets de requête.

- Un curseur de base de données est une structure de contrôle qui permet de parcourir les enregistrements d'une base de données.

- Les méthodes Pandas sont dotées de méthodes mathématiques et statistiques courantes.

- La fonction pandas.read_csv est utilisée pour lire le fichier CSV de la base de données.

- La fonction SQLite3.connect est utilisée pour se connecter à une base de données.

- Pour utiliser pandas afin d'extraire des données des tables de la base de données, chargez les données à l'aide de la méthode read_sql et sélectionnez la requête SQL Select Query

- Un nuage de points catégoriel est créé à l'aide de la méthode swarmplot() du package seaborn.

# Connexion à une base de données à l'aide de l'API ibm_db

Bonjour, et bienvenue pour vous connecter à une base de données à l'aide de l'API ibm_db. Après avoir terminé cette leçon, vous serez en mesure de comprendre l'API ibm_db, ainsi que les informations d'identification requises pour vous connecter à une base de données en utilisant Python. Nous allons également montrer comment se connecter à une base de données IBM DB2 en utilisant du code Python écrit sur un ordinateur portable Jupyter. L' API ibm_db fournit une variété de fonctions Python utiles pour accéder et manipuler des données dans une base de données de serveur de données IBM, y compris des fonctions pour la connexion à une base de données, la préparation et l'émission d'instructions SQL, la récupération de lignes à partir de jeux de résultats, l'appel de procédures stockées, la validation et l'annulation des transactions, la gestion des erreurs et la récupération des métadonnées. L' API ibm_db utilise le pilote IBM Data Server pour ODBC et les API CLI pour se connecter à IBM, DB2 et Informix. Nous importons la bibliothèque ibm_db dans notre application Python. La connexion au DB2 nécessite les informations suivantes : un nom de pilote, un nom de base de données, un nom DNS hôte ou une adresse IP, un port hôte, un protocole de connexion, un ID utilisateur et un mot de passe utilisateur. Voici un exemple de création d'une connexion de base de données DB2 en Python. Nous créons un objet de connexion DSN, qui stocke les informations d'identification de connexion. La fonction connect de l'API ibm_db sera utilisée pour créer une connexion non persistante. L' objet DSN est transmis en tant que paramètre à la fonction de connexion. Si une connexion a été établie avec la base de données, le code retourne connecté, comme la sortie sinon, la sortie ne pourra pas se connecter à la base de données. Ensuite, nous libérons toutes les ressources en fermant la connexion. Rappelez-vous qu'il est toujours important de fermer les connexions afin d'éviter que les connexions inutilisées ne prennent des ressources. Merci d'avoir regardé cette vidéo.

il y'a eu des lab pratique notamment DB0201EN....Connecting

# Création de tables, chargement de données et interrogation de données

Bonjour, et bienvenue pour créer des tables, charger des données et interroger des données. Après avoir terminé cette leçon, vous serez en mesure de comprendre les concepts de base liés à la création de tables, au chargement de données et à l'interrogation de données à l'aide de Python, ainsi que de montrer un exemple de la façon d'effectuer ces tâches à l'aide de la base de données IBM DB2 on Cloud et des ordinateurs portables Jupyter. Pour cet exemple, nous utiliserons DB2 comme base de données. Nous obtenons d'abord une ressource de connexion en se connectant à la base de données en utilisant la méthode connect de l'API ibm_db. Il existe différentes façons de créer des tables dans DB2. L' une utilise la console Web fournie par DB2 et l'autre option consiste à créer des tables à partir de n'importe quel environnement SQL, R ou Python. Jetons un coup d'oeil à la façon de créer des tables dans DB2 à partir de notre application Python. Voici un exemple de tableau d'une base de données de camions commerciaux. Voyons comment nous pouvons créer la table Trucks dans le DB2 en utilisant le code Python. Pour créer une table, nous utilisons la fonction ibm_db.exec_immediate. Les paramètres de la fonction sont la connexion, qui est une ressource de connexion de base de données valide qui est renvoyée à partir de l'instruction de fonction ibm_db.connect ou ibm_db.pconnect, qui est une chaîne contenant l'instruction SQL, et des options qui est un paramètre facultatif qui inclut un qui spécifie le type de curseur à renvoyer pour les jeux de résultats. Voici le code pour créer une table appelée Trucks en Python. Nous utilisons la fonction ibm_db.exec_immediate de l'api ibm_db. La ressource de connexion créée est passée en tant que premier paramètre à cette fonction. Le paramètre suivant est l'instruction SQL, qui est la requête Créer une table utilisée pour créer la table Trucks. La nouvelle table créée aura cinq colonnes, serial_no sera la clé primaire. Maintenant, jetons un coup d'oeil au chargement des données. Nous utilisons la fonction ibm_db.exec_immediate de l'api ibm_db. La ressource de connexion créée est passée en tant que premier paramètre à cette fonction. Le paramètre suivant est l'instruction SQL, qui est l'insertion dans la requête utilisée pour insérer des données dans la table Trucks. Une nouvelle ligne sera ajoutée à la table Trucks. De même, nous ajoutons d'autres lignes à la table Trucks en utilisant la fonction ibm_db.exec_immediate. Maintenant que votre code Python a été connecté à une instance de base de données et que la table de base de données a été créée et remplie avec des données, voyons comment nous pouvons récupérer des données de la table Trucks que nous avons créée sur DB2 en utilisant du code Python. Nous utilisons la fonction ibm_db.exec_immediate de l'api ibm_db. La ressource de connexion créée est passée en tant que premier paramètre à cette fonction. Le paramètre suivant est l'instruction SQL, qui est la requête select from table. Le code Python renvoie la sortie, qui affiche les champs des données dans la table Trucks. Vous pouvez vérifier si la sortie renvoyée par la requête select affichée est correcte, en vous référant à la console DB2. Regardons comment nous pouvons utiliser les pandas pour récupérer des données des tables de base de données. Pandas est une bibliothèque Python populaire qui contient des structures de données de haut niveau et des outils de manipulation conçus pour rendre l'analyse des données rapide et facile en Python. Nous chargeons les données de la table Trucks dans un bloc de données appelé DF. Un bloc de données représente une structure de données tabulaire semblable à une feuille de calcul contenant une collection ordonnée de colonnes, dont chacune peut être un type de valeur différent. Merci de regarder cette vidéo.

# SEMAINE 5

# Travailler avec des ensembles de données réelles

[MUSIQUE] Bonjour et bienvenue. Dans cette vidéo, nous vous donnerons quelques conseils et astuces pour travailler avec des ensembles de données du monde réel. Ce que tu vas apprendre. À la fin de cette vidéo, vous pourrez discuter du format des données dans les bases de données. Expliquez comment charger des données dans des bases de données. De nombreux ensembles de données du monde réel sont disponibles sous forme de fichiers CSV. Il s'agit de fichiers texte qui contiennent des valeurs de données généralement séparées par des virgules. Dans certains cas, un séparateur différent, tel qu'un point-virgule, peut être utilisé. Pour cette vidéo, nous allons utiliser un exemple de fichier appelé DOGS.csv. Bien qu'il s'agisse d'un ensemble de données fictif contenant les noms des chiens et de leurs races, nous l'utiliserons pour illustrer des concepts que vous appliquerez ensuite à des ensembles de données réels.
Lisez la vidéo à partir de ::54 et suivez la transcription0:54
Un exemple de contenu du fichier DOGS.csv est présenté ici. Dans de nombreux cas, la première ligne du tableau contient des étiquettes d'attributs qui correspondent aux noms de colonnes d'un tableau. Dans DOGS.csv, la première ligne contient les noms de trois attributs. ID est le nom du premier attribut et les lignes suivantes contiennent les valeurs d'ID 1, 2 et 3. Le nom du chien est le deuxième attribut. Dans ce cas, il a les valeurs Wolfie, Fluffy et Huggy, et le troisième attribut est appelé race, race dominante, sinon une race pure, il a des valeurs allemandes, bergères, poméraniennes et labradoriennes. Comme nous l'avons vu dans le fichier DOGS.csv, les fichiers CSV peuvent avoir la première ligne d'en-tête ou une ligne d'en-tête contenant les noms des attributs. Si vous chargez les données dans des bases de données à l'aide de l'outil phpMyAdmin lors de l'importation du fichier CSV dans votre base de données, naviguez jusqu'au fichier pour le télécharger.
Lisez la vidéo à partir de :1:56 et suivez la transcription1:56
Ensuite, sélectionnez CSV dans la liste déroulante de la section Format.
Lisez la vidéo à partir de :2:2 et suivez la transcription2:02
Cela générera une section intitulée Options spécifiques au format.
Lisez la vidéo à partir de :2:7 et suivez la transcription2:07
En bas, vous verrez une case à cocher indiquant que la première ligne du fichier contient les noms des colonnes du tableau. Pour un fichier CSV avec en-têtes, vous pouvez cocher cette case avant de cliquer sur le bouton OK. MySQL détectera automatiquement les noms d'en-tête en tant que noms de colonnes et traitera , créera et insérera des instructions appropriées pour renseigner les données de la table. Le nom par défaut de la table est conservé comme nom du fichier en minuscules. Comme le montre l'exemple présenté, les noms de colonnes peuvent souvent comporter des espaces et, éventuellement, des caractères spéciaux dans les noms de colonnes des données. Pour interroger de telles colonnes, il est souvent courant d'utiliser des backticks autour du nom de la colonne. Notez que l'utilisation de toute autre forme de guillemets, comme les guillemets simples ou doubles, ne fonctionnera pas avec les noms de colonnes. Si vous avez des requêtes très longues telles que des requêtes de jointure ou des requêtes imbriquées, il peut être utile de scinder la requête en plusieurs lignes pour une meilleure lisibilité. Dans les blocs-notes Python, vous pouvez utiliser la barre oblique inverse pour indiquer le passage à la ligne suivante, comme illustré dans cet exemple, en utilisant la magie des lignes. Vous pouvez obtenir une erreur si vous divisez la requête en plusieurs lignes dans un bloc-notes Python sans barre oblique inverse. Lorsque vous utilisez la magie cellulaire SQL, le contenu de la cellule est interprété comme un code SQL. Cela rend superflue l'utilisation d'une barre oblique inverse à la fin de chaque ligne. En Python, vous pouvez également interroger les tables d'une base de données à l'aide de la méthode read_sql de la bibliothèque Pandas. Cette fonction sera plus facile à utiliser si vous avez enregistré la requête dans une variable spécifique, par exemple query_statement. Dans ce cas, si votre requête contient des guillemets doubles, par exemple pour spécifier un nom de colonne avec des espaces ou des caractères spéciaux, vous pouvez différencier le guillemet en utilisant des guillemets simples pour la variable Python qui entoure la requête SQL et des guillemets doubles pour les noms de colonnes. Que faire si vous devez spécifier des guillemets simples dans la requête , par exemple pour spécifier une valeur dans la clause where ? Dans ce cas, vous pouvez utiliser une barre oblique inverse comme caractère d'échappement avant la citation. Comment limiteriez-vous le nombre de lignes récupérées ? Un tableau peut contenir des milliers ou des millions de lignes, mais il se peut que vous souhaitiez simplement échantillonner un échantillon de données ou examiner quelques lignes seulement pour voir quel type de données le tableau contient. Vous pourriez être tenté de simplement sélectionner une étoile dans le nom de la table pour récupérer les résultats dans le bloc de données d'un panda et faire une tête dessus. Toutefois, l'exécution d'une requête peut prendre un certain temps. Au lieu de cela, vous pouvez restreindre les résultats définis à l'aide de la clause LIMIT. Par exemple, utilisez la requête suivante pour récupérer uniquement les trois premières lignes d' une table appelée données de recensement, sélectionnez un astérisque dans census_data LIMIT 3. Vous savez maintenant que les ensembles de données sont essentiellement des fichiers CSV, qui sont des fichiers texte contenant des valeurs de données séparées par des virgules.
Lisez la vidéo à partir de :5:14 et suivez la transcription5:14
Utilisez l'instruction de l'outil phpMyAdmin pour charger des données dans la base de données. Pour interroger les colonnes d'une table, des backticks sont utilisés autour du nom de la colonne. Évitez d'utiliser des guillemets simples ou doubles. Les requêtes longues, les requêtes de jointure ou les requêtes imbriquées doivent être divisées en plusieurs lignes pour une meilleure lisibilité. En Python, les tables peuvent être interrogées dans la base de données à l'aide de la méthode read_sql de la bibliothèque Pandas. Utilisez la clause LIMIT pour restreindre le jeu de résultats.

# Obtenir des détails sur les tableaux et les colonnes

Bonjour et bienvenue. Dans cette vidéo, nous verrons comment obtenir des informations sur les tables et leurs colonnes dans une base de données. Ce que vous apprendrez à la fin de cette vidéo, vous pourrez, expliquer comment obtenir une liste de tables dans une base de données, expliquer comment obtenir une liste de tables dans une base de données SQLite3. Maintenant, comment obtenir une liste des tables de la base de données ? Il arrive que votre base de données contienne plusieurs tables et que vous ne vous souveniez pas du nom correct. Par exemple, vous vous demandez peut-être si la table s'appelle chien, chiens ou mammifères à quatre pattes. Les systèmes de base de données contiennent généralement des tables système ou de catalogue à partir desquelles vous pouvez interroger la liste des tables et obtenir leurs propriétés. Dans DB2, ce catalogue s'appelle SYSCAT.TABLES, dans SQL Server, c'est Information_schema.tables, dans SQLite3, c'est sqlite_master, et dans MySQL, c'est SHOW TABLES. Pour obtenir la liste des tables d'une base de données SQLite3, vous pouvez exécuter la requête suivante. SÉLECTIONNEZ LE NOM DEPUIS sqlite_master OÙ type='table'. La même chose peut être faite dans une interface MySQL à l'aide de l'instruction SHOW TABLES. Pour extraire les attributs ou les en-têtes de colonnes des tables du jeu de données, vous pouvez utiliser des commandes spécifiques dans chaque type de serveur. Par exemple, dans SQLite3, vous pouvez utiliser la commande PRAGMS table_info. Dans MySQL, la commande DESCRIBE table_name peut être utilisée à cet effet. Sachez que les systèmes de base de données contiennent généralement des tables système ou des tables de catalogue à partir desquelles vous pouvez interroger la liste des tables et obtenir leurs propriétés. Pour obtenir une liste des tables de la base de données SQLite3, utilisez SELECT name FROM sqlite_master WHERE type="table ». Pour extraire les attributs dans SQLite3, utilisez PRAGMA table_info (table_name).

Félicitations pour avoir terminé ce cours Bases de données et SQL pour la science des données avec Python ! Nous espérons que vous l'avez apprécié. 
 
Ce cours fait partie de :

* IBM Data Analyst Professional Certificate (certificat professionnel d'analyste de données IBM)

* Spécialisation en science des données appliquée

* IBM Data Science Professional Certificate (Certificat professionnel en science des données)

* IBM Data Engineering Foundations Specialization (spécialisation en ingénierie des données IBM)

* Certificat professionnel IBM Data Engineering
 (à venir)

Ceux d'entre vous qui suivent la filière Data Engineering doivent également suivre le module Honors de ce cours. Il contient des informations sur des techniques SQL plus avancées qui vous seront utiles en tant qu'ingénieur de données.
 
Dans une prochaine étape, vous pouvez explorer d'autres cours dans ces programmes, en commençant par : 

Ingénierie des données et Analyse des données : 
Analyse de données avec Python

Parcours Ingénierie des données : NoSQL Fundamentals (Prochainement...)

Nous vous encourageons à laisser vos commentaires et à évaluer le cours.

Nous vous souhaitons bonne chance !

# À propos de ce module d'honneur Statut :

Ce module couvre certaines techniques SQL avancées qui seront utiles aux ingénieurs de données. Si vous suivez la filière Data Engineering, vousdevezsuivre ce module.

Ce module est optionnel pour ceux d'entre vous qui suivent les filières Data Science ou Data Analyst. Si vous choisissez de le compléter, vous recevrez un certificat de niveau Honors.

Dans ce module, vous apprendrez à formuler des requêtes plus puissantes en utilisant des techniques avancées telles que les vues, les transactions, les procédures stockées et les jointures.

 # SEMAINE 6 (LA DERNIERE)

# Points de vue

Bienvenue chez Views. Après avoir visionné cette vidéo, vous serez en mesure de : Définir une vue Décrire quand utiliser une vue Expliquer la syntaxe de création d' une vue Une vue est une autre façon de représenter des données qui existent dans une ou plusieurs tables ou vues. Une vue peut inclure la totalité ou une partie des colonnes d'une ou de plusieurs tables de base ou de vues existantes. La création d'une vue crée une spécification nommée pour une table de résultats, qui peut être interrogée de la même manière qu'une table. Vous pouvez également modifier les données de la table de base en exécutant des requêtes d'insertion, de mise à jour et de suppression sur la vue. Lorsque vous définissez une vue, la définition de la vue est enregistrée. Les données représentées par la vue sont stockées dans les tables de base, et non dans la vue elle-même. Vous pouvez utiliser une vue pour : afficher une sélection de données pour une table donnée, afin d'omettre des données sensibles telles que les informations fiscales, les dates de naissance ou les salaires. Combinez deux ou plusieurs tables de manière significative. Simplifiez l'accès aux données en accordant l'accès à une vue sans accorder l'accès aux tables sous-jacentes. Afficher uniquement les parties des données pertinentes pour le processus qui utilise la vue. Par exemple, vous pouvez créer une vue qui affiche uniquement les données non sensibles de la table Employés, à savoir l'identifiant de l'employé, le nom, l'adresse, l'identifiant du poste, l'identifiant du responsable et l'identifiant du service. La vue n'affiche pas de données sensibles telles que le salaire ou la date de naissance. Vous utilisez l'instruction CREATE VIEW pour créer une vue basée sur une ou plusieurs tables ou vues. Pour définir une vue, utilisez l'instruction CREATE VIEW et attribuez un nom (128 caractères maximum ) à la vue. Répertoriez les colonnes que vous souhaitez inclure. Vous pouvez utiliser un alias pour nommer les colonnes si vous le souhaitez. Utilisez la clause AS SELECT pour spécifier les colonnes de la vue, et la clause FROM pour spécifier le nom de la table de base. Vous pouvez également ajouter une clause WHERE facultative pour affiner les lignes de la vue. Cette instruction CREATE VIEW <click>crée une vue appelée EMPINFO basée sur la table Employees. L'instruction SELECT renvoie les données de la vue, comme indiqué dans le tableau ci-dessous. Les vues sont dynamiques ; elles se composent des données qui seraient renvoyées par l'instruction SELECT utilisée pour les créer. Lorsque vous utilisez une vue dans une autre instruction SQL, elle se comporte comme si vous aviez utilisé une instruction SELECT qui renvoie le contenu de la vue. L'instruction SELECT que vous utilisez pour créer la vue peut nommer d'autres vues et tables, et elle peut utiliser les clauses WHERE, GROUP BY et HAVING. Il ne peut pas utiliser la clause ORDER BY ni nommer une variable hôte.
Lisez la vidéo à partir de :2:54 et suivez la transcription2:54
Dans cet exemple, la vue EMPINFO est créée avec uniquement les lignes dont le MANAGER_ID est 30002. Vous pouvez utiliser une instruction SELECT pour afficher les informations de la vue et vérifier que seules les lignes dont le MANAGER_ID est 30002 sont incluses. Si vous devez supprimer complètement une vue, <click>vous pouvez utiliser DROP VIEW. Dans cette vidéo, vous avez appris que : les vues constituent un autre moyen d'accéder aux données des tableaux. Ils peuvent inclure des colonnes spécifiques provenant de plusieurs tables de base et de vues existantes. Une fois créées, les vues peuvent être interrogées comme une table, et les données de la table de base peuvent être modifiées par le biais de la vue. Les vues sont dynamiques ; seule la définition de la vue est stockée, pas les données. Vous pouvez utiliser l'instruction CREATE VIEW pour créer une vue basée sur une ou plusieurs tables ou vues existantes.

 # laboratoire pratique

# view

Hands-on Lab: Using Views in MySQL using phpMyAdmin
cognitiveclass.ai logo

Estimated time needed: 20 minutes

In this lab, you will learn about using views. In SQL, a view is an alternative way of representing data that exists in one or more tables. Just like a real table, it contains rows and columns. The fields in a view are fields from one or more real tables in the database. Though views can be queried like a table, views are dynamic; only the definition of the view is stored, not the data.

Objectives
After completing this lab, you will be able to:

* Create a View and show a selection of data for a given table
* Update a View to combine two or more tables in meaningful ways
* Drop a created View

* Créer une vue et afficher une sélection de données pour une table donnée
* Mettre à jour une vue pour combiner deux tables ou plus de manière significative
* Déposer une vue créée

Software Used in this Lab
In this lab, you will use MySQL. MySQL is a Relational Database Management System (RDBMS) designed to efficiently store, manipulate, and retrieve data.

# Base de données utilisée dans cet atelier

La base de données utilisée dans cet atelier est un exemple de base de données RH. Ce schéma de base de données HR se compose de cinq tables appelées EMPLOYÉS, JOB_HISTORY, EMPLOIS, SERVICES et EMPLACEMENTS. Chaque table comporte quelques lignes d’exemples de données. Le diagramme suivant montre les tables de la base de données RH :

Suivez les étapes ci-dessous pour créer la base de données et les tables.

- Ouvrez l’interface MySQL à partir du menu Réseau de compétences.

- Créez une nouvelle base de données et nommez-la RH.

- Chargez et exécutez le script partagé dans le lien ci-dessous pour créer les tables nécessaires.

[HR_Database_Create_Tables_Script.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week2/HR_Database_Create_Tables_Script.sql)

Load all the tables with the data available in the CSV files shared below.

[Départments.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/HR_Database/Departments.csv)

[Employees.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week2/data/Employees_updated.csv)

[Jobs.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/HR_Database/Jobs.csv)

[Locations.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/HR_Database/Locations.csv)

[JobsHistory.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week2/data/JobsHistory.csv)

Note: Please refer to the instruction in the lab "Create and Load Tables using SQL Scripts" for instructions regarding loading scripts in MySQL.

Task 1: Create a View
In this exercise, you will create a View and show a selection of data for a given table.

1. ###   Let's create a view called EMPSALARY to display salary along with some basic sensitive data of employees from the HR database. To create the EMPSALARY view from the EMPLOYEES table, Copy the code below and paste it to the textarea of the SQL page. Click Go.

In [ ]:
CREATE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;

2. ### Using SELECT, query the EMPSALARY view to retrieve all the records. Use the following statement.

In [ ]:
SELECT * FROM EMPSALARY;

# Task 2: Update a View
In this exercise, you will update a View to combine two or more tables in meaningful ways.

Assume that the EMPSALARY view we created in Task 1 doesn't contain enough salary information, such as max/min salary and the job title of the employees. For this, we need to getr information from other tables in the database. You need all columns from EMPLOYEES table used above, except for SALARY. You also need the columns JOB_TITLE, MIN_SALARY, MAX_SALARY of the JOBS table.
The command to be used is as follows:
    
    
    
Dans cet exercice, vous allez mettre à jour une vue pour combiner deux tables ou plus de manière significative.

Supposons que la vue EMPSALARY que nous avons créée dans la tâche 1 ne contient pas suffisamment d’informations sur le salaire, telles que le salaire max/min et l’intitulé du poste des employés. Pour cela, nous avons besoin d’obtenir des informations provenant d’autres tables de la base de données. Vous avez besoin de toutes les colonnes de la table EMPLOYEES utilisée ci-dessus, à l’exception de SALAIRE. Vous avez également besoin des colonnes JOB_TITLE, MIN_SALARY MAX_SALARY de la table JOBS.
La commande à utiliser est la suivante :

In [ ]:
CREATE OR REPLACE VIEW EMPSALARY AS
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE,
MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;

REMARQUE : La technique utilisée ici pour combiner les données de deux tables est appelée jointure interne implicite. Vous en apprendrez plus sur les jointures plus tard. Pour l’instant, supposons simplement que vous combinez les données de deux tables différentes, EMPLOYEES et JOBS, en connectant leurs colonnes respectives JOB_ID et JOB_IDENT, car les deux colonnes contiennent des données uniques communes. Vous pouvez consulter la description de la base de données, partagée au début de l’atelier, pour le vérifier.

2. ### À l’aide de SELECT, interrogez la vue EMPSALARY mise à jour pour récupérer tous les enregistrements. Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.


Using SELECT, query the updated EMPSALARY view to retrieve all the records. Copy the code below and paste it to the textarea of the SQL page. Click Go.

In [ ]:
SELECT * FROM EMPSALARY;

# Task 3: Drop a View
In this exercise, you will drop the created View EMPSALARY.
Use the code below.

In [ ]:
DROP VIEW EMPSALARY;

Using SELECT, you can verify whether the EMPSALARY view has been deleted or not. Copy the code below and paste it to the textarea of the SQL page. Click Go.

À l’aide de SELECT, vous pouvez vérifier si la vue EMPSALARY a été supprimée ou non. Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
SELECT * FROM EMPSALARY;

CAR, on a supprimé cette table

Erreur
Requête SQL : Copier Documentation


SELECT * FROM EMPSALARY LIMIT 0, 25
MySQL a répondu : Documentation

#1146 - La table 'HR.EMPSALARY' n'existe pas

#  Practice Problems
Try to solve the following practice problems based on your learning in this lab.

1. ###  Create a view “EMP_DEPT” which has the following information.
EMP_ID, FNAME, LNAME and DEP_ID from EMPLOYEES table

In [ ]:
CREATE VIEW EMP_DEPT AS
SELECT EMP_ID, F_NAME, L_NAME, DEP_ID
FROM EMPLOYEES;

2. ### Modify “EMP_DEPT” such that it displays Department names instead of Department IDs. For this, we need to combine information from EMPLOYEES and DEPARTMENTS as follows.





Modifiez « EMP_DEPT » de manière à ce qu’il affiche les noms des départements au lieu des ID de département. Pour cela, nous devons combiner les informations des EMPLOYÉS et des DÉPARTEMENTS comme suit.

In [ ]:
EMP_ID, FNAME, LNAME from EMPLOYEES table and
DEP_NAME from DEPARTMENTS table, combined over the columns DEP_ID and DEPT_ID_DEP.

In [ ]:
CREATE OR REPLACE VIEW EMP_DEPT AS
SELECT EMP_ID, F_NAME, L_NAME, DEP_NAME
FROM EMPLOYEES, DEPARTMENTS
WHERE EMPLOYEES.DEP_ID = DEPARTMENTS.DEPT_ID_DEP;

3. ### Drop the view “EPM_DEPT”.

In [ ]:
DROP VIEW EMP_DEPT

In [ ]:
qd on interroge à nouveau la vue ou view on message d'erreur
SELECT * FROM EMP_DEPT

In [ ]:
Erreur
Requête SQL : Copier Documentation


SELECT * FROM `EMP_DEPT` LIMIT 0, 25
MySQL a répondu : Documentation

#1146 - La table 'HR.EMP_DEPT' n'existe pas

# Procédures stockées

Bienvenue sur Stored Procedures. Après avoir visionné cette vidéo, vous serez en mesure d'expliquer ce qu'est une procédure stockée, de répertorier les avantages de l'utilisation de procédures stockées et de décrire comment créer et utiliser une procédure stockée. Une procédure stockée est un ensemble d' instructions SQL stockées et exécutées sur le serveur de base de données. Au lieu d'envoyer plusieurs instructions SQL du client au serveur, vous les encapsulez dans une procédure stockée sur le serveur et vous envoyez une instruction depuis le client pour les exécuter. Vous pouvez écrire des procédures stockées dans de nombreux langages différents. Par exemple, pour DB 1 sur le cloud et DB 2, vous pouvez écrire en SQL, PL, PL/SQL, Java C ou dans d'autres langages. Ils peuvent accepter des informations sous forme de paramètres, exécuter, créer, lire, mettre à jour et supprimer des opérations Crud et renvoyer les résultats à l'application cliente. Les avantages des procédures stockées incluent la réduction du trafic réseau car un seul appel est nécessaire pour exécuter plusieurs instructions. Amélioration des performances car le traitement s'effectue sur le serveur où les données sont stockées et seul le résultat final est renvoyé au client. Réutilisation du code car plusieurs applications peuvent utiliser la même procédure stockée pour la même tâche. Renforcez la sécurité car A, vous n'avez pas besoin d'exposer toutes les informations de vos tables et colonnes aux développeurs côté client, et B, vous pouvez utiliser la logique côté serveur pour valider les données avant de les accepter dans le système. Souvenez-vous cependant que SQL n'est pas un langage de programmation à part entière. Vous ne devez pas essayer d'écrire toute votre logique métier dans vos procédures stockées. Voyons comment créer une procédure stockée dans SQL. Tout d'abord, vous utilisez l'instruction create procedure, en spécifiant le nom de la procédure et tous les paramètres qu'elle prendra. Dans cet exemple, la procédure de vente Update Underscore utilisera un numéro d'employé et une note qu'elle utilisera pour mettre à jour le salaire de l'employé d'un montant en fonction de son évaluation, puis vous déclarez la langue que vous utilisez. Vous joignez ensuite votre logique procédurale et vous commencez les instructions finales. Dans ce cas, accorder aux employés qui ont obtenu une note de 1 une augmentation de 10 % et à tous les autres une augmentation de 5 %. Notez que vous pouvez utiliser les informations transmises à la procédure, les paramètres, directement dans votre logique procédurale. De plus, étant donné que la procédure stockée va utiliser plusieurs instructions, il est prudent de modifier le délimiteur, le caractère qui marque la fin d'une instruction, avant de commencer à définir la procédure. Ici, il a été réglé sur le signe dollar sinus dollar. L'utilisation de ce signe délimiteur dollar sinus dollar dans le code marquera alors la fin des commandes de procédure.
Lisez la vidéo à partir de :2:58 et suivez la transcription2:58
Enfin, nous redéfinissons le séparateur en point-virgule lorsque nous avons terminé. Vous pouvez appeler des procédures stockées à partir de vos applications externes ou à partir d'instructions SQL dynamiques. Pour appeler la procédure stockée update _SAL que nous venons de créer, vous devez utiliser l'instruction d'appel avec le nom de la procédure stockée et transmettre les paramètres requis. Dans ce cas, l' identifiant de l'employé et la note attribuée à cet employé. Dans cette vidéo, vous apprendrez que les procédures stockées sont un ensemble d' instructions SQL qui s'exécutent sur le serveur. Les procédures stockées offrent de nombreux avantages par rapport à l'envoi d'instructions SQL au serveur. Vous pouvez utiliser des procédures stockées dans des instructions SQL dynamiques et dans des applications externes.

# Hands-on Lab: Stored Procedures

Temps estimé nécessaire : 20 minutes

Les procédures stockées en SQL sont un type d’objet de base de données qui vous permet d’encapsuler une série d’instructions SQL dans une seule routine. Ils sont stockés dans le dictionnaire de données de la base de données et peuvent être appelés à partir d’un programme d’application ou de l’interface de commande de la base de données. Les procédures stockées peuvent accepter des paramètres d’entrée et renvoyer plusieurs valeurs de paramètres de sortie. Ils peuvent également inclure des constructions de contrôle de flux telles que des boucles et des instructions conditionnelles. Pr stocké

Objectives
After completing this lab, you will be able to:

Create stored procedures
Execute stored procedures
Software Used in this Lab
In this lab, you will use MySQL. MySQL is a Relational Database Management System (RDBMS) designed to efficiently store, manipulate, and retrieve data.

Mysql_learners database has been used in this lab.

# Data Used in this Lab

The data used in this lab is internal data. You will be working on the PETSALE table.

Cet atelier nécessite que vous ayez la table PETSALE remplie avec des exemples de données sur l’interface phpadmin de mysql. Vous avez peut-être créé et renseigné une table PETSALE dans un atelier précédent.

Pour cet atelier, vous devez créer une base de données PETS dans l’interface phpMyAdmin. Téléchargez le script PETSALE-CREATE-v2.sql ci-dessous, téléchargez-le sur la console sous la base de données PETS. Lors de l’exécution, le script créera une nouvelle table PETSALE en supprimant toute table PETSALE précédente si elle existe, et la remplira avec les exemples de données requis.

[PETSALE-CREATE-v2.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week6/PETSALE-CREATE-v2.sql)

# Stored Procedure: Exercise 1
In this exercise, you will create and execute a stored procedure to read data from a table on mysql phpadmin using SQL.

1. ### You will create a stored procedure routine named RETRIEVE_ALL.
This RETRIEVE_ALL routine will contain an SQL query to retrieve all the records from the PETSALE table, so you don't need to write the same query over and over again. You just call the stored procedure routine to execute the query everytime.
To create the stored procedure routine, copy the code below and paste it to the textarea of the SQL page. Click Go.




Dans cet exercice, vous allez créer et exécuter une procédure stockée pour lire les données d’une table sur mysql phpadmin à l’aide de SQL.

1. ### Vous allez créer une routine de procédure stockée nommée RETRIEVE_ALL.
Cette routine RETRIEVE_ALL contiendra une requête SQL pour récupérer tous les enregistrements de la table PETSALE, de sorte que vous n’avez pas besoin d’écrire la même requête encore et encore. Il vous suffit d’appeler la routine de procédure stockée pour exécuter la requête à chaque fois.
Pour créer la routine de procédure stockée, copiez le code ci-dessous et collez-le

In [ ]:
DELIMITER //

CREATE PROCEDURE RETRIEVE_ALL()

BEGIN
   SELECT *  FROM PETSALE;
END //
DELIMITER ;

2. ### To call the RETRIEVE_ALL routine, open another SQL tab by clicking Open in new Tab

Pour appeler la routine RETRIEVE_ALL, ouvrez un autre onglet SQL en cliquant sur Ouvrir dans un nouvel onglet

Delete the default line which appears so that you will get a blank window.

Copy the code below and paste it to the textarea of the SQL page. Click Go.



Supprimez la ligne par défaut qui apparaît afin d’obtenir une fenêtre vide.

Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
CALL RETRIEVE_ALL;

3. ### You can view the created stored procedure routine RETRIEVE_ALL. On the left panel, expand the PETS database option and click on Procedures to view the procedure.


 ### Vous pouvez afficher la routine de procédure stockée créée RETRIEVE_ALL. Dans le panneau de gauche, développez l’option Base de données PETS et cliquez sur Procédures pour afficher la procédure.

4. ###  If you wish to drop the stored procedure routine RETRIEVE_ALL, copy the code below and paste it to the textarea of the SQL page. Click Go.
 
 
 ### Si vous souhaitez supprimer la routine de procédure stockée RETRIEVE_ALL, copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
DROP PROCEDURE RETRIEVE_ALL;

CALL RETRIEVE_ALL;

In [ ]:
Erreur
Requête SQL : Copier


CALL RETRIEVE_ALL
MySQL a répondu : Documentation

#1305 - PROCEDURE Mysql_Learners.RETRIEVE_ALL does not exist

# Stored Procedure: Exercise 2
In this exercise, you will create and execute a stored procedure to write/modify data in a table on MySQL using SQL.

You will create a stored procedure routine named UPDATE_SALEPRICE with parameters Animal_ID and Animal_Health.


Dans cet exercice, vous allez créer et exécuter une procédure stockée pour écrire/modifier des données dans une table sur MySQL à l’aide de SQL.

Vous allez créer une routine de procédure stockée nommée UPDATE_SALEPRICE avec les paramètres Animal_ID et Animal_Health.

- This UPDATE_SALEPRICE routine will contain SQL queries to update the sale price of the animals in the PETSALE table depending on their health conditions, BAD or WORSE.

- This procedure routine will take animal ID and health conditon as parameters which will be used to update the sale price of animal in the PETSALE table by an amount depending on their health condition. Suppose that:

    - For animal with ID XX having BAD health condition, the sale price will be reduced further by 25%.
     - For animal with ID YY having WORSE health condition, the sale price will be reduced further by 50%.
     - For animal with ID ZZ having other health condition, the sale price won't change.
- To create the stored procedure routine, copy the code below and paste it to the textarea of the SQL page. Click Go.

- Cette routine UPDATE_SALEPRICE contiendra des requêtes SQL pour mettre à jour le prix de vente des animaux dans la table PETSALE en fonction de leur état de santé, BAD ou WORSE.

- Cette routine de procédure prendra l’identification de l’animal et l’état de santé comme paramètres qui seront utilisés pour mettre à jour le prix de vente de l’animal dans le tableau PETSALE d’un montant en fonction de son état de santé. Supposons que :


     - Pour les animaux avec ID XX ayant un MAUVAIS état de santé, le prix de vente sera encore réduit de 25%.
     - Pour les animaux dont l’état de santé est PIRE que celui de l’ID YY, le prix de vente sera encore réduit de 50 %.
     - Pour les animaux dont l’ID ZZ a d’autres problèmes de santé, le prix de vente ne changera pas.
- Pour créer la routine de procédure stockée, copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
DELIMITER @
CREATE PROCEDURE UPDATE_SALEPRICE (IN Animal_ID INTEGER, IN Animal_Health VARCHAR(5))
BEGIN
    IF Animal_Health = 'BAD' THEN
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.25)
        WHERE ID = Animal_ID;
    ELSEIF Animal_Health = 'WORSE' THEN
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE - (SALEPRICE * 0.5)
        WHERE ID = Animal_ID;
    ELSE
        UPDATE PETSALE
        SET SALEPRICE = SALEPRICE
        WHERE ID = Animal_ID;
    END IF;
END @

DELIMITER ;

Salut @MAHI,

Merci pour votre réponse.

Veuillez noter que le prix de vente initial est de 450,09 $ et qu'après avoir mis à jour le prix de vente de l'animal avec l'ID 1 en raison de son MAUVAIS état de santé, la valeur diminue à 337,57.

Prix ​​de vente d'origine : 450,09

Selon la procédure, après mise à jour du prix de vente de l'animal avec ID 1 et MAUVAIS état de santé, la valeur doit être réduite de 25 %.

Calcul du prix de vente neuf :

Nouveau prix de vente = SALEPRICE - (SALEPRICE * 0,25)

= 450,09 - (450,09 * 0,25)

= 450,09 - 112,52

= 337,57 $

Nous vous demandons de bien vouloir procéder au laboratoire en suivant les instructions et d'observer la différence dans le prix de vente.

J'espère que cette explication vous aidera.

Bon apprentissage!

Salutations

Salut @MAHI,

Merci de votre publication.

Nous sommes heureux de vous assister.

Veuillez noter que ce script crée une procédure stockée nommée UPDATE_SALEPRICE dans une base de données. Voici une explication de ce qu'il fait :

* DELIMITER @ : Cette commande modifie le délimiteur utilisé pour terminer les instructions dans le script. Il définit le délimiteur sur @ au lieu de la valeur par défaut ;. Cela se produit souvent lors de la définition de procédures stockées, car elles contiennent plusieurs instructions SQL et le délimiteur régulier (;) mettrait fin prématurément à la définition de la procédure.

* CREATE PROCEDURE UPDATE_SALEPRICE (IN Animal_ID INTEGER, IN Animal_Health VARCHAR(5)) : Cette ligne définit la procédure stockée nommée UPDATE_SALEPRICE avec deux paramètres d'entrée : Animal_ID de type INTEGER et Animal_Health de type VARCHAR(5).

* BEGIN et END : Ces mots-clés marquent le début et la fin du corps de la procédure, qui contient les instructions SQL à exécuter.

* IF Animal_Health = 'BAD' ALORS : Cette ligne commence une instruction IF qui vérifie si la valeur de Animal_Health est 'BAD'.

* UPDATE PETSALE ... WHERE ID = Animal_ID; : ces instructions UPDATE modifient la colonne SALEPRICE de la table PETSALE en fonction de la valeur de Animal_Health :

  *      Si Animal_Health est « MAUVAIS », le SALEPRICE est diminué de 25 %.

  *      Si Animal_Health est « PIRE », le SALEPRICE est diminué de 50 %.

  *      Si Animal_Health n'est ni « MAUVAIS » ni « PIRE », aucune modification n'est apportée au SALEPRICE.

* END IF; : Cette ligne marque la fin de l'instruction IF.

* END @ : Cette ligne marque la fin de la définition de la procédure stockée à l'aide du délimiteur personnalisé @.

* DELIMITER ; : Cette ligne restaure le délimiteur par défaut (;) pour terminer les instructions.

Dans l'ensemble, cette procédure stockée met à jour le SALEPRICE d'un animal dans la table PETSALE en fonction de son état de santé (Animal_Health) et de l'Animal_ID fourni. Il applique différentes réductions sur le SALEPRICE en fonction de l'état de santé.

J'espère que cette explication vous aidera.

Bon apprentissage!

Salutations

Héma

1. ### Let's call the UPDATE_SALEPRICE routine. We want to update the sale price of animal with ID 1 having BAD health condition in the PETSALE table. open another SQL tab by clicking Open in new Tab

 ###  Appelons la UPDATE_SALEPRICE routine. Nous voulons mettre à jour le prix de vente de l’animal avec l’ID 1 ayant un MAUVAIS état de santé dans le tableau PETSALE. ouvrez un autre onglet SQL en cliquant sur Ouvrir dans un nouvel onglet

Supprimez la ligne par défaut qui apparaît afin d’obtenir une fenêtre vide.

Copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

Notez que si vous avez abandonné RETREIVE_ALL procédure, réexécutez le script de création de cette procédure avant d’exécuter ces lignes.

In [ ]:
   CALL RETRIEVE_ALL;

   CALL UPDATE_SALEPRICE(1, 'BAD');

   CALL RETRIEVE_ALL;

2. ### Let's call the UPDATE_SALEPRICE routine once again. We want to update the sale price of animal with ID 3 having WORSE health condition in the PETSALE table. copy the code below and paste it to the textarea of the SQL page. Click Go. You will have all the records retrieved from the PETSALE table.



 ### Appelons la UPDATE_SALEPRICE routine une fois de plus. Nous voulons mettre à jour le prix de vente de l’animal avec l’ID 3 ayant un état de santé PIRE dans le tableau PETSALE. copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK. Vous aurez tous les enregistrements récupérés à partir de la table PETSALE.

In [ ]:
   CALL RETRIEVE_ALL;

   CALL UPDATE_SALEPRICE(3, 'WORSE');

   CALL RETRIEVE_ALL;

Bonjour @MAHI,

merci pour le post.

Nous sommes heureux de pouvoir vous aider.

Veuillez noter que ces lignes de code sont des instructions SQL qui appellent des procédures stockées dans une base de données. Voici une explication de chaque ligne :

CALL RETRIEVE_ALL ; : Cette ligne appelle la procédure stockée nommée RETRIEVE_ALL. Il exécute la procédure, qui récupère probablement tous les enregistrements ou effectue une sorte d'opération de récupération de données dans la base de données. La fonctionnalité exacte dépend de la manière dont la procédure stockée RETRIEVE_ALL

 est implémentée. 
CALL UPDATE_SALEPRICE (3, 'WORSE') ; : Cette ligne appelle la procédure stockée nommée UPDATE_SALEPRICE avec deux arguments : 3 pour Animal_ID et « WORSE » pour Animal_Health. Il exécute la procédure qui met à jour le prix de vente d'un animal de compagnie dont l'identifiant Animal_ID est égal à 3 en fonction de l'état de santé « PIRE ». La procédure peut appliquer une logique ou des calculs spécifiques pour ajuster le prix de vente en conséquence.

 
CALL RETRIEVE_ALL ; : Cette ligne appelle à nouveau la procédure stockée nommée RETRIEVE_ALL, susceptible de récupérer tous les enregistrements ou d'effectuer une autre opération de récupération de données dans la base de données. Il est appelé après la mise à jour du prix de vente dans la ligne précédente, éventuellement pour vérifier les modifications apportées par la procédure UPDATE_SALEPRICE

Dans l'ensemble, ces lignes de code exécutent des procédures stockées dans la base de données pour récupérer des données et mettre à jour les prix de vente en fonction de certaines conditions.

Les champs surlignés indiquent la différence de prix de vente après la mise à jour du prix de vente d'un animal dont l'ID 3 présente un état de santé PIRE dans le tableau PETSALE.

J'espère que cette explication vous sera utile.

Bon apprentissage !

Cordialement

Vous pouvez afficher la routine de procédure stockée créée UPDATE_SALEPRICE. Cliquez sur les routines et affichez la procédure.

4. ### If you wish to drop the stored procedure routine UPDATE_SALEPRICE, copy the code below and paste it to the textarea of the SQL page. Click Go.

In [ ]:
DROP PROCEDURE UPDATE_SALEPRICE;
CALL UPDATE_SALEPRICE;
Copied!

In [ ]:
Erreur
Requête SQL : Copier


CALL UPDATE_SALEPRICE
MySQL a répondu : Documentation

#1305 - PROCEDURE Mysql_Learners.UPDATE_SALEPRICE does not exist

# Transactions ACID

Bienvenue sur ACID transactions. Après avoir visionné cette vidéo, vous serez en mesure de : Expliquer ce qu'est une transaction ACID Donnez un exemple de transaction ACID Décrire les validations et les annulations Une transaction est une unité de travail indivisible. Elle peut consister en une ou plusieurs instructions SQL, mais pour être considérée comme réussie, soit toutes ces instructions SQL doivent être exécutées correctement, laissant la base de données dans un nouvel état stable, soit aucune ne doit être terminée, laissant la base de données telle qu'elle était avant le début de la transaction. Par exemple, si vous effectuez un achat avec votre carte bancaire, de nombreuses choses doivent se produire : le produit doit être ajouté à votre panier Votre paiement doit être traité - Votre compte doit être débité du montant correct et le compte de la boutique crédité Le stock de ce produit doit être réduit du nombre acheté Examinons l'exemple plus en détail. Si Rose achète des bottes pour 200$, vous pouvez utiliser un relevé UPDATE pour réduire le solde de son compte. Et un autre relevé UDATE pour ajouter 200$ au solde de Shoe Shop. Et une dernière déclaration de mise à jour visant à réduire de 1 % le stock de bottes au magasin de chaussures. Si l'une de ces instructions UPDATE échoue, l'ensemble de la transaction doit échouer, afin de maintenir les données dans un état cohérent. Les types de transactions présentés dans cet exemple sont appelés transactions ACID. Atomic - Toutes les modifications doivent être effectuées avec succès ou pas du tout. Cohérence : les données doivent être dans un état cohérent avant et après la transaction. Isolé : aucun autre processus ne peut modifier les données pendant que la transaction est en cours d'exécution. Durable : les modifications apportées par la transaction doivent être conservées. Pour démarrer une transaction ACID, utilisez la commande BEGIN. Dans db2 on Cloud, cette commande est implicite. Toutes les commandes que vous émettez par la suite font partie de la transaction, jusqu'à ce que vous émettiez COMMIT ou ROLLBACK. Si toutes les commandes s'exécutent correctement, émettez une commande de validation pour enregistrer tous les éléments de la base de données dans un état constant et stable. Si l'une des commandes échoue (peut-être que le compte de Rose ne dispose pas de suffisamment d'argent pour effectuer le paiement), vous pouvez émettre une commande de restauration pour annuler toutes les modifications et laisser la base de données dans son état stable d'origine. Les instructions SQL peuvent être appelées à partir de langages tels que Java, C, R et Python. Cela nécessite l'utilisation d'API d'accès spécifiques à la base de données, telles que Java Database Connectivity (JDBC) pour Java ou d'un connecteur de base de données spécifique tel que ibm_db pour Python. La plupart des langages utilisent les commandes SQL EXEC pour lancer une commande SQL, notamment COMMIT et ROLLBACK, comme vous pouvez le voir dans cet exemple. N'oubliez pas que BEGIN est implicite, vous n'avez pas besoin de l'appeler explicitement. L'intégration de commandes SQL dans le code de votre application vous donne la possibilité de créer des routines de vérification des erreurs qui, à leur tour, contrôlent si la transaction est validée ou annulée. Dans cette vidéo, vous avez appris que : une transaction représente une unité de travail complète, qui peut être une ou plusieurs instructions SQL. Dans le cadre d'une transaction ACID, toutes les instructions SQL doivent être exécutées avec succès, voire aucune. Cela garantit que la base de données est toujours dans un état cohérent. ACID est l'abréviation de Atomic, Consistent, Isolated, Durable. Les commandes SQL BEGIN, COMMIT et ROLLBACK sont utilisées pour gérer les transactions ACID. Les commandes SQL peuvent être appelées à partir de langages tels que C, R et Python.

 # Hands-on Lab: Committing and Rolling Back a Transaction
 # Atelier pratique : Validation et annulation d’une transaction

Estimated time needed: 20 minutes

A transaction is simply a sequence of operations performed using one or more SQL statements as a single logical unit of work. A database transaction must be ACID (Atomic, Consistent, Isolated and Durable). The effects of all the SQL statements in a transaction can either be applied to the database using the COMMIT command or undone from the database using the ROLLBACK command.

In this lab, you will learn some commonly used TCL (Transaction Control Language) commands of SQL through the creation of a stored procedure routine. You will learn about COMMIT, which is used to permanently save the changes done in the transactions in a table, and about ROLLBACK, which is used to undo the transactions that have not been saved in a table. ROLLBACK can only be used to undo the changes in the current unit of work.

Temps estimé nécessaire : 20 minutes

Une transaction est simplement une séquence d’opérations effectuées à l’aide d’une ou plusieurs instructions SQL comme unité de travail logique unique. Une transaction de base de données doit être ACID (Atomic, Consistent, Isolated and Durable). Les effets de toutes les instructions SQL d’une transaction peuvent être appliqués à la base de données à l’aide de la commande COMMIT ou annulés de la base de données à l’aide de la commande ROLLBACK.

Dans cet atelier, vous allez apprendre certaines commandes TCL (Transaction Control Language) couramment utilisées de SQL grâce à la création d’une routine de procédure stockée. Vous en apprendrez plus sur COMMIT, qui est utilisé pour enregistrer de façon permanente les modifications apportées aux transactions d’une table, et sur ROLLBACK, qui est utilisé pour annuler les transactions qui n’ont pas été enregistrées dans une table. ROLLBACK ne peut être utilisé que pour annuler les modifications apportées à l’unité de travail en cours.

Objectives
After completing this lab, you will be able to:

Permanently save the changes done in a transaction
Undo the transaction that has not been saved
Software Used in this Lab
MySQL is a Relational Database Management System (RDBMS) designed to efficiently store, manipulate, and retrieve data.


To complete this lab you will utilize MySQL relational database service available as part of IBM Skills Network Labs (SN Labs) Cloud IDE. SN Labs is a virtual lab environment used in this course.

Database Used in this Lab
Mysql_learners database has been used in this lab.

#  Objectifs
À l’issue de cet atelier, vous serez en mesure de :

Enregistrer de façon permanente les modifications apportées à une transaction
Annuler la transaction qui n’a pas été enregistrée.


# Logiciels utilisés dans cet atelier
MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer efficacement des données.


Pour effectuer cet atelier, vous utiliserez le service de base de données relationnelle MySQL disponible dans le cadre de l’IDE cloud IBM Skills Network Labs (SN Labs). SN Labs est un environnement de laboratoire virtuel utilisé dans ce cours.

# Base de données utilisée dans cet atelier



Mysql_learners base de données a été utilisée dans cet atelier.

# Données utilisées dans cet atelier
Les données utilisées dans ce laboratoire sont des données internes. Vous travaillerez sur les tables BankAccounts et ShoeShop.

This lab requires you to have the BankAccounts and ShoeShop tables populated with sample data. Download the BankAccounts-CREATE.sql and ShoeShop-CREATE.sql scripts below, and load them to the phpMyAdmin console. The scripts will create new tables called BankAccounts and ShoeShop and populate them with the sample data required for this lab.

Cet atelier nécessite que les tables BankAccounts et ShoeShop soient renseignées avec des exemples de données. Téléchargez les scripts BankAccounts-CREATE.sql et ShoeShop-CREATE.sql ci-dessous, et chargez-les dans la console phpMyAdmin. Les scripts créent de nouvelles tables appelées BankAccounts et ShoeShop et les remplissent avec les exemples de données requis pour cet atelier.


[BankAccounts-CREATE.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week6/BankAccounts-CREATE.sql)



[ShoeShop-CREATE.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/MySQL/week6/ShoeShop-CREATE.sql)

 #  Sample Exercise
Example of committing and rolling back a transaction.

1. ### Scenario: Rose is buying a pair of boots from ShoeShop. So we have to update Rose's balance as well as the ShoeShop balance in the BankAccounts table. Then we also have to update Boots stock in the ShoeShop table. After Boots, let's also attempt to buy Rose a pair of Trainers.

 
Scénario : Rose achète une paire de bottes chez ShoeShop. Nous devons donc mettre à jour le solde de Rose ainsi que le solde de ShoeShop dans le tableau BankAccounts. Ensuite, nous devons également mettre à jour le stock de bottes dans le tableau ShoeShop. Après les bottes, essayons aussi d’acheter une paire de baskets à Rose.



- Once the tables are ready, create a stored procedure routine named TRANSACTION_ROSE that includes TCL commands like COMMIT and ROLLBACK.
Now develop the routine based on the given scenario to execute a transaction.
To create the stored procedure routine on MySQL, copy the code below and paste it to the textarea of the SQL page. Click Go.



- Une fois que les tables sont prêtes, créez une routine de procédure stockée nommée TRANSACTION_ROSE qui inclut des commandes TCL telles que COMMIT et ROLLBACK.
- Développez maintenant la routine en fonction du scénario donné pour exécuter une transaction.
- Pour créer la routine de procédure stockée sur MySQL, copiez le code ci-dessous et collez-le dans la zone de texte de la page SQL. Cliquez sur OK.

In [ ]:
DELIMITER //

CREATE PROCEDURE TRANSACTION_ROSE()
BEGIN
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        RESIGNAL;
    END;
    START TRANSACTION;
    UPDATE BankAccounts
    SET Balance = Balance-200
    WHERE AccountName = 'Rose';

    UPDATE BankAccounts
    SET Balance = Balance+200
    WHERE AccountName = 'Shoe Shop';

    UPDATE ShoeShop
    SET Stock = Stock-1
    WHERE Product = 'Boots';

    UPDATE BankAccounts
    SET Balance = Balance-300
    WHERE AccountName = 'Corner Shop';

    COMMIT;
END //

DELIMITER ;

3. ### Let's now check if the transaction can successfully be committed or not. Copy the code below in a new blank script and paste it to the textarea of the SQL page. Click Go

Vérifions maintenant si la transaction peut être validée avec succès ou non. Copiez le code ci-dessous dans un nouveau script vierge et collez-le dans la zone de texte de la page SQL. Cliquez sur OK

In [ ]:
CALL TRANSACTION_ROSE;

SELECT * FROM BankAccounts;

SELECT * FROM ShoeShop;

4. ### Observe that the transaction has been executed. But when we observe the tables, no changes have permanently been saved through COMMIT. All the possible changes happened might have been undone through ROLLBACK since the whole transaction fails due to the failure of a SQL statement or more. Let's go through the possible reason behind the failure of the transaction and how COMMIT - ROLLBACK works on a stored procedure:


   * The first three UPDATEs should run successfully. Both the balance of Rose and ShoeShop should have been updated in the BankAccounts table. The current balance of Rose should stand at 300 - 200 (price of a pair of Boots) = 100. The current balance of ShoeShop should stand at 124,200 + 200 = 124,400. The stock of Boots should also be updated in the ShoeShop table after the successful purchase for Rose, 11 - 1 = 10.
   
   
   * The last UPDATE statement tries to buy Rose a pair of Trainers, but her balance becomes insufficient (Current balance of Rose: 100 < Price of Trainers: 300) after buying a pair of Boots. So, the last UPDATE statement fails. Since the whole transaction fails if any of the SQL statements fail, the transaction won't be committed.
   
c'est l'insruction la ici elle va faire la transaction_ROSE échoué 
UPDATE BankAccounts
SET Balance = Balance-300
WHERE AccountName = 'Rose';


c'est pourquoi je l'ai remplacé (plus haut par) celle-ci pour que la transaction réussisse
UPDATE BankAccounts
    SET Balance = Balance-300
    WHERE AccountName = 'Corner Shop';

Bonjour @MAHI,

toutes mes excuses pour la gêne occasionnée !

Si vous examinez les scripts SQL, certaines contraintes n'autorisent pas la valeur des colonnes à être 0. Par conséquent, lors de l'exécution des transactions, si les valeurs d'attribut deviennent 0, vous obtenez cette erreur. Par exemple, dans TRANSACTION_ROSE, la dernière instruction de mise à jour indique :


UPDATE BankAccounts
SET Balance = Balance-300
WHERE AccountName = 'Rose';
Cela définit la valeur du solde à 0, ce qui est contraire à la contrainte. Nous la mettrons bientôt à jour. Toutefois, comme solution temporaire, vous pouvez modifier la dernière instruction de mise à jour de la transaction comme suit :


UPDATE BankAccounts
SET Balance = Balance-300
WHERE AccountName = 'Corner Shop';
J'espère que cela vous aidera

Bon apprentissage !

Cordialement

Hema

# Practice exercise 

Now let's practice an exercise on committing and rolling back a transaction.

Create a stored procedure TRANSACTION_JAMES to execute a transaction based on the following scenario: First buy James 4 pairs of Trainers from ShoeShop. Update his balance as well as the balance of ShoeShop. Also, update the stock of Trainers at ShoeShop. Then attempt to buy James a pair of Brogues from ShoeShop. If any of the UPDATE statements fail, the whole transaction fails. You will roll back the transaction. Commit the transaction only if the whole transaction is successful.

Use the previous code from Task A Step 2 and modify it. Take 1200 (4 x 300) from James's balance and add 1200 to the ShoeShop balance. Take 4 trainers out of the stock in ShoeShop. Then take 150 from James's balance.

In [ ]:
DELIMITER //

CREATE PROCEDURE TRANSACTION_JAMES()

BEGIN
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        RESIGNAL;
    END;

    START TRANSACTION;

    UPDATE BankAccounts
    SET Balance = Balance-1200
    WHERE AccountName = 'James';

    UPDATE BankAccounts
    SET Balance = Balance+1200
    WHERE AccountName = 'Shoe Shop';

    UPDATE ShoeShop
    SET Stock = Stock-4
    WHERE Product = 'Trainers';

    UPDATE BankAccounts
    SET Balance = Balance-150
    WHERE AccountName = 'James';

    COMMIT;

END //

DELIMITER ;

In [ ]:
3. ###

MEME LABORATOIRE PRATIQUE SUR VIEW, procédures stockées, transaction ACID  à l'aide  IBM Db2 ON CLOUD, j'ai téléchargé les pdf sur le dossier video certif IBM

Résumé : vues, procédures stockées et transactionsStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. A ce stade du cours, vous savez :

Une transaction représente une unité de travail complète, qui peut être une ou plusieurs instructions SQL.

Une transaction ACID est une transaction dans laquelle toutes les instructions SQL doivent être exécutées avec succès, ou aucune.

Une procédure stockée est un ensemble d'instructions SQL stockées et exécutées sur le serveur de base de données, ce qui vous permet d'envoyer une seule instruction au lieu de plusieurs.

Vous pouvez écrire des procédures stockées dans de nombreux langages différents, tels que SQL PL, PL/SQL, Java et C.

# Vue d'ensemble de l'adhésion

Bonjour et bienvenue sur Join Overview. Après avoir visionné cette vidéo, vous serez en mesure de : Définir l'opérateur de jointure Expliquer le rôle des clés primaires et des clés étrangères dans une opération de jointure Répertorier les différents types d'opérateurs de jointure Une simple instruction Select extrait les données d'une ou de plusieurs colonnes d'une même table. Le niveau de complexité suivant consiste à récupérer les données de deux tables ou plus. Cela ouvre de multiples possibilités quant à la manière dont le jeu de résultats peut être généré. Pour combiner les données de deux tables, vous utilisez l'opérateur JOIN. Un JOIN combine les lignes de deux tables ou plus en fonction d'une relation entre certaines colonnes de ces tables. Dans cet exemple de base de données de bibliothèque simplifié, l'auteur et le livre sont des entités. Ce diagramme de relation entre entités représente le modèle de données relationnel pour l'auteur et l'entité du livre, ainsi que pour d'autres entités telles que l'emprunteur, le prêt, la copie et la liste des auteurs. Les informations sont réparties dans différents tableaux. Si vous voulez savoir quel emprunteur possède quel exemplaire d'un livre prêté, vous devez recueillir des données à partir de trois tableaux : le tableau de l'emprunteur, le tableau du prêt et le tableau des copies. C'est à ce moment que vous devez utiliser l'opérateur JOIN. Vous devez d'abord identifier la relation entre ces tables. C'est-à-dire la ou les colonnes de chaque table à utiliser comme lien entre les tables. Dans ce diagramme de relation entre les entités, notez que l'identifiant de l'auteur, le numéro du livre, l'identifiant de l'emprunteur et le numéro de copie comportent l'icône de la clé primaire. Une clé primaire identifie de manière unique chaque ligne d'un tableau. Notez également que les entités dans la partie inférieure de l'écran (certains attributs) ont FK entre crochets à côté d'elles. Cela identifie une clé étrangère, qui est un ensemble de colonnes faisant référence à la clé primaire d'une autre entité. Par exemple, l'entité de prêt possède l' attribut d'identification de l'emprunteur avec le FK entre crochets. Dans cet exemple, l'attribut d'identifiant de l'emprunteur est la clé étrangère de l'entité de prêt, qui fait référence à la clé primaire de l'entité emprunteuse. Donc, si vous voulez savoir quel emprunteur a un livre prêté, vous devez recueillir des données à partir des tableaux des emprunteurs et des prêts. Vous aurez besoin de l'identifiant de l'emprunteur indiqué dans les deux tableaux. Jusqu'à présent, vous avez vu un exemple de combinaison de deux tables. Mais que se passe-t-il si vous devez combiner les données de trois tables différentes ou plus ? Il vous suffit d'ajouter de nouvelles tables aux jointures. Par exemple, si vous voulez savoir quels emprunteurs ont un livre prêté et quel exemplaire du livre ils ont prêté, vous devez d'abord joindre les informations du tableau des emprunteurs et du tableau des prêts en faisant correspondre les identifiants des emprunteurs. Ensuite, vous joignez les informations de la table des prêts et de la table de copie en faisant correspondre les identifiants de copie. SQL vous propose différents types de JOINs. Vous pouvez extraire un ensemble de données correspondant à l' intersection des deux tables concernées, ou vous pouvez choisir un ensemble de données plus important. Vous pouvez aller jusqu'à sélectionner la combinaison de toutes les données de ces deux tables. Le type de jointure le plus courant est une jointure interne, qui affiche uniquement les lignes de deux tables dont la valeur correspond dans une colonne commune, généralement la clé primaire d'une table qui existe en tant que clé étrangère dans la deuxième table. Il existe également des jointures externes, qui renvoient les lignes correspondantes, et même les lignes de l'une ou l'autre table qui ne correspondent pas. Il existe de nombreuses variantes de jointure externe que vous pouvez utiliser pour affiner votre jeu de résultats. Dans cette vidéo, vous avez appris que : vous pouvez utiliser l'opérateur JOIN pour combiner des lignes provenant de deux tables ou plus. Les tables jointes sont liées par une colonne commune, qui est généralement la clé primaire d'une table et apparaît sous forme de clé étrangère dans l'autre table. Il existe deux types de jointures : les jointures internes et les jointures externes.
fr
​

# Jointure interne

Bienvenue chez Inner Join. Après avoir visionné cette vidéo, vous serez capable de : Décrire les jointures internes Expliquer quand utiliser une jointure interne Décrire la syntaxe de l'instruction INNER
Lisez la vidéo à partir de ::20 et suivez la transcription0:20
JOIN Une opération de jointure combine les lignes de deux tables ou plus en fonction d'une relation entre certaines colonnes de ces tables. Il existe deux types de jointures de table : les jointures internes et les jointures externes. Le type de jointure le plus courant est une jointure interne, qui affiche uniquement les lignes de deux tables dont la valeur correspond dans une colonne commune, généralement la clé primaire d'une table qui existe en tant que clé étrangère dans la deuxième table. Il s'agit de la syntaxe de l'instruction select pour une jointure interne. Imaginons que vous souhaitiez récupérer une liste de toutes les personnes qui empruntent des livres, ainsi que la date du prêt. Vous avez besoin des données de la table des emprunteurs et de la table des prêts. Dans la clause FROM, vous spécifiez la jointure entre la table des emprunteurs et la table des prêts sous la forme BORROWER INNER JOIN LOAN. Vous identifiez la table des emprunteurs comme B et la table des prêts comme L. La table spécifiée à gauche de la clause JOIN est connue sous le nom de table de gauche. Dans ce cas, la table des emprunteurs est la table de gauche. Pour cette adhésion, vous sélectionnez l'identifiant de l'emprunteur, le nom de famille et le pays dans le tableau des emprunteurs, et l'identifiant de l'emprunteur et la date du prêt dans le tableau des prêts. Dans la clause ON, vous spécifiez le prédicat JOIN, dans ce cas, à condition que l'identifiant de l'emprunteur dans la table des emprunteurs soit égal à l'identifiant de l'emprunteur dans la table des prêts. Notez que dans cette jointure, chaque nom de colonne est préfixé par la lettre B ou L. En SQL, cela s'appelle un alias. Il est beaucoup plus facile d'utiliser un alias que de réécrire le nom complet de la table. Le jeu de résultats affiche uniquement les lignes des deux tables qui ont le même identifiant d'emprunteur. Les lignes sont affichées si elles correspondent à Borrower_Id. Les lignes dont les Borrower_ID ne correspondent pas ne sont pas affichées. Les colonnes Borrower_Id, Lastname et Country sont extraites de la table Borrower et jointes aux colonnes Borrower_Id et Loan_Date de la table Loan pour créer le jeu de résultats. Dans cette vidéo, vous avez appris que : les jointures internes renvoient uniquement les lignes des tables dont la valeur correspond dans une colonne commune, généralement la clé primaire d'une table qui existe en tant que clé étrangère dans la deuxième table. Les lignes des tables jointes qui n'ont pas de valeur correspondante n'apparaissent pas dans le résultat.

# Joints externes

Bienvenue chez Outer Join. Après avoir visionné cette vidéo, vous serez en mesure de : Décrire les jointures externes gauches, les jointures externes droites et les jointures externes complètes Expliquer quand utiliser chaque type de jointure externe Décrire la syntaxe de l'instruction OUTER JOIN Les jointures extérieures, comme les jointures internes, renvoient les lignes de chaque table dont les valeurs correspondent dans les colonnes de jointure. Contrairement aux jointures internes, les jointures externes renvoient également les lignes qui ne correspondent pas entre les tables. SQL propose trois types de jointures externes : jointure externe gauche, jointure externe droite et jointure externe complète. Dans une jointure externe gauche, toutes les lignes de la première table (sur le côté gauche du prédicat de jointure) sont incluses, et seules les lignes correspondantes de la seconde table (sur le côté droit du prédicat de jointure). Dans ce diagramme, une jointure gauche correspond à toutes les lignes de la table de gauche et combine les informations avec les lignes de la table de droite qui répondent aux critères spécifiés dans la requête. Dans une jointure externe droite, toutes les lignes de la première table (sur le côté gauche du prédicat de jointure) sont incluses, et seules les lignes correspondantes de la seconde table (sur le côté droit du prédicat de jointure). Dans ce diagramme, une jointure droite correspond à toutes les lignes de la table de droite et combine les informations avec les lignes de la table de gauche qui répondent aux critères spécifiés dans la requête. Une jointure complète renvoie toutes les lignes du tableau de droite et du tableau de gauche. Ainsi, le FULL JOIN peut renvoyer un jeu de résultats très important. Dans ce diagramme, le jeu de résultats d'un RIGHT JOIN est constitué de toutes les lignes des deux tables correspondant aux critères spécifiés dans la requête, ainsi que de toutes les lignes non correspondantes de la table RIGHT. Il s'agit de la syntaxe de l'instruction SELECT pour un LEFT JOIN. Dans cet exemple, la table Borrower est la première table spécifiée dans la clause FROM de l'instruction SELECT. La table Borrower est donc la table LEFT et la table Loan est la table DROITE.
Lisez la vidéo à partir de :1:59 et suivez la transcription1:59
Dans la clause FROM, Borrower est répertorié sur le côté gauche de l'opérateur de jointure. Vous allez donc sélectionner toutes les lignes de la table Borrower et les combiner avec le contenu de la table Loan en fonction des critères spécifiés dans la requête. Dans cet exemple, le critère est la colonne BORROWER ID. Pour une jointure externe gauche, simplement appelée jointure gauche, vous allez sélectionner les colonnes suivantes dans la table Borrower : BorrowerID, LastName et Country, et vous allez également sélectionner les colonnes suivantes dans la table des prêts : BorrowerID et LoanDate. Le LEFT JOIN sélectionne chaque numéro d'emprunteur dans le tableau des emprunteurs et affiche la date du prêt dans le tableau des prêts. Le jeu de résultats indique l'identifiant de chaque emprunteur indiqué dans le tableau des emprunteurs, ainsi que la date du prêt pour cet emprunteur. Aucune date de prêt n'étant indiquée pour les trois dernières lignes, l'identifiant de l'emprunteur et la date du prêt affichent des valeurs nulles. Il s'agit de la syntaxe de l'instruction SELECT pour un RIGHT JOIN. Dans cet exemple, la table Borrower est la première table spécifiée dans la clause FROM de l'instruction SELECT. La table Borrower est donc la table LEFT et la table Loan est la table DROITE.
Lisez la vidéo à partir de :3:14 et suivez la transcription3:14
Dans la clause FROM, la table Loan est répertoriée sur le côté droit de l'opérateur de jointure. Vous devez donc sélectionner toutes les lignes de la table Loan et les combiner avec le contenu de la table Borrower en fonction des critères spécifiés dans la requête. Dans cet exemple, le critère est la colonne BORROWER_ID.
Lisez la vidéo à partir de :3:36 et suivez la transcription3:36
Pour une JOINTURE DROITE, vous allez sélectionner les colonnes suivantes dans la table des prêts : Borrower_ID et LoanDate, et vous allez également sélectionner les colonnes suivantes dans la table des emprunteurs : Borrower_ID, LastName et Country où le Borrower_ID dans la table Loan correspond au Borrower_ID dans la table Borrower. Le jeu de résultats indique chaque identifiant d'emprunteur indiqué dans le tableau des prêts et la date du prêt pour cet emprunteur, où l'identifiant de l'emprunteur indiqué dans le tableau des prêts existe également dans le tableau des emprunteurs. Pour la dernière ligne, aucune ligne ne correspond dans la table des emprunteurs, de sorte que les champs Borrower_ID, Lastname et Country affichent des valeurs nulles. Cela peut indiquer un problème pour la bibliothèque ; cela indique qu'un livre a été prêté à une personne inconnue. Il s'agit de la syntaxe de l'instruction SELECT pour une jointure complète. Pour une ADHÉSION COMPLÈTE, vous devez sélectionner toutes les lignes de la table des emprunteurs et toutes les lignes de la table des prêts. Le jeu de résultats montre les huit enregistrements de la table des emprunteurs répertoriés avec les données correspondantes de la table des prêts. Encore une fois, trois lignes renvoient une valeur NULL car les emprunteurs Peters, Li et Wong n'ont jamais prêté de livre.
Lisez la vidéo à partir de :4:52 et suivez la transcription4:52
La dernière ligne renvoie les valeurs pour Borrower_ID et Loan_Date depuis la table Laon, mais renvoie des valeurs NULL depuis la table Borrower. Dans ce cas, il n'y a aucune correspondance dans le tableau des emprunteurs : l'emprunteur de ce livre est inconnu. Dans cette vidéo, vous avez appris que : il existe de nombreuses variantes de jointure externe que vous pouvez utiliser pour affiner votre ensemble de résultats. Les jointures externes gauches renvoient toutes les lignes de la table de gauche, et toutes les lignes de la table de droite qui correspondent à ce qu'une jointure interne renverrait et toutes les lignes de la première table qui n'ont pas de correspondance dans la seconde table. Les jointures extérieures droites renvoient toutes les lignes qu'une jointure interne renverrait et toutes les lignes de la deuxième table qui n'ont pas de correspondance dans la première table. Les jointures externes complètes renvoient toutes les lignes correspondantes des deux tables et toutes les lignes des deux tables qui ne correspondent pas.

In [ ]:
Estimated time needed: 20 minutes

SQL JOIN is a clause that combines rows from two or more tables based on a related column between them. The table's relationship is established by comparing the values in the columns. The purpose of using JOINs is to retrieve data from multiple tables in a single query. There are four types of JOINs in SQL: INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL OUTER JOIN.

INNER JOIN: Returns only the rows with matching values in both tables.
LEFT JOIN: Returns all the rows from the left table and matching rows from the right table.
RIGHT JOIN: Returns all the rows from the right table and matching rows from the left table.
FULL OUTER JOIN: Returns all the rows when a match in the left or right table.

# Temps estimé nécessaire : 20 minutes

SQL JOIN est une clause qui combine les lignes de deux tables ou plus en fonction d’une colonne liée entre elles. La relation de la table est établie en comparant les valeurs des colonnes. L’objectif de l’utilisation des jointures est de récupérer des données à partir de plusieurs tables dans une seule requête. Il existe quatre types de jointures en SQL : JOINTURE INTERNE, JOINTURE GAUCHE, JOINTURE DROITE et JOINTURE EXTERNE COMPLÈTE.

- INNER JOIN : renvoie uniquement les lignes dont les valeurs correspondent dans les deux tables.
- JOINTURE GAUCHE : renvoie toutes les lignes de la table de gauche et les lignes correspondantes de la table de droite.
- JOINTURE DROITE : renvoie toutes les lignes de la table de droite et les lignes correspondantes de la table de gauche.
- JOINTURE EXTERNE COMPLÈTE : Renvoie toutes les lignes lorsqu’une correspondance est effectuée dans la table de gauche ou de droite.



# Objectifs

À la fin de cet atelier, vous serez en mesure de :

Écrire des requêtes SQL sur plusieurs tables à l’aide de INNER JOINS
Écrire des requêtes SQL sur plusieurs tables à l’aide de OUTER JOINS
Logiciels utilisés dans cet atelier
Dans cet atelier, vous allez utiliser MySQL. MySQL est un système de gestion de base de données relationnelle (SGBDR) conçu pour stocker, manipuler et récupérer efficacement des données.

Pour effectuer cet atelier, vous utiliserez le service de base de données relationnelle MySQL disponible dans le cadre de l’IDE cloud IBM Skills Network Labs (SN Labs). SN Labs est un environnement de laboratoire virtuel utilisé dans ce cours.

# Base de données utilisée dans cet atelier

La base de données utilisée dans cet atelier est interne. Vous travaillerez sur un exemple de base de données RH. Ce schéma de base de données RH se compose de cinq tables : EMPLOYÉS, JOB_HISTORY, EMPLOIS, SERVICES et EMPLACEMENTS. Chaque table comporte quelques lignes d’exemples de données. Le diagramme suivant montre les tables de la base de données RH :

Dans cet atelier, vous allez passer en revue des problèmes pratiques SQL qui vous permettront d’acquérir une expérience pratique des différents types d’opérations de jointure.

REMARQUE : Cet atelier nécessite que ces cinq tables de la base de données RH soient remplies avec des exemples de données sur MySQL.

# Charger la base de données
En utilisant les compétences acquises dans les modules précédents, vous devez d’abord créer la base de données en MySQL. Suivez les étapes ci-dessous :

1. ### Ouvrez l’interface phpMyAdmin à partir de la boîte à outils Skills Network dans Cloud IDE.

2. ### Créez une base de données vierge nommée « RH ». Utilisez le script partagé dans le lien ci-dessous pour créer les tables requises.

[Script_Create_Tables.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/scripts/Script_Create_Tables.sql)

3. ### Téléchargez les fichiers contenus dans les liens ci-dessous sur votre ordinateur local (si ce n’est pas déjà fait dans les ateliers précédents).

[Departments.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/HR_Database/Departments.csv)

[Jobs.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Jobs.csv)

[JobsHistory.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/JobsHistory.csv)

[Locations.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Locations.csv)

[Employees.csv](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Employees.csv)

[]()

# JOINS
Let us see some examples of JOINS being used to query the data.

1. ###  Retrieve the names and job start dates of all employees who work for department number 5.
We need to use the Inner join operation with the EMPLOYEES table as the left table and the JOB_HISTORY table as the right table. The join will be made over employee ID, and the query response will be filtered for the Department ID value 5.
The query for this question will be as shown below.

REJOINT
Voyons quelques exemples d’utilisation de JOINS pour interroger les données.


1. ### Récupérez les noms et les dates de début de travail de tous les employés qui travaillent pour le département numéro 5.


Nous devons utiliser l’opération de jointure interne avec la table EMPLOYEES comme table de gauche et la table JOB_HISTORY comme table de droite. La jointure sera effectuée sur l’ID de l’employé et la réponse à la requête sera filtrée pour la valeur 5 de l’ID de service.
La requête pour cette question sera comme indiqué ci-dessous.

In [ ]:
SELECT E.F_NAME,E.L_NAME, JH.START_DATE 
FROM EMPLOYEES as E 
INNER JOIN JOB_HISTORY as JH 
ON E.EMP_ID=JH.EMPL_ID 
WHERE E.DEP_ID ='5';

2. ### Retrieve employee ID, last name, department ID, and department name for all employees.
For this, you must use the Left Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table. The join will happen on the Department ID. The query will be written as follows:


 ### Récupérez l’ID de l’employé, le nom de famille, l’ID du service et le nom du service pour tous les employés.
Pour cela, vous devez utiliser l’opération Jointure externe gauche avec la table EMPLOYEES comme table de gauche et la table DEPARTMENTS comme table de droite. La jointure se fera sur l’ID du département. La requête s’écrira comme suit :

3. ### Retrieve the First name, Last name, and Department name of all employees.
For this, you will use the Full Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table. A full outer join in MySQL is implemented as a UNION of left and right outer joins. The query will be written as shown below.

 ### Récupérez le prénom, le nom et le nom du service de tous les employés.
Pour cela, vous allez utiliser l’opération Jointure externe complète avec la table EMPLOYEES comme table de gauche et la table DEPARTMENTS comme table de droite. Une jointure externe complète dans MySQL est implémentée en tant qu’UNION de jointures externes gauche et droite. La requête sera écrite comme indiqué ci-dessous.

In [ ]:
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID = D.DEPT_ID_DEP

UNION

SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
RIGHT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP

# Practice Problems

1. ### Retrieve the names, job start dates, and job titles of all employees who work for department number 5.

### Récupérez les noms, les dates de début de travail et les titres de poste de tous les employés qui travaillent pour le département numéro 5.

Hint

Perform an INNER JOIN with 3 tables: EMPLOYEES, JOB_HISTORY, JOBS.
Effectuez une JOINTURE INTERNE avec 3 tables : EMPLOYÉS, JOB_HISTORY, EMPLOIS.

Solution

In [ ]:
select E.F_NAME,E.L_NAME, JH.START_DATE, J.JOB_TITLE 
from EMPLOYEES as E 
INNER JOIN JOB_HISTORY as JH on E.EMP_ID=JH.EMPL_ID 
INNER JOIN JOBS as J on E.JOB_ID=J.JOB_IDENT
where E.DEP_ID ='5';

2. ### Retrieve employee ID, last name, and department ID for all employees but department names for only those born before 1980.

### Récupérez l’ID de l’employé, le nom de famille et l’ID du service pour tous les employés, mais uniquement les noms des services pour ceux nés avant 1980.

Hint
Use an AND in the LEFT OUTER JOIN clause.
Utilisez un AND dans la clause LEFT OUTER JOIN.

Solution

In [ ]:
SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID = D.DEPT_ID_DEP
AND YEAR(E.B_DATE) < 1980;

3. ### Retrieve the first name and last name of all employees but department ID and department names only for male employees.

### Récupère le prénom et le nom de tous les employés, mais l’ID du département et les noms des départements uniquement pour les employés masculins.

Hint
Add an AND in Query 3A to filter on male employees in the ON clause. Alternatively, you can also use Left Outer Join.


Ajoutez un ET dans la requête 3A pour filtrer les employés masculins dans la clause ON. Vous pouvez également utiliser la jointure externe gauche.

In [ ]:
SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP AND E.SEX = 'M'

UNION

SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
from EMPLOYEES AS E
RIGHT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP AND E.SEX = 'M';

Résumé : déclarations de jonctionStatut : Traduit automatiquement de Anglais
Traduit automatiquement de Anglais
Nous vous félicitons ! Vous avez terminé cette leçon. À ce stade du cours, vous savez ce qui suit :

- Une jointure combine les lignes de deux tables ou plus sur la base d'une relation entre certaines colonnes de ces tables.

- Pour combiner des données provenant de trois tables différentes ou plus, il vous suffit d'ajouter de nouvelles jointures à l'instruction SQL. 

- Il existe deux types de jointures : la jointure interne et la jointure externe, ainsi que trois types de jointures externes : la jointure externe gauche, la jointure externe droite et la jointure externe complète. 

- Le type de jointure le plus courant est la jointure interne, qui fait correspondre les résultats de deux tables et renvoie les éléments sélectionnés de chaque table, uniquement lorsque les éléments correspondants dans les deux tables sont identiques.

- Vous pouvez utiliser un alias pour abréger le nom d'une table ou d'une colonne.